import 'package:nahed_azkar/model/hadeth_model.dart';

class DataOfHadeth {
  static List<String> donya = [
    'قال الرّسول -صلّى الله عليه وسلّم-: (من كانتِ الآخرةُ هَمَّهُ جعلَ اللَّهُ غناهُ في قلبِهِ وجمعَ لَه شملَهُ وأتتهُ الدُّنيا وَهيَ راغمة، ومن كانتِ الدُّنيا همَّهُ جعلَ اللَّهُ فقرَهُ بينَ عينيهِ وفرَّقَ عليهِ شملَهُ، ولم يأتِهِ منَ الدُّنيا إلَّا ما قُدِّرَ لَهُ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (إن كنتُم تحبُّونَ حِلْيَةَ الجنَّةِ و حريرَها فلا تلبَسوها في الدُّنيا)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (لو كانتِ الدُّنيا تعدلُ عندَ اللهِ جناحَ بعوضةٍ ما سقى كافرًا منها شربةَ ماءٍ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (واللَّهِ ما الدُّنْيا في الآخِرَةِ إلَّا مِثْلُ ما يَجْعَلُ أحَدُكُمْ إصْبَعَهُ هذِه، وأَشارَ يَحْيَى بالسَّبَّابَةِ، في اليَمِّ، فَلْيَنْظُرْ بمَ تَرْجِعُ؟)',
    'رُوي عن أبي هريرة -رضي الله عنه- أنه قال: (خَرَجَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ مِنَ الدُّنْيَا ولَمْ يَشْبَعْ مِن خُبْزِ الشَّعِيرِ)',
    'رُوي عن أنس بن مالك -رضي الله عنه- أنه قال: (لَمْ يَأْكُلِ النبيُّ صَلَّى اللهُ عليه وسلَّمَ علَى خِوَانٍ حتَّى مَاتَ، وما أكَلَ خُبْزًا مُرَقَّقًا حتَّى مَاتَ)',
    'رُوي عن النعمان بن بشير -رضي الله عنه- أنه قال: (لقد رأيتُ نبيَّكم صلَّى اللَّهُ عليْهِ وسلَّمَ وما يجدُ منَ الدَّقلِ ما يملأُ بِهِ بطنَهُ)',
    'رُوي عن سعد بن أبي وقاص -رضي الله عنه- أنه قال: (وَاللَّهِ إنِّي لأَوَّلُ رَجُلٍ مِنَ العَرَبِ، رَمَى بسَهْمٍ في سَبيلِ اللهِ، وَلقَدْ كُنَّا نَغْزُو مع رَسولِ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ، ما لَنَا طَعَامٌ نَأْكُلُهُ إلَّا وَرَقُ الحُبْلَةِ وَهذا السَّمُرُ، حتَّى إنَّ أَحَدَنَا لَيَضَعُ كما تَضَعُ الشَّاةُ)',
    'قال رسول الله صلى الله عليه وسلم: (مَن كانتْ نيتُه طلبَ الآخِرَةِ؛ جعل الله غِناه في قلبِه، وجَمَع له شملَه، وأتَتْه الدنيا وهي راغِمةٌ، ومَنْ كانت نيتُه طَلَبَ الدنيا؛ جعل اللهُ الفقرَ بين عينيه، وشَتَّتَ عليه أمرَه، ولا يأتِيه مِنها إلا ما كُتِبَ له)',
    'قال رسول الله صلى الله عليه وسلم: (الذَّهَبُ والفِضَّةُ، والحَرِيرُ والدِّيبَاجُ، هي لهمْ في الدُّنْيَا، ولَكُمْ في الآخِرَةِ)',
  ];

  static List<String> love = [
    'قال الرّسول -صلّى الله عليه وسلّم-: (لَا يُؤْمِنُ أحَدُكُمْ، حتَّى يُحِبَّ لأخِيهِ ما يُحِبُّ لِنَفْسِهِ)',
    'قال الرّسول -صلّى الله عليه وسلّم-:(لا تَدْخُلُونَ الجَنَّةَ حتَّى تُؤْمِنُوا، ولا تُؤْمِنُوا حتَّى تَحابُّوا، أوَلا أدُلُّكُمْ علَى شيءٍ إذا فَعَلْتُمُوهُ تَحابَبْتُمْ؟ أفْشُوا السَّلامَ بيْنَكُمْ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (إذا أحبَّ الرجلُ أخاه فلْيخبره أنّه يحبُّه)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (لا يُؤْمِنُ أحدُكم حتى أكونَ أحبَّ إليه من ولدِهِ، ووالدِهِ، والناسِ أجمعينَ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (ثَلَاثٌ مَن كُنَّ فيه وجَدَ حَلَاوَةَ الإيمَانِ: أنْ يَكونَ اللَّهُ ورَسولُهُ أحَبَّ إلَيْهِ ممَّا سِوَاهُمَا، وأَنْ يُحِبَّ المَرْءَ لا يُحِبُّهُ إلَّا لِلَّهِ، وأَنْ يَكْرَهَ أنْ يَعُودَ في الكُفْرِ كما يَكْرَهُ أنْ يُقْذَفَ في النَّارِ)',
    '(إِذَا أحَبَّ اللَّهُ العَبْدَ نَادَى جِبْرِيلَ: إنَّ اللَّهَ يُحِبُّ فُلَانًا فأحْبِبْهُ، فيُحِبُّهُ جِبْرِيلُ، فيُنَادِي جِبْرِيلُ في أهْلِ السَّمَاءِ: إنَّ اللَّهَ يُحِبُّ فُلَانًا فأحِبُّوهُ، فيُحِبُّهُ أهْلُ السَّمَاءِ، ثُمَّ يُوضَعُ له القَبُولُ في الأرْضِ)',
    '(إنَّ اللَّهَ قالَ: مَن عادَى لي وَلِيًّا فقَدْ آذَنْتُهُ بالحَرْبِ، وما تَقَرَّبَ إلَيَّ عَبْدِي بشَيءٍ أحَبَّ إلَيَّ ممَّا افْتَرَضْتُ عليه، وما يَزالُ عَبْدِي يَتَقَرَّبُ إلَيَّ بالنَّوافِلِ حتَّى أُحِبَّهُ، فإذا أحْبَبْتُهُ، كُنْتُ سَمْعَهُ الَّذي يَسْمَعُ به، وبَصَرَهُ الَّذي يُبْصِرُ به، ويَدَهُ الَّتي يَبْطِشُ بها، ورِجْلَهُ الَّتي يَمْشِي بها، وإنْ سَأَلَنِي لَأُعْطِيَنَّهُ، ولَئِنِ اسْتَعاذَنِي لَأُعِيذَنَّهُ)',
    '(إن عظم الجزاء مع عظم البلاء و إن الله إذا أحب قوماً ابتلاهم فمن رضي فله الرضا و من سخط فله السخط)',
    '(أنَّ أَعْرَابِيًّا، قالَ لِرَسُولِ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ مَتَى السَّاعَةُ؟ قالَ له رَسُولُ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ: ما أَعْدَدْتَ لَهَا؟ قالَ: حُبَّ اللهِ وَرَسُولِهِ، قالَ: أَنْتَ مع مَن أَحْبَبْتَ)',
    '(أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ بَعَثَ رَجُلًا علَى سَرِيَّةٍ، وكانَ يَقْرَأُ لأصْحَابِهِ في صَلَاتِهِمْ فَيَخْتِمُ بقُلْ هو اللَّهُ أحَدٌ، فَلَمَّا رَجَعُوا ذَكَرُوا ذلكَ للنبيِّ صَلَّى اللهُ عليه وسلَّمَ، فَقالَ: سَلُوهُ لأيِّ شيءٍ يَصْنَعُ ذلكَ؟، فَسَأَلُوهُ، فَقالَ: لأنَّهَا صِفَةُ الرَّحْمَنِ، وأَنَا أُحِبُّ أنْ أقْرَأَ بهَا، فَقالَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ: أخْبِرُوهُ أنَّ اللَّهَ يُحِبُّهُ)',
    '(كان من دُعاءِ داودَ يقولُ : اللهُمَّ ! إنِّي أسألُك حُبَّك وحُبَّ من يُحبُّك، والعملَ الَّذي يُبَلِّغُنِي حُبَّكَ، اللهُمَّ! اجْعلْ حُبَّكَ أحَبَّ إليَّ من نَفْسِي وأهْلِي، ومن الماءِ البارِدِ، قال: وكانَ رسولُ اللهِ صلَّى اللهُ عليه وسَلَّمَ، إذا ذكر دَاوُدَ يُحَدِّثُ عنهُ قال: كان أعْبَدَ البشَرِ)',
    '(إنَّ اللَّهَ يقولُ يَومَ القِيامَةِ: أيْنَ المُتَحابُّونَ بجَلالِي، اليومَ أُظِلُّهُمْ في ظِلِّي يَومَ لا ظِلَّ إلَّا ظِلِّي)',
    '(ثَلَاثٌ مَن كُنَّ فيه وجَدَ حَلَاوَةَ الإيمَانِ: مَن كانَ اللَّهُ ورَسولُهُ أحَبَّ إلَيْهِ ممَّا سِوَاهُمَا، ومَن أحَبَّ عَبْدًا لا يُحِبُّهُ إلَّا لِلَّهِ عزَّ وجلَّ، ومَن يَكْرَهُ أنْ يَعُودَ في الكُفْرِ، بَعْدَ إذْ أنْقَذَهُ اللَّهُ، منه كما يَكْرَهُ أنْ يُلْقَى في النَّارِ)',
    '( مَن أحَبَّ للهِ، وأبغَض للهِ، وأعطى للهِ، ومنَع للهِ، فقد استكمَل الإيمانَ)',
    '(من أحبَّ أن يجدَ طعمَ الإيمانِ فلْيُحبَّ المرءَ لا يُحبُّه إلا للهِ)',
  ];

  static List<String> ethics = [
    'قال الرسول -صلّى الله عليه وسلّم-: (من أُعطِيَ حظَّه من الرِّفقِ فقد أُعطِيَ حظَّه من الخيرِ ومن حُرِمَ حظُّه من الرِّفقِ ؛ فقد حُرِمَ حظُّه من الخيرِ . أثقلٌ شيءٍ في ميزانِ المؤمنِ يومَ القيامةِ حُسنُ الخُلُقِ ، وإنَّ اللهَ لَيبغضُ الفاحشَ البذِيءَ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (إنَّ صاحبَ حُسنِ الخلقِ ليبلُغُ بِهِ درجةَ صاحبِ الصَّومِ والصَّلاةِ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (ما شيءٌ أثقلُ في ميزانِ المؤمِنِ يومَ القيامةِ مِن خُلُقٍ حسَنٍ، فإنَّ اللَّهَ تعالى ليُبغِضُ الفاحشَ البَذيءَ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (إنَّ مِن أحبِّكم إليَّ وأقربِكُم منِّي مجلسًا يومَ القيامةِ أحاسنَكُم أخلاقًا ، وإنَّ مِن أبغضِكُم إليَّ وأبعدِكُم منِّي يومَ القيامةِ الثَّرثارونَ والمتشدِّقونَ والمتفَيهِقونَ، قالوا : يا رسولَ اللَّهِ، قد علِمنا الثَّرثارينَ والمتشدِّقينَ فما المتفَيهقونَ ؟ قالَ : المتَكَبِّرونَ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (مَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فلا يُؤْذِ جارَهُ، ومَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، ومَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيَقُلْ خَيْرًا أوْ لِيَصْمُتْ)',
    'رُوي عن عبد الله بن عمرو -رضي الله عنه- أنه قال: (لَمْ يَكُنِ النبيُّ صَلَّى اللهُ عليه وسلَّمَ فَاحِشًا ولَا مُتَفَحِّشًا، وكانَ يقولُ: إنَّ مِن خِيَارِكُمْ أحْسَنَكُمْ أخْلَاقًا)',
    'قال رسول الله صلى الله عليه وسلم: (ما مِن شيءٍ أثقلُ في الميزانِ من حُسنِ الخُلُقِ)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّ مِن أحبِّكم إليَّ وأقربِكُم منِّي مجلسًا يومَ القيامةِ أحاسنَكُم أخلاقًا)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّ المؤمنَ ليُدْرِكُ بحُسْنِ خُلُقِه درجةَ الصَّائمِ القائمِ)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّ أكملَ أو من أكملِ المؤمنين إيمانًا أحسنُهم خُلقًا)',
    'سُئل رسول الله -صلى الله عليه وسلم- عن أكثر شيء يُدخل الناس الجنة، فقال: (تَقْوَى اللهِ وحُسْنُ الخُلُقِ)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّما بُعِثْتُ لأُتممَ صالحَ الأخلاقِ)',
  ];

  static List<String> patience = [
    'قال الرّسول -صلّى الله عليه وسلّم-: (ما يُصِيبُ المُؤْمِنَ مِن وصَبٍ، ولا نَصَبٍ، ولا سَقَمٍ، ولا حَزَنٍ حتَّى الهَمِّ يُهَمُّهُ، إلَّا كُفِّرَ به مِن سَيِّئاتِهِ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (عَجَبًا لأَمْرِ المُؤْمِنِ، إنَّ أمْرَهُ كُلَّهُ خَيْرٌ، وليسَ ذاكَ لأَحَدٍ إلَّا لِلْمُؤْمِنِ، إنْ أصابَتْهُ سَرَّاءُ شَكَرَ، فَكانَ خَيْرًا له، وإنْ أصابَتْهُ ضَرَّاءُ، صَبَرَ فَكانَ خَيْرًا له)',
    'عن ابن عباس -رضيَ الله عنهما- قال: (أتَتِ النَّبيَّ صلَّى اللهُ عليه وسلَّم امرأة فَقَالَتْ: إنِّي أُصْرَعُ، وإنِّي أتَكَشَّفُ، فَادْعُ اللَّهَ لِي، قَالَ: إنْ شِئْتِ صَبَرْتِ ولَكِ الجَنَّةُ، وإنْ شِئْتِ دَعَوْتُ اللَّهَ أنْ يُعَافِيَكِ، فَقَالَتْ: أصْبِرُ، فَقَالَتْ: إنِّي أتَكَشَّفُ، فَادْعُ اللَّهَ لي ألَّا أتَكَشَّفَ، فَدَعَا لَهَا)',
    'قال -صلى الله عليه وسلم-: (ما أُعْطِيَ أحَدٌ عَطَاءً خَيْرًا وأَوْسَعَ مِنَ الصَّبْرِ)',
    'ن ابنِ مسعودٍ -رضي الله عنه- أنه قال: (الصَّبرُ نصفُ الإيمانِ واليقينُ الإيمانُ كلُّهُ)',
    'قال -صلى الله عليه وسلم-: (إذا أحبَّ اللَّهُ قومًا ابتلاهم فمن صبرَ فلَهُ الصَّبرُ)',
    'قال -صلى الله عليه وسلم-: (واعلَمْ أنَّ في الصَّبرِ على ما تَكرَهُ خَيرًا كَثيرًا، وأنَّ النَّصرَ مع الصَّبرِ)',
    'قال -صلى الله عليه وسلم-: (مَن صَامَ رَمَضَانَ، إيمَانًا واحْتِسَابًا، غُفِرَ له ما تَقَدَّمَ مِن ذَنْبِهِ)',
    'قال -صلى الله عليه وسلم-: (أتحبُّونَ أن تجتَهِدوا في الدُّعاءِ، قولوا: اللَّهُمَّ أعنَّا على شُكْرِكَ وذِكْرِكَ، وحُسنِ عبادتِكَ)',
    'قال -صلى الله عليه وسلم-: (وإنْ أَصَابَكَ شيءٌ، فلا تَقُلْ لو أَنِّي فَعَلْتُ كانَ كَذَا وَكَذَا، وَلَكِنْ قُلْ قَدَرُ اللهِ وَما شَاءَ فَعَلَ)',
    'قال -صلى الله عليه وسلم-: (المؤمِنُ الَّذي يخالطُ النَّاسَ ويصبِرُ على أذاهُم، خيرٌ مِن الَّذي لا يخالِطُ النَّاسَ ولا يصبِرُ على أذاهُمْ)',
    'قال -صلى الله عليه وسلم-: (فيُبتلى الرجلُ على حسَبِ دينِه فإنْ كان رقيقَ الدِّينِ ابتُليَ على حسَبِ ذاك وإنْ كان صلبَ الدينِ ابتُلي على حسَبِ ذاك قال: فما تزال البلايا بالرجلِ حتى يمشيَ في الأرضِ وما عليهِ خطيئةٌ)',
    'قال -صلى الله عليه وسلم-: (لَا يَصْبِرُ علَى لَأْوَاءِ المَدِينَةِ وَشِدَّتِهَا أَحَدٌ مِن أُمَّتِي، إِلَّا كُنْتُ له شَفِيعًا يَومَ القِيَامَةِ، أَوْ شَهِيدًا)',
    'قال -صلى الله عليه وسلم-: (إنَّ السَّعيدَ لمن جُنِّب الفتنَ، ولمن ابتُلِيَ فصبرَ)',
  ];

  static List<String> janna = [
    'سُئل الرّسول -صلّى الله عليه وسلّم- عن الجنّة فقال: (لبِنةٌ من فضَّةٍ ولبنةٌ من ذَهَبٍ، وملاطُها المسكُ الأذفرُ، وحصباؤُها اللُّؤلؤُ والياقوتُ، وتُربتُها الزَّعفرانُ مَن دخلَها ينعَمُ ولا يبأسُ، ويخلدُ ولا يموتُ، لا تبلَى ثيابُهُم، ولا يفنى شَبابُهُم)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (مَن يَدْخُلُ الجَنَّةَ يَنْعَمُ لا يَبْأَسُ، لا تَبْلَى ثِيابُهُ ولا يَفْنَى شَبابُهُ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (إن في الجنةِ لشجرةً يسيرُ الراكبُ في ظلّها مائةَ عامٍ لا يقطعُها واقرأوا إن شئتُم (وْظِلٍّ مَمْدُودٍ وَمَاءٍ مَسْكُوبٍ))',
    'قال الرّسول -صلّى الله عليه وسلّم- فيما رواه عن الله -تبارك وتعالى-: (إنَّ اللَّهَ تَبارَكَ وتَعالَى يقولُ لأهْلِ الجَنَّةِ: يا أهْلَ الجَنَّةِ، فيَقولونَ: لَبَّيْكَ رَبَّنا وسَعْدَيْكَ، فيَقولُ: هلْ رَضِيتُمْ؟ فيَقولونَ: وما لنا لا نَرْضَى وقدْ أعْطَيْتَنا ما لَمْ تُعْطِ أحَدًا مِن خَلْقِكَ؟ فيَقولُ: أنا أُعْطِيكُمْ أفْضَلَ مِن ذلكَ، قالوا: يا رَبِّ، وأَيُّ شَيءٍ أفْضَلُ مِن ذلكَ؟ فيَقولُ: أُحِلُّ علَيْكُم رِضْوانِي، فلا أسْخَطُ علَيْكُم بَعْدَهُ أبَدًا)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (إنَّ أوَّلَ زُمرَةٍ يدخُلُونَ الجنةَ على صُورةِ القَمَرِ ليلةَ البدْرِ، ثمِّ الّذينَ يلُونهمْ على أشَدِّ كوكَبٍ دُرِّيٍ في السماءِ إضاءةً، لا يَبولُونَ، ولا يَتغوَّطُونَ، ولا يتْفُلُونَ، ولا يَتَمَخَّطُونَ، أمْشاطُهمْ الذَّهبُ، ورشْحُهمُ المِسكُ، ومَجامِرُهمْ الأَلُوَّةُ، وأزواجُهمْ الحُورُ العينُ، أخلاقُهمْ على خُلُقِ رجلٍ واحِدٌ، على صُورةِ أبيهِمْ آدَمَ، سِتُّونَ ذِراعًا في السماءِ)',
    'قال الرّسول -صلّى الله عليه وسلّم-: (يُنادِي مُنادٍ: إنَّ لَكُمْ أنْ تَصِحُّوا فلا تَسْقَمُوا أبَدًا، وإنَّ لَكُمْ أنْ تَحْيَوْا فلا تَمُوتُوا أبَدًا، وإنَّ لَكُمْ أنْ تَشِبُّوا فلا تَهْرَمُوا أبَدًا، وإنَّ لَكُمْ أنْ تَنْعَمُوا فلا تَبْأَسُوا أبَدًا)',
  ];

  static List<String> qudsi = [
    'قال الرّسول -صلّى الله عليه وسلّم-: (يقولُ اللَّهُ عَزَّ وَجَلَّ: مَن جَاءَ بالحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وَأَزِيدُ، وَمَن جَاءَ بالسَّيِّئَةِ فَجَزَاؤُهُ سَيِّئَةٌ مِثْلُهَا، أَوْ أَغْفِرُ وَمَن تَقَرَّبَ مِنِّي شِبْرًا تَقَرَّبْتُ منه ذِرَاعًا، وَمَن تَقَرَّبَ مِنِّي ذِرَاعًا تَقَرَّبْتُ منه بَاعًا، وَمَن أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً، وَمَن لَقِيَنِي بقُرَابِ الأرْضِ خَطِيئَةً لا يُشْرِكُ بي شيئًا لَقِيتُهُ بمِثْلِهَا مَغْفِرَةً. وفي روايةٍ : بهذا الإسْنَادِ نَحْوَهُ، غيرَ أنَّهُ قالَ: فَلَهُ عَشْرُ أَمْثَالِهَا، أَوْ أَزِيدُ)',
    'قال الرّسول -صلّى الله عليه وسلّم- فيما رواه عن الله -تبارك وتعالى-: (يَقولُ اللهُ تعالى: يا عِبادي، إنِّي حرَّمْتُ الظُّلمَ على نفْسي، وجعَلْتُه بينَكم مُحرَّمًا؛ فلا تظالَموا، يا عبادي، كلُّكم ضالٌّ إلَّا مَن هدَيْتُه؛ فاستَهْدوني أَهدِكم، يا عبادي، كلُّكم جائِعٌ إلا مَن أطعَمْتُه؛ فاستطعِموني أُطعِمْكم، يا عبادي؛ كلُّكم عارٍ إلَّا مَن كسَوْتُه؛ فاستَكْسوني أَكْسُكُمْ، يا عبادي، إنَّكم تُذنِبونَ باللَّيلِ والنَّهارِ وأنا أغفِرُ الذُّنوبَ ولا أُبالي؛ فاستغفِرُوني أغفِرْ لكم، يا عبادي، إنَّكم لن تَبلُغوا ضُرِّي فتَضرُّوني ولن تَبلُغوا نَفْعي فتنفَعوني، يا عبادي، لو أنَّ أوَّلَكم وآخِرَكم وإنسَكم وجِنَّكم كانوا على أتقَى قَلبِ رَجُلٍ واحدٍ منكم ما زاد ذلك في مُلكي شيئًا، يا عبادي، لو أنَّ أوَّلَكم وآخِرَكم وإنسَكم وجِنَّكم كانوا على أفجَرِ قلبِ رجلٍ واحدٍ منكم ما نقَصَ ذلك مِن مُلكي شيئًا، يا عبادي، لو أنَّ أوَّلَكم وآخِرَكم وإنسَكم وجِنَّكم اجتمَعُوا في صَعيدٍ واحدٍ فسأَلُوني فأعطَيتُ كلَّ واحدٍ منهم مسألتَه ما نقَصَ ذلك مِن مُلكي إلَّا كما يَنقُصُ المِخْيَطُ إذا غُمِسَ في البحرِ، يا عبادي، إنَّما هي أعمالُكم أُحصيها لكم ثمَّ أُوفِّيكم إيَّاها، فمَن وجَدَ خيرًا فلْيَحْمَدِ اللهَ، ومَن وجَدَ غيرَ ذلك فلا يَلومَنَّ إلَّا نفسَه)',
    'قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: (قالَ اللَّهُ عزَّ وجلَّ المتحابُّونَ في جلالي لَهُم مَنابرُ مِن نورٍ يغبطُهُمُ النَّبيُّونَ والشُّهداءُ)',
    'قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم قال اللهُ تبارَك وتعالى: (مَن أظلَمُ ممَّن ذهَب يخلُقُ كخَلْقي فلْيخلُقوا حَبَّةً أو لِيخلُقوا ذَرَّةً)',
    'قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: (أَلَمْ تَرَوْا إلى ما قالَ رَبُّكُمْ؟ قالَ: ما أَنْعَمْتُ علَى عِبَادِي مِن نِعْمَةٍ إِلَّا أَصْبَحَ فَرِيقٌ منهمْ بِهَا كَافِرِينَ. يقولونَ الكَوَاكِبُ وَبِالْكَوَاكِبِ)',
    'قال رسول الله صلى الله عليه وسلم:(قالَ اللَّهُ تبارَكَ وتعالى يا ابنَ آدمَ إنَّكَ ما دعوتَني ورجوتَني غفَرتُ لَكَ على ما كانَ فيكَ ولا أبالي، يا ابنَ آدمَ لو بلغت ذنوبُكَ عَنانَ السَّماءِ ثمَّ استغفرتَني غفرتُ لَكَ، ولا أبالي، يا ابنَ آدمَ إنَّكَ لو أتيتَني بقرابِ الأرضِ خطايا ثمَّ لقيتَني لا تشرِكُ بي شيئًا لأتيتُكَ بقرابِها مغفرةً)',
    'قالَ اللَّهُ تَبارَكَ وتَعالَى:(إذا ابْتَلَيْتُ عَبْدِي بحَبِيبَتَيْهِ، فَصَبَرَ؛ عَوَّضْتُهُ منهما الجَنَّةَ. يُرِيدُ عَيْنَيْهِ)',
    'قالَ اللَّهُ تَبارَكَ وتَعالَى:(كُلُّ عَمَلِ ابْنِ آدَمَ له إلَّا الصَّوْمَ، فإنَّه لي وأنا أجْزِي به، ولَخُلُوفُ فَمِ الصَّائِمِ أطْيَبُ عِنْدَ اللَّهِ مِن رِيحِ المِسْكِ)',
  ];

  static List parentes = [
    'قال رسول الله صلى الله عليه وسلم: (رضا الربّ في رضا الوالدينِ، وسخطُهُ في سخطِهما)',
    'قال رسول الله صلى الله عليه وسلم: (لن يجزيَ ولدٌ والدَه إلا أن يجدَه مملوكًا، فيشتريَه، فيعتقَه)',
    'قال رسول الله صلى الله عليه وسلم: (ألا أحدِّثُكم بأَكبرِ الكبائرِ؟ قالوا: بلى يا رسولَ اللهِ، قال: الإشراكُ باللهِ، وعقوقُ الوالدينِ)',
    'قال رسول الله صلى الله عليه وسلم: (رَغِمَ أنْفُهُ، ثُمَّ رَغِمَ أنْفُهُ، ثُمَّ رَغِمَ أنْفُهُ قيلَ: مَنْ؟ يا رَسولَ اللهِ، قالَ: مَن أدْرَكَ والِدَيْهِ عِنْدَ الكِبَرِ، أحَدَهُما، أوْ كِلَيْهِما، ثُمَّ لَمْ يَدْخُلِ الجَنَّةَ)',
    'سأل عبد الله بن مسعود -رضي الله عنه- رسول الله صلى الله عليه وسلم، فقال: (أيُّ الأعمالِ أحَبُّ إلى اللهِ تعالى؟ قال: الصَّلاةُ لِوَقتِها، فقُلتُ: ثم أيُّ؟ قال: ثم بِرُّ الوالدينِ، ثم قُلتُ: ثم أيُّ؟ قال: الجِهادُ في سَبيلِ اللهِ عزَّ وجلَّ ولوِ استَزَدتُه لزادَني)',
    'جاء رَجُلٌ إلى رسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، واستأذَنَه في الجهادِ، فقال له رسول الله صلى الله عليه وسلم: (أحَيٌّ والداكَ؟ قال: نعمْ، قال: ففيهما فجاهِدْ)',
  ];

  static List askLearn = [
    'قال رسول الله صلّى الله عليه وسلّم: (طلبُ العلمِ فريضةٌ على كلِّ مسلمٍ)',
    'عن جابر بن عبد الله -رضي الله عنه- قال: قال رسول الله صلّى الله عليه وسلم: (سلُوا اللهَ علمًا نافعًا، وتَعَوَّذُوا باللهِ منْ علمٍ لا ينفعُ)',
    'قال رسول الله صلّى الله عليه وسلّم: (من سلَكَ طريقًا يبتغي فيهِ علمًا سلَكَ اللهُ بِهِ طريقًا إلى الجنَّةِ وإنَّ الملائِكةَ لتضعُ أجنحتَها رضاءً لطالبِ العلمِ وإنَّ العالمَ ليستغفرُ لَهُ من في السَّمواتِ ومن في الأرضِ حتَّى الحيتانُ في الماءِ وفضلُ العالمِ على العابدِ كفضلِ القمرِ على سائرِ الكواكبِ إنَّ العلماءَ ورثةُ الأنبياءِ إنَّ الأنبياءَ لم يورِّثوا دينارًا ولا درْهمًا إنَّما ورَّثوا العلمَ فمَن أخذَ بِهِ فقد أخذَ بحظٍّ وافرٍ)',
    'قال رسول الله صلى الله عليه وسلم: (إِذَا مَاتَ الإنْسَانُ انْقَطَعَ عنْه عَمَلُهُ إِلَّا مِن ثَلَاثَةٍ: إِلَّا مِن صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو له)',
    'قال رسول الله صلّى الله عليه وسلّم: (لا حسَدَ إلَّا في اثنتيْنِ: رجلٌ آتاهُ اللهُ مالًا، فسلَّطَهُ على هلَكتِه في الحقِّ، ورجلٌ آتاهُ اللهُ الحِكمةَ، فهوَ يقضِي بِها، ويُعلِّمُها)',
    'قال رسول الله صلى الله عليه وسلم: (مَن جاءَ مَسجِدي هذا لم يَأتِهِ إلَّا لِخيرٍ يتعلَّمُهُ أو يعلِّمُهُ فَهوَ بمنزلةِ المجاهِدِ في سبيلِ اللهِ ومن جاءَ لغيرِ ذلِكَ فَهوَ بمنزلةِ الرَّجُلِ ينظرُ إلى متاعِ غيرِهِ)',
    'قال رسول الله صلّى الله عليه وسلّم: (سيأتيكُم أقوامٌ يطلبونَ العِلمَ فإذا رأيتُموهم فقولوا لَهُم مَرحبًا مَرحبًا بوصيَّةِ رسولِ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ واقْنوهُم)',
    'قال رسول الله صلى الله عليه وسلم: (فضلُ العلْمِ أحبُّ إِلَيَّ مِنْ فضلِ العبادَةِ، وخيرُ دينِكُمُ الورَعُ)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّ اللَّهَ لا يَقْبِضُ العِلْمَ انْتِزَاعًا يَنْتَزِعُهُ مِنَ العِبَادِ، ولَكِنْ يَقْبِضُ العِلْمَ بقَبْضِ العُلَمَاءِ، حتَّى إذَا لَمْ يُبْقِ عَالِمًا اتَّخَذَ النَّاسُ رُؤُوسًا جُهَّالًا، فَسُئِلُوا فأفْتَوْا بغيرِ عِلْمٍ، فَضَلُّوا وأَضَلُّوا)',
    'قال رسول الله صلّى الله عليه وسلّم: (فَوَاللهِ لَأَنْ يَهْدِيَ اللهُ بكَ رَجُلًا واحِدًا، خَيْرٌ لكَ مِن أنْ يَكونَ لكَ حُمْرُ النَّعَمِ)',
    'قال رسول الله صلّى الله عليه وسلّم: (إنَّ مَثَلَ ما بَعَثَنِيَ اللَّهُ به عزَّ وجلَّ مِنَ الهُدَى والْعِلْمِ، كَمَثَلِ غَيْثٍ أصابَ أرْضًا، فَكانَتْ مِنْها طائِفَةٌ طَيِّبَةٌ، قَبِلَتِ الماءَ فأنْبَتَتِ الكَلأَ والْعُشْبَ الكَثِيرَ، وكانَ مِنْها أجادِبُ أمْسَكَتِ الماءَ، فَنَفَعَ اللَّهُ بها النَّاسَ، فَشَرِبُوا مِنْها وسَقَوْا ورَعَوْا، وأَصابَ طائِفَةً مِنْها أُخْرَى، إنَّما هي قِيعانٌ لا تُمْسِكُ ماءً، ولا تُنْبِتُ كَلَأً، فَذلكَ مَثَلُ مَن فَقُهَ في دِينِ اللهِ، ونَفَعَهُ بما بَعَثَنِيَ اللَّهُ به، فَعَلِمَ وعَلَّمَ، ومَثَلُ مَن لَمْ يَرْفَعْ بذلكَ رَأْسًا، ولَمْ يَقْبَلْ هُدَى اللهِ الذي أُرْسِلْتُ بهِ)',
    'قال رسول الله صلى الله عليه وسلم: (نضَّرَ اللَّهُ امرأً سمِعَ منَّا حديثًا فحفِظَهُ حتَّى يبلِّغَهُ غيرَهُ فرُبَّ حاملِ فقهٍ ليسَ بفَقيهٍ ورُبَّ حاملِ فقهٍ إلى من هوَ أفقَهُ منهُ)',
  ];

  static List mother = [
    'روى مسلم عن أبي هريرة رضي الله عنه: (جَاءَ رَجُلٌ إلى رَسُولِ اللهِ صَلَّى اللهُ عليه وَسَلَّمَ، فَقالَ: مَن أَحَقُّ النَّاسِ بحُسْنِ صَحَابَتِي؟ قالَ: أُمُّكَ قالَ: ثُمَّ مَنْ؟ قالَ: ثُمَّ أُمُّكَ قالَ: ثُمَّ مَنْ؟ قالَ: ثُمَّ أُمُّكَ قالَ: ثُمَّ مَنْ؟ قالَ: ثُمَّ أَبُوكَ. وفي حَديثِ قُتَيْبَةَ: مَن أَحَقُّ بحُسْنِ صَحَابَتي، وَلَمْ يَذْكُرِ النَّاسَ)',
    'سأل جاهمة رسول الله صلى الله عليه وسلم: (يا رسولَ اللهِ، أردتُ أن أغزوَ وقد جئتُ أستشيرُكَ؟ فقالَ: هل لَكَ مِن أمّ؟ قالَ: نعَم، قالَ: فالزَمها فإنَّ الجنَّةَ تحتَ رِجلَيها)',
    'ثبت عن أبي هريرة -رضيَ الله عنه- أنه قال: (قالَ رَجُلٌ: يا رَسُولَ اللهِ، مَن أَحَقُّ النَّاسِ بحُسْنِ الصُّحْبَةِ؟ قالَ: أُمُّكَ، ثُمَّ أُمُّكَ، ثُمَّ أُمُّكَ، ثُمَّ أَبُوكَ، ثُمَّ أَدْنَاكَ أَدْنَاكَ)',
    'ثبت عن المقدام -رضيَ الله عنه- أنّ رسول الله -صلّى الله عليه وسلّم- قال: (إنَّ اللَّهَ يوصيكم بأمَّهاتِكم ثلاثًا إنَّ اللَّهَ يوصيكم بآبائِكم إنَّ اللَّهَ يوصيكم بالأقربِ فالأقرب)',
    'ورد عن أبي أيوب الأنصاري -رضيَ الله عنه- أنّ رسول الله -صلّى الله عليه وسلّم- قال: (من فرَّق بين والدةٍ و ولدِها فرَّق اللهُ بينه و بين أَحِبَّتِه يومَ القيامةِ)',
    'ثبت عن أنس بن مالك -رضيَ الله عنه- عن رسول الله -صلّى الله عليه وسلّم- قال: (إنِّي لَأَدْخُلُ في الصَّلَاةِ، فَأُرِيدُ إطَالَتَهَا، فأسْمَعُ بُكَاءَ الصَّبِيِّ، فأتَجَوَّزُ ممَّا أَعْلَمُ مِن شِدَّةِ وجْدِ أُمِّهِ مِن بُكَائِهِ)',
    'ثبت عن المغيرة بن شعبة -رضيَ الله عنه- أنّ رسول الله -صلّى الله عليه وسلّم- قال: (إنَّ اللَّهَ حَرَّمَ علَيْكُم: عُقُوقَ الأُمَّهَاتِ، ووَأْدَ البَنَاتِ، ومَنَعَ وهَاتِ)',
    'ثبت عن أبي بكرة -رضي الله عنه- أنّ رسول الله -صلّى الله عليه وسلّم- قال: (أَلَا أُنَبِّئُكُمْ بِأَكْبَرِ الكَبَائِرِ؟ ثَلَاثًا، قالوا: بَلَى يا رَسُولَ اللَّهِ، قالَ: الإشْرَاكُ باللَّهِ، وَعُقُوقُ الوَالِدَيْنِ - وَجَلَسَ وَكانَ مُتَّكِئًا فَقالَ - أَلَا وَقَوْلُ الزُّورِ، قالَ: فَما زَالَ يُكَرِّرُهَا حتَّى قُلْنَا: لَيْتَهُ سَكَتَ)',
  ];

  static List death = [
    'عن محمود بن لبيد الأنصاري عنِ النبي صلّى اللهُ عليهِ وسلّم قال: (اثنتانِ يكرهُهما ابنُ آدمَ: يكرَهُ الموتَ والموتُ خيرٌ له من الفتنةِ، ويكرَهُ قِلَّةَ المالِ وقِلَّةَ المالِ أقلُّ للحسابِ)',
    'عن جابِر بن عبدِ الله رضي الله عنه عن النبي صلَّى اللهُ عليه وسلّم: (لو أنَّ ابنَ آدمَ هرَبَ من رزقِهِ كما يهرَبُ من الموتِ، لأدْرَكَهُ رزْقُهُ كما يُدْرِكُهُ الموتُ)',
    'عن أنس بن مالك عن النبي عليه الصلاة والسلام: (اذكرِ الموتَ في صلاتِك ، فإنَّ الرجلَ إذا ذكر الموتَ في صلاتِه لحريٌّ أن يُحسنَ صلاتَه، وصَلِّ صلاةَ رجلٍ لا يظنُّ أن يُصلِّيَ صلاةً غيرَها، وإياك وكلُّ أمرٍ يُعتذرُ منه)',
    'عن أنس بن مالك -رضي الله عنه- قال: (خَطَّ النَّبيُّ -صلَّى اللهُ عليه وسلَّم- خُطُوطًا، فَقَالَ: هذا الأمَلُ، وهذا أجَلُهُ، فَبيْنَما هو كَذلكَ إذْ جَاءَهُ الخَطُّ الأقْرَبُ)',
    'عن عبد الله بن مسعود -رضي الله عنه- قال: (خَطَّ النبيُّ -صَلَّى اللهُ عليه وسلَّمَ- خَطًّا مُرَبَّعًا، وخَطَّ خَطًّا في الوَسَطِ خَارِجًا منه، وخَطَّ خُطَطًا صِغَارًا إلى هذا الذي في الوَسَطِ مِن جَانِبِهِ الذي في الوَسَطِ، وقَالَ: هذا الإنْسَانُ، وهذا أجَلُهُ مُحِيطٌ به أوْ: قدْ أحَاطَ به وهذا الذي هو خَارِجٌ أمَلُهُ، وهذِه الخُطَطُ الصِّغَارُ الأعْرَاضُ، فإنْ أخْطَأَهُ هذا نَهَشَهُ هذا، وإنْ أخْطَأَهُ هذا نَهَشَهُ هذا)',
    'عن أبي هريرة -رضي الله عنه- قال: قال رسول الله -صلّى الله عليه وسلّم-: (لَا يَتَمَنَّى أحَدُكُمُ المَوْتَ إمَّا مُحْسِنًا فَلَعَلَّهُ يَزْدَادُ، وإمَّا مُسِيئًا فَلَعَلَّهُ يَسْتَعْتِبُ)',
    'عن عائشة أم المؤمنين -رضي الله عنها- قالت: (إنَّ رَسولَ اللهِ -صَلَّى اللهُ عليه وسلَّمَ- كانَ بيْنَ يَدَيْهِ رَكْوَةٌ أوْ عُلْبَةٌ فِيهَا مَاءٌ، يَشُكُّ عُمَر- فَجَعَلَ يُدْخِلُ يَدَيْهِ في المَاءِ، فَيَمْسَحُ بهِما وجْهَهُ، ويقولُ: لا إلَهَ إلَّا اللهُ، إنَّ لِلْمَوْتِ سَكَرَاتٍ ثُمَّ نَصَبَ يَدَهُ فَجَعَلَ يقولُ: في الرَّفِيقِ الأعْلَى)',
    'عن معاذ بن جبل -رضي الله عنه- قال: قال رسول الله -صلّى الله عليه وسلّم-: (مَن كانَ آخرُ كلامِه لا إلَه إلَّا اللهُ، دخلَ الجنَّةَ)',
    'عن عبد الله بن عمرو بن العاص -رضي الله عنهما- قال: قال رسول الله -صلّى الله عليه وسلّم-: (ما منْ مسلمٍ يموتُ يومَ الجمعةِ، أو ليلةَ الجمعةِ، إلا وقاهُ اللهُ تعالى فتنةَ القبرِ)',
    'عن أبي هريرة -رضي الله عنه- قال: قال رسول الله -صلّى الله عليه وسلّم-: (ما تَعُدُّونَ الشَّهِيدَ فِيكُمْ؟ قالوا: يا رَسولَ اللهِ، مَن قُتِلَ في سَبيلِ اللهِ فَهو شَهِيدٌ، قالَ: إنَّ شُهَداءَ أُمَّتي إذًا لَقَلِيلٌ، قالوا: فمَن هُمْ يا رَسولَ اللهِ؟ قالَ: مَن قُتِلَ في سَبيلِ اللهِ فَهو شَهِيدٌ، ومَن ماتَ في سَبيلِ اللهِ فَهو شَهِيدٌ، ومَن ماتَ في الطَّاعُونِ فَهو شَهِيدٌ، ومَن ماتَ في البَطْنِ فَهو شَهِيدٌ، قالَ ابنُ مِقْسَمٍ: أشْهَدُ علَى أبِيكَ في هذا الحَديثِ أنَّه قالَ: والْغَرِيقُ شَهِيدٌ. وفي رواية : قالَ عُبَيْدُ اللهِ بنُ مِقْسَمٍ، أشْهَدُ علَى أخِيكَ أنَّه زادَ في هذا الحَديثِ ومَن غَرِقَ فَهو شَهِيدٌ)',
  ];
  static List helping = [
    'قال رسول الله -صلى الله عليه وسلم-: (مَن نَفَّسَ عن مُؤْمِنٍ كُرْبَةً مِن كُرَبِ الدُّنْيَا، نَفَّسَ اللَّهُ عنْه كُرْبَةً مِن كُرَبِ يَومِ القِيَامَةِ، وَمَن يَسَّرَ علَى مُعْسِرٍ، يَسَّرَ اللَّهُ عليه في الدُّنْيَا وَالآخِرَةِ، وَمَن سَتَرَ مُسْلِمًا، سَتَرَهُ اللَّهُ في الدُّنْيَا وَالآخِرَةِ، وَاللَّهُ في عَوْنِ العَبْدِ ما كانَ العَبْدُ في عَوْنِ أَخِيهِ)',
    'قال رسول الله -صلى الله عليه وسلم-: (المُسْلِمُ أخُو المُسْلِمِ، لا يَظْلِمُهُ ولا يُسْلِمُهُ، ومَن كانَ في حاجَةِ أخِيهِ كانَ اللَّهُ في حاجَتِهِ)',
    'صحَّ عن رسول الله -صلى الله عليه وسلم- أنه قال: (خَيرُكم خَيرُكم لأهلِه، وأنا خَيرُكم لأهلي)',
    'ثبت عن النبيّ -صلّى الله عليه وسلّم- أنّه قال: (المُسْلِمُ أخُو المُسْلِمِ لا يَظْلِمُهُ ولَا يُسْلِمُهُ، ومَن كانَ في حَاجَةِ أخِيهِ كانَ اللَّهُ في حَاجَتِهِ، ومَن فَرَّجَ عن مُسْلِمٍ كُرْبَةً، فَرَّجَ اللَّهُ عنْه كُرْبَةً مِن كُرُبَاتِ يَومِ القِيَامَةِ، ومَن سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَومَ القِيَامَةِ)',
    'ورد عن النبيّ -صلّى الله عليه وسلّم- أنّه قال: (الخلقُ كلُّهم عِيالُ اللهِ، فأَحَبُّ خَلْقِهِ إليه، أنفعُهم لِعِيالِه)',
  ];

  static List goodNaghour = [
    'عن أبي شريح العدوي خويلد بن عمرو -رضي الله عنه- قال: قال رسول الله -صلّى الله عليه وسلّم-: (مَن كانَ يُؤْمِنُ باللهِ والْيَومِ الآخِرِ فَلْيُحْسِنْ إلى جارِهِ، ومَن كانَ يُؤْمِنُ باللهِ والْيَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، ومَن كانَ يُؤْمِنُ باللهِ والْيَومِ الآخِرِ فَلْيَقُلْ خَيْرًا، أوْ لِيَسْكُتْ)',
    'عن أبي هريرة -رضي الله عنه- قال: قال رسول الله -صلّى الله عليه وسلّم-: (مَن كانَ يُؤْمِنُ باللهِ والْيَومِ الآخِرِ فَلْيَقُلْ خَيْرًا، أوْ لِيصْمُتْ، ومَن كانَ يُؤْمِنُ باللهِ والْيَومِ الآخِرِ فَلْيُكْرِمْ جارَهُ، ومَن كانَ يُؤْمِنُ باللهِ والْيَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ)',
    'عن عبد الله بن عمر -رضي الله عنهما- قال: قال رسول الله -صلّى الله عليه وسلّم-: (ما زالَ جِبْرِيلُ يُوصِينِي بالجارِ، حتَّى ظَنَنْتُ أنَّه سَيُوَرِّثُهُ)',
    'عن عبد الله بن عمرو بن العاص -رضي الله عنهما- قال: قال رسول الله صلّى الله عليه وسلّم: (خيرُ الأصحابِ عندَ اللهِ خيرُهم لصاحبِه، وخيرُ الجيرانِ عندَ اللهِ خيرُهم لجارِهِ)',
    'عن عائشة أم المؤمنين -رضي الله عنها- قالت: (قُلتُ يا رَسولَ اللهِ، إنَّ لي جَارَيْنِ فَإِلَى أيِّهِما أُهْدِي؟ قَالَ: إلى أقْرَبِهِما مِنْكِ بَابًا)',
    'عن أبي هريرة -رضي الله عنه- قال: قال رسول الله -صلّى الله عليه وسلّم-: (يا نِساءَ المُسْلِماتِ، لا تَحْقِرَنَّ جارَةٌ لِجارَتِها ولو فِرْسِنَ شاةٍ)',
    'عن أبي ذر الغفاري -رضي الله عنه- قال: (إنَّ خَلِيلِي -صَلَّى اللهُ عليه وَسَلَّمَ- أَوْصَانِي: إذَا طَبَخْتَ مَرَقًا فأكْثِرْ مَاءَهُ، ثُمَّ انْظُرْ أَهْلَ بَيْتٍ مِن جِيرَانِكَ، فأصِبْهُمْ منها بمَعروفٍ)',
    'عن أبي هريرة -رضي الله عنه-: (أنَّ رَسولَ اللهِ -صَلَّى اللهُ عليه وسلَّمَ- قالَ: لا يَمْنَعْ جَارٌ جَارَهُ أنْ يَغْرِزَ خَشَبَهُ في جِدَارِهِ، ثُمَّ يقولُ أبو هُرَيْرَةَ: ما لي أرَاكُمْ عَنْهَا مُعْرِضِينَ، واللهِ لَأَرْمِيَنَّ بهَا بيْنَ أكْتَافِكُمْ)',
    'عن أبي هريرة -رضي الله عنه- قال: قال رسول الله صلّى الله عليه وسلّم: (مَن كانَ يُؤْمِنُ باللهِ واليَومِ الآخِرِ فلا يُؤْذِي جارَهُ، واسْتَوْصُوا بالنِّساءِ خَيْرًا؛ فإنَّهُنَّ خُلِقْنَ مِن ضِلَعٍ، وإنَّ أعْوَجَ شَيءٍ في الضِّلَعِ أعْلاهُ، فإنْ ذَهَبْتَ تُقِيمُهُ كَسَرْتَهُ، وإنْ تَرَكْتَهُ لَمْ يَزَلْ أعْوَجَ، فاسْتَوْصُوا بالنِّساءِ خَيْرًا)',
    'عن أنس بن مالك -رضي الله عنه- قال: قال رسول الله -صلّى الله عليه وسلّم-: (المؤمنُ مَنْ أَمِنَهُ الناسُ، والمسلمُ مَنْ سَلِمَ المسلمُونَ من لسانِهِ ويَدِه، والمُهاجِرُ مَنْ هجرَ السُّوءَ، والذي نَفسي بيدِهِ لا يدخلُ الجنةَ عَبْدٌ لا يَأْمَنُ جارُهُ بَوَائِقَهُ)',
    'عن أبي هريرة -رضي الله عنه- قال: (قال رجلٌ: يا رَسولَ اللهِ، إنَّ فُلانةَ يُذكَرُ مِن كَثرةِ صَلاتِها وصَدقَتِها وصيامِها، غيرَ أنَّها تُؤذي جيرانَها بِلِسانِها؟ قال: هيَ في النَّارِ، قال: يا رَسولَ اللهِ، فإنَّ فُلانةَ يُذكَرُ مِن قِلَّةِ صيامِها وصَدقَتِها وصَلاتِها، وإنَّها تَتَصدَّقُ بالأَثوارِ مِن الأَقِطِ، وَلا تُؤذي جيرانَها بِلسانِها؟ قال: هيَ في الجنَّةِ)',
  ];

  static List marriage = [
    'قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: ( مَن استطاع منكم الباءةَ فلْيتزوَّجْ فإنَّه أغضُّ للبصرِ وأحصَنُ للفَرْجِ ومَن لم يستطِعْ منكم الباءةَ فلْيصُمْ فإنَّه له وجاءٌ)',
    'قال الرسول عليه السلام: (حَقٌّ علَى اللهِ عونُ مَنْ نَكحَ التِماسَ العَفافِ عمَّا حرَّمَ اللهُ)',
    'قال صلى الله عليه وسلم: (إذا أتاكم من تَرضَون دِينَه وخُلُقَه فأنكِحوه إن لا تفعلُوه تكن فتنةٌ في الأرضِ وفسادٌ كبيرٌ . قالوا : يا رسولَ اللهِ وإن كان فيه ؟ قال : إذا جاءكُم مَن تَرضَون دينَه وخُلُقَه فأنكِحوهُ)',
    'قال صلى الله عليه وسلم: (النكاحُ سُنَّتِي , فمن أحبَّ فِطْرَتِي فليستَنَّ بسُنَّتِي)',
    'قال صلى الله عليه وسلم: (لم يُرَ لِلْمُتَحابَّيْنِ مثلُ النكاحِ)',
    'قال الرسول عليه السلام: (تُنكَحُ المرأةُ على مالِها وتُنكَحُ المرأةُ على جمالِها وتُنكَحُ المرأةُ على دِينِها خُذْ ذاتَ الدِّينِ والخُلقِ ترِبَت يمينُك)',
    'قال صلى الله عليه وسلم: (تخيَّروا لنطفِكم وانْكحوا الأَكْفاءَ وأنْكحوا إليْهم)',
    'قال صلى الله عليه وسلم: (كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم يأْمُرُ بالباءَةِ ويَنْهَى عنِ التَّبَتُّلِ نَهْيًا شديدًا ويقولُ تَزَوَّجُوا الودودَ الولودَ فَإِنِّي مكاثِرٌ بِكُمُ الأنبياءَ يومَ القيامَةِ)',
    'قال صلى الله عليه وسلم: (تزوجوا فإِنَّي مُكاثِرٌ بكم الأُمَمَ ، ولَا تكونوا كرهبانِيَّةِ النصارى)',
    'قال الرسول عليه السلام: (لا نكاح إلا بوليٍّ وشاهدَي عدلٍ ، وما كان من نكاحٍ على غيِر ذلك فهو باطلٌ ، وإن تشاجَروا فالسلطانُ وليُّ من لا وليَّ له)',
  ];

  static List selaRahem = [
    'قال رسول الله صلى الله عليه وسلم: (إنَّ اللَّهَ خَلَقَ الخَلْقَ، حتَّى إذا فَرَغَ مِن خَلْقِهِ، قالتِ الرَّحِمُ: هذا مَقامُ العائِذِ بكَ مِنَ القَطِيعَةِ، قالَ: نَعَمْ، أما تَرْضَيْنَ أنْ أصِلَ مَن وصَلَكِ، وأَقْطَعَ مَن قَطَعَكِ؟ قالَتْ: بَلَى يا رَبِّ، قالَ: فَهو لَكِ قالَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: فاقْرَؤُوا إنْ شِئْتُمْ: "فَهلْ عَسَيْتُمْ إنْ تَوَلَّيْتُمْ أنْ تُفْسِدُوا في الأرْضِ وتُقَطِّعُوا أرْحامَكُمْ")',
    'قال رسول الله -صلى الله عليه وسلم-: (قالَ اللَّهُ: أَنا الرَّحمنُ وَهيَ الرَّحمُ، شَقَقتُ لَها اسمًا منَ اسمي، من وصلَها وصلتُهُ، ومن قطعَها بتتُّهُ)',
    'قال رسول الله -صلى الله عليه وسلم-: (الرَّحِمُ مُعَلَّقَةٌ بالعَرْشِ تَقُولُ مَن وصَلَنِي وصَلَهُ اللَّهُ، ومَن قَطَعَنِي قَطَعَهُ اللَّهُ)',
    'قال رسول الله -صلى الله عليه وسلم- : (إِنَّ اللَّهَ يوصِيكم بِأُمَّهَاتِكُمْ ثُمَّ يوصِيكم بِأُمَّهَاتِكُمْ ثُمَّ يوصِيكم بِآبَائِكُمْ ثُمَّ يوصِيكم بِالْأَقْرَبِ فَالْأَقْرَبِ)',
    'قال رسول الله -صلى الله عليه وسلم- : (مَنْ أَحَبَّ أَنْ يَصِلَ أَبَاهُ فِي قَبْرِهِ فَلْيَصِلْ إِخْوَانَ أَبِيهِ بَعْدَهُ)',
    'قال رسول الله -صلى الله عليه وسلم- : (مَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، ومَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيَصِلْ رَحِمَهُ، ومَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيَقُلْ خَيْرًا أوْ لِيَصْمُتْ)',
    'قال رسول الله -صلى الله عليه وسلم-: (يا أيُّها النَّاسُ أفشوا السَّلامَ، وأطعِموا الطَّعامَ، وصِلوا الأرحامَ، وصلُّوا باللَّيلِ، والنَّاسُ نيامٌ، تدخلوا الجنَّةَ بسَلامٍ)',
    'قال رسول الله -صلى الله عليه وسلم- : (مَن سَرَّهُ أنْ يُبْسَطَ له في رِزْقِهِ، وأَنْ يُنْسَأَ له في أثَرِهِ، فَلْيَصِلْ رَحِمَهُ)',
    'قال رسول الله -صلى الله عليه وسلم- : (ليسَ الواصِلُ بالمُكافِئِ، ولَكِنِ الواصِلُ الذي إذا قُطِعَتْ رَحِمُهُ وصَلَها)',
    'قال رسول الله -صلى الله عليه وسلم-: (إنَّ الصَّدقةَ على المسْكينِ صدقةٌ وعلى ذي الرَّحمِ اثنتانِ صدَقةٌ وصِلةٌ)',
    'قال رسول الله- صلى الله عليه وسلم- : (من اتقى ربه ووصل رحمه نُسِىءَ في أجله وَثَرى ماله وأَحَبَّه أهلُهُ)',
    'قال رسول الله- صلى الله عليه وسلم-: (إِنَّ الصَّدَقَةَ وَصِلَةَ الرَّحِمِ يَزِيدُ اللَّهُ بِهِمَا فِي الْعُمْرِ وَيَدْفَعُ بِهِمَا مَيْتَةَ السُّوءِ)',
    'قال رسول الله -صلى الله عليه وسلم-: (إِنَّ أعمالَ بني آدمَ تُعْرَضُ علَى اللهِ تعالى عَشِيَّةَ كُلِّ خميسٍ ليْلَةَ الجمعَةِ، فلا يُقْبَلُ عملُ قاطِعِ رحِمِ)',
    'قال رسول الله -صلى الله عليه وسلم-: (ما مِن ذنبٍ أجدرُ أن يُعجِّلَ اللهُ لصاحبِه العقوبةَ في الدُّنيا مع ما يَدَّخرُ لهُ في الآخرةِ من البَغي وقطيعةِ الرَّحمِ)',
    'قال رسول الله -صلى الله عليه وسلم- :( لَا تنزلُ الرَّحْمَةَ عَلَى قومٍ فِيهِمْ قَاطِعُ رحِم)',
  ];

  static List cleaning = [
    'عن أبي هريرة -رضي الله عنه- قال: قال رسول الله صلى الله عليه وسلم: (الإِيمانُ بضْعٌ وسَبْعُونَ، أوْ بضْعٌ وسِتُّونَ، شُعْبَةً، فأفْضَلُها قَوْلُ لا إلَهَ إلَّا اللَّهُ، وأَدْناها إماطَةُ الأذَى عَنِ الطَّرِيقِ، والْحَياءُ شُعْبَةٌ مِنَ الإيمانِ)',
    'عن أبي ذر ـرضي الله عنه- عن النبي -صلى الله عليه وسلم- قال : (عُرِضَتْ عَلَيَّ أعْمالُ أُمَّتي حَسَنُها وسَيِّئُها، فَوَجَدْتُ في مَحاسِنِ أعْمالِها الأذَى يُماطُ عَنِ الطَّرِيقِ، ووَجَدْتُ في مَساوِي أعْمالِها النُّخاعَةَ تَكُونُ في المَسْجِدِ، لا تُدْفَنُ)',
    'عن أبي هريرة -رضي الله عنه-، أن رسول الله صلى الله عليه وسلم قال: (اتَّقُوا اللَّعَّانَيْنِ، قالوا: وَما اللَّعَّانَانِ يا رَسُولَ اللهِ؟ قالَ: الذي يَتَخَلَّى في طَرِيقِ النَّاسِ، أَوْ في ظِلِّهِمْ)',
    'عن معاذ بن جبل -رضي الله عنه-، قال: قال رسول الله -صلى الله عليه وسلم-: (اتَّقوا الملاعنَ الثَّلاثَ: البَرازَ في المواردِ وقارعةِ الطَّريقِ والظِّلِّ)',
    'عن أبي هريرة -رضي الله عنه- عن النبي -صلى الله عليه وسلم- قال: (لا يَبُولَنَّ أحَدُكُمْ في المَاءِ الدَّائِمِ الذي لا يَجْرِي، ثُمَّ يَغْتَسِلُ فِيهِ)',
    'عن سعد بن أبي وقاص -رضي الله عنه-، أن رسول الله -صلى الله عليه وسلم- قال: (إنَّ اللهَ تعالى طيبٌ يُحِبُّ الطيبَ، نظيفٌ يُحِبُّ النظافةَ، كريمٌ يُحِبُّ الكرَمَ، جوَادٌ يُحِبُّ الجودَ، فنظِّفوا أفنيتَكم، ولا تشبَّهوا باليهودِ)',
    'عن سعد بن أبي وقاص -رضي الله عنه- قال: قال رسول الله -صلى الله عليه وسلم-: (طَهِّرُوا أفْنِيَتَكُمْ، فإِنَّ اليهودَ لا تُطَهِّرُ أفنِيَتَها)',
    'عن أبي هريرة -رضي الله عنه- أن رسول الله -صلى الله عليه وسلم- قال: (لَوْلَا أنْ أشُقَّ علَى أُمَّتي أوْ علَى النَّاسِ لَأَمَرْتُهُمْ بالسِّوَاكِ مع كُلِّ صَلَاةٍ)',
    'عن جابر بن عبد الله -رضي الله عنهما- أن النبي -صلى الله عليه وسلم- قال:(مَن أكَلَ ثُومًا أوْ بَصَلًا، فَلْيَعْتَزِلْنَا -أوْ قالَ: فَلْيَعْتَزِلْ مَسْجِدَنَا- ولْيَقْعُدْ في بَيْتِهِ)',
    'عن عائشة -رضي الله عنها- قالت: (كانَ النبيَّ -صَلَّى اللَّهُ عليه وسلَّمَ- إذا دَخَلَ بَيْتَهُ بَدَأَ بالسِّواكِ)',
    'عن أبي هريرة -رضي الله عنه-، قال: قال رسول الله صلى الله عليه وسلم: (حَقٌّ علَى كُلِّ مُسْلِمٍ، أنْ يَغْتَسِلَ في كُلِّ سَبْعَةِ أيَّامٍ يَوْمًا يَغْسِلُ فيه رَأْسَهُ وجَسَدَهُ)',
    'عن عائشة -رضي الله عنها- قالت: قال رسول الله -صلى الله عليه وسلم-: (عَشْرٌ مِنَ الفِطْرَةِ: قَصُّ الشَّارِبِ، وإعْفاءُ اللِّحْيَةِ، والسِّواكُ، واسْتِنْشاقُ الماءِ، وقَصُّ الأظْفارِ، وغَسْلُ البَراجِمِ، ونَتْفُ الإبِطِ، وحَلْقُ العانَةِ، وانْتِقاصُ الماءِ. قالَ زَكَرِيّا: قالَ مُصْعَبٌ: ونَسِيتُ العاشِرَةَ إلَّا أنْ تَكُونَ المَضْمَضَةَ. زادَ قُتَيْبَةُ، قالَ وكِيعٌ: انْتِقاصُ الماءِ: يَعْنِي الاسْتِنْجاءَ)',
    'عن أنس بن مالك -رضي الله عنه- قال: (وُقِّتَ لنا في قَصِّ الشَّارِبِ، وتَقْلِيمِ الأظْفارِ، ونَتْفِ الإبِطِ، وحَلْقِ العانَةِ، أنْ لا نَتْرُكَ أكْثَرَ مِن أرْبَعِينَ لَيْلَةً)',
    'عن أبي هريرة -رضي الله عنه-، عن النبي -صلى الله عليه وسلم- قال: (إِذَا تَوَضَّأَ أحَدُكُمْ فَلْيَجْعَلْ في أنْفِهِ، ثُمَّ لِيَنْثُرْ، ومَنِ اسْتَجْمَرَ فَلْيُوتِرْ، وإذَا اسْتَيْقَظَ أحَدُكُمْ مِن نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أنْ يُدْخِلَهَا في وَضُوئِهِ؛ فإنَّ أحَدَكُمْ لا يَدْرِي أيْنَ بَاتَتْ يَدُهُ)',
    'عن جابر بن عبدالله -رضي الله عنه-، قال: أتانا رسول الله -صلى الله عليه وسلم- فرأى رجلًا شعثًا قد تفرق شعره، فقال: (أما كان يجدُ هذا ما يُسكنُ به شعرَه؟ ورأى رجلًا آخرَ وعليه ثيابٌ وَسِخةٌ فقال: أما كان هذا يجدُ ماءً يغسلُ به ثوبَه)',
  ];

  static List fadlZikr = [
    'قال رسول الله صلى الله عليه وسلم: (كَلِمَتانِ خَفِيفَتانِ علَى اللِّسانِ، ثَقِيلَتانِ في المِيزانِ، حَبِيبَتانِ إلى الرَّحْمَنِ، سُبْحانَ اللَّهِ وبِحَمْدِهِ، سُبْحانَ اللَّهِ العَظِيمِ)',
    'قال رسول الله صلى الله عليه وسلم: (أَلَا أُخْبِرُكَ بأَحَبِّ الكَلَامِ إلى اللهِ؟ قُلتُ: يا رَسُولَ اللهِ، أَخْبِرْنِي بأَحَبِّ الكَلَامِ إلى اللهِ، فَقالَ: إنَّ أَحَبَّ الكَلَامِ إلى اللهِ: سُبْحَانَ اللهِ وَبِحَمْدِهِ)',
    'قال رسول الله صلى الله عليه وسلم: (لأَنْ أَقُولَ سُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ، أَحَبُّ إِلَيَّ ممَّا طَلَعَتْ عليه الشَّمْسُ)',
    'قال رسول الله صلى الله عليه وسلم: (مَن سَبَّحَ اللَّهَ في دُبُرِ كُلِّ صَلاةٍ ثَلاثًا وثَلاثِينَ، وحَمِدَ اللَّهَ ثَلاثًا وثَلاثِينَ، وكَبَّرَ اللَّهَ ثَلاثًا وثَلاثِينَ، فَتْلِكَ تِسْعَةٌ وتِسْعُونَ، وقالَ: تَمامَ المِئَةِ: لا إلَهَ إلَّا اللَّهُ وحْدَهُ لا شَرِيكَ له، له المُلْكُ وله الحَمْدُ وهو علَى كُلِّ شيءٍ قَدِيرٌ غُفِرَتْ خَطاياهُ وإنْ كانَتْ مِثْلَ زَبَدِ البَحْرِ)',
    'قال رسول الله صلى الله عليه وسلم: (مَنْ قال لا إلهَ إلَّا اللهُ وحدَهُ لَا شرِيكَ لَهُ، لَهُ الملْكُ، ولَهُ الحمْدُ، وهُوَ عَلَى كُلِّ شيءٍ قديرٌ، فِي يومٍ مائَةَ مرةٍ، كانتْ لَهُ عِدْلَ عشرِ رقابٍ، وكُتِبَتْ لَهُ مائَةُ حسنَةٍ، ومُحِيَتْ عنه مائَةُ سيِّئَةٍ، وكانَتْ لَهُ حِرْزًا منَ الشيطانِ يَوْمَهُ ذَلِكَ حتى يُمْسِيَ، ولم يأتِ أحدٌ بأفضلَ مِمَّا جاءَ بِهِ، إلَّا أحدٌ عَمِلَ عملًا أكثرَ مِنْ ذلِكَ)',
  ];

  static List fadlSadqa = [
    'قال رسول الله -صلى الله عليه وسلم- في حديث السبعة الذين يظلهم الله في ظله في الآخرة: (ورَجُلٌ تَصَدَّقَ بصَدَقَةٍ فأخْفاها حتَّى لا تَعْلَمَ يَمِينُهُ ما تُنْفِقُ شِمالُهُ)',
    'قال رسول الله صلى الله عليه وسلم: (ما مِن يَومٍ يُصْبِحُ العِبادُ فِيهِ، إلَّا مَلَكانِ يَنْزِلانِ، فيَقولُ أحَدُهُما: اللَّهُمَّ أعْطِ مُنْفِقًا خَلَفًا، ويقولُ الآخَرُ: اللَّهُمَّ أعْطِ مُمْسِكًا تَلَفًا)',
    'قال رسول الله صلى الله عليه وسلم: (إنَّما الدُّنيا لأربعةِ نفرٍ عبدٍ رزقَهُ اللَّهُ مالًا وعلمًا فَهوَ يتَّقي ربَّهُ فيهِ ويصلُ فيهِ رحمَهُ ويعلمُ للَّهِ فيهِ حقًّا فَهذا بأفضلِ المنازلِ)',
    'قال رسول الله صلى الله عليه وسلم: (إنْ أردتَ أنْ يَلينَ قلبُكَ، فأطعِمْ المسكينَ، وامسحْ رأسَ اليتيمِ)',
    'قال رسول الله صلى الله عليه وسلم: (الرَّجلُ في ظلِّ صدقتِه حتَّى يُقضَى بين النَّاسِ)',
    'قال رسول الله صلى الله عليه وسلم: (والصدقة تطفيء الخطيئة، كما يطفئ الماء النار)',
    'قال رسول الله صلى الله عليه وسلم: (ما نقصت صدقة من مال)',
    'قال رسول الله صلى الله عليه وسلم: (دَاوُوا مَرضاكُمْ بِالصَّدقةِ)',
  ];

  static List<AlHadethModel> hadethItem = [
    AlHadethModel(title: 'أجمل أحاديث الرسول عن الدنيا', hadethItems: donya),
    AlHadethModel(title: 'أجمل أحاديث الرسول عن الحب', hadethItems: love),
    AlHadethModel(
        title: 'أجمل أحاديث الرسول عن الأخلاق وحسن الخلق', hadethItems: ethics),
    AlHadethModel(title: 'أجمل أحاديث الرسول عن الصبر', hadethItems: patience),
    AlHadethModel(
        title: 'أجمل أحاديث الرسول عن نعيم الجنة', hadethItems: janna),
    AlHadethModel(title: 'أحاديث قدسية', hadethItems: qudsi),
    AlHadethModel(title: 'أحاديث عن بر الوالدين', hadethItems: parentes),
    AlHadethModel(title: 'أحاديث عن طلب العلم', hadethItems: askLearn),
    AlHadethModel(title: 'أحاديث عن الأم', hadethItems: mother),
    AlHadethModel(title: 'أحاديث عن الموت', hadethItems: death),
    AlHadethModel(title: 'أحاديث عن تقديم يد العون', hadethItems: helping),
    AlHadethModel(title: 'أحاديث عن الجار', hadethItems: goodNaghour),
    AlHadethModel(title: 'أحاديث عن الزواج', hadethItems: marriage),
    AlHadethModel(title: 'أحاديث عن صلة الرحم', hadethItems: selaRahem),
    AlHadethModel(title: 'أحاديث عن النظافة', hadethItems: cleaning),
    AlHadethModel(title: 'أحاديث عن فضل الذكر', hadethItems: fadlZikr),
    AlHadethModel(title: 'أحاديث عن فضل الصدقة', hadethItems: fadlSadqa),
  ];
}
