class PrayOfMohammed {
  static List<String> prayOfMohammed = [
    'اللهم صل وسلم على سيدنا محمد صلاة تحل بها عقدتي، وتفرج بها كربتي، وتمحو بها خطيئتي، وتقضي بها حاجتي',
    'للَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَنْزِلْهُ الْمَنْزِلَ الْمُقَرَّبَ مِنْكَ يَوْمَ الْقِيَامَة',
    'للهم صلّ صلاة كاملة وسلّم سلاماً تاماً على سيدنا محمد النبي الأميّ الذي تنحل به العقد، وتنفرج به الكرب، وتُقضى به الحوائج، وتنال به الرغائب وحسن الخواتم، ويستسقى الغمام، وعلى آله وصحبه عدد كل معلوم لله',
    'للهم صل وسلم على سيدنا محمد وعلى آله، صلاة تكون لنا طريقاً لقربه، وتأكيداً لحبه، وباباً لجمعنا عليه، وهدية مقبولة بين يديه، وسلم وبارك كذلك أبداً، وارض عن آله وصحبه السعداء، واكسنا حُلل الرضا',
    'اللهم صل وسلم على سيدنا محمد صلاة تهب لنا بها أكمل المراد وفوق المراد، في دار الدنيا ودار المعاد، وعلى آله وصحبه وبارك وسلم عدد ما علمت وزنة ماعلمت وملء ما علمت',
    'للهم صل على سيدنا محمد صلاة تنجينا بها من جميع الأهوال والآفات، وتقضي بها جميع الحاجات، وتطهرنا بها من جميع السيئات، وترفعنا بها عندك أعلى الدرجات، وتبلغنا بها أقصى الغايات من جميع الخيرات في الحياة وبعد الممات، وعلى آله وصحبه وسلم تسليماً كثيراً',
    'اللهم صل على محمد عدد الرمل والحصى، في مستقر الأرضين شرقها وغربها وسهلها وجبالها، من يوم خلقت الدنيا إلى يوم القيامة، في كل يوم ألف مرة',
    'اللهم صلّ على محمد وعلى آل محمد، كما صليت على إبراهيم وعلى آل إبراهيم، وبارك على محمد وعلى آل محمد، كما باركت على إبراهيم وعلى آل إبراهيم، إنك حميد مجيد',
    'اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّد في الأَوَّلِينَ وَالآخِرِينَ، وَفِي الْمَلأِ الأَعْلَى إِلَى يَوْمِ الْدِّينِ',
    ' اللهم صل وسلم وبارك على سيدنا محمد وعلى آله وصحبه عدد ما في علم الله، صلاةً دائمة بدوام ملك الله',
    'اللهم صل وسلم وبارك على سيدنا محمد وعلى آله وصحبه عدد كمال الله وكما يليق بكماله',
    'اللهم صل وسلم وبارك على سيدنا محمد وعلى آله عدد حروف القرآن حرفاً حرفاً، وعدد كل حرف ألفاً ألفاً، وعدد صفوف الملائكة صفاً صفاً، وعدد كل صف ألفاً ألفاً، وعدد الرمال ذرة ذرة، وعدد ما أحاط به علمك، وجرى به قلمك، ونفذ به حكمك في برك وبحرك، وسائر خلقك',
    'اللهم صَلِ عَلَى سَيِّدِنَا مُحَمَّدٍ أَصْلِ الأُصُول، نُورِ الْجَمَالِ، وَسِرِّ الْقَبُول، أَصْلِ الْكَمَالِ، وَبَابِ الْوُصُول، صلاةً تَدُومُ وَلا تَزُول، اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمِّدٍ أَكْرَمِ نَبِيٍّ، وَأَعْظَمِ رَسُول مَنْ جَاهُهُ مَقْبُول، وَمُحِبُّهُ مَوْصُول، الْمُكَرَّمُ بِالصِّدْقِ فِي الْخُرُوجِ وَالدُّخُول، صلاةً تَشْفِي مِنَ الأَسْقَامِ وَالنُّحُول وَالأَمْرَاضِ وَالذُّبُول، وَنَنْجُو بِهَا يَوْمَ الْكَرْبِ الْعَظِيمِ مِنَ الذُّهُول، صلاةً تَشْمَلُ آلَ بَيْتِ الرَّسُول وَالأَزْوَاجَ وَالأَصْحَابَ، وَتَعُمُّ الْجَمِيعَ بِالْقَبُول، الشَّبَابَ فِيهِمْ وَالْكُهُول، وَسَلِّمْ عَلَيْهِ وَعَلَى آلِهِ وَأَصْحَابِه أجمعين، آمِين',
    'اللهم صلِّ وسلم على صاحب الخُلق العظيم والقدر الفخيم مَن أرسلته رحمة للعالمين سيدنا محمد وعلى آله وصحبه، وألحقنا بخُلقه وأدّبنا بأدبه، وأحيي فينا وفي أُمته هذه المعاني يا كريم',
    'اللهم صل على سيدنا محمد النبي الأمي الحبيب العالي القدر العظيم الجاه، واغنني بفضلك عمن سواك، وعلى آله و صحبه وسلم، اللهم أعني على ذكرك وشكرك و حسن عبادتك، والطف بي فيما جرت به المقادير، و اغفر لي و لجميع المسلمين، وارحمني و إياهم برحمتك الواسعة في الدنيا والآخرة يا كريم يا رحيم',
    'الصلاة والسلام عليك يا حبيبي يا رسول الله، أنت المقدم في كل مقام، الصلاة والسلام عليك يا خيرة الله من خلقه أجمعين، الصلاة والسلام عليك وعلى آلك وأصحابك وأزواجك أجمعين، رب اغفر لي ولوالدي وارحمهما كما ربياني صغيراً',
    'اللَّهمَّ صلِّ على محمَّدٍ وعلى آلِ محمَّدٍ كما صلَّيتَ علَى إبراهيمَ وعلَى آلِ إبراهيمَ، وبارِكْ على محمَّدٍ وعلى آلِ محمَّدٍ كما بارَكْتَ على إبراهيمَ وعلى آلِ إبراهيمَ في العالَمينَ إنَّكَ حميدٌ مجيدٌ',
    'اللَّهُمَّ صَلِّ علَى مُحَمَّدٍ وعلَى آلِ مُحَمَّدٍ، كما صَلَّيْتَ علَى إبْرَاهِيمَ، وعلَى آلِ إبْرَاهِيمَ، إنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ علَى مُحَمَّدٍ وعلَى آلِ مُحَمَّدٍ، كما بَارَكْتَ علَى إبْرَاهِيمَ، وعلَى آلِ إبْرَاهِيمَ إنَّكَ حَمِيدٌ مَجِيدٌ',
    'اللَّهُمَّ صَلِّ علَى مُحَمَّدٍ، وعلَى آلِ مُحَمَّدٍ، كما صَلَّيْتَ علَى آلِ إبْرَاهِيمَ، إنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ علَى مُحَمَّدٍ وعلَى آلِ مُحَمَّدٍ، كما بَارَكْتَ علَى آلِ إبْرَاهِيمَ، إنَّكَ حَمِيدٌ مَجِيدٌ',
  ];
}
