import '../model/app/selat_rahem.dart';

class DataOfSelatRahem {
  static List<SelatRahemModel> selatRahemData = [
    SelatRahemModel(name: 'فضل صلة الرحم', listData: fadelSelatRahem),
    SelatRahemModel(name: 'عقوبة قطع الرحم', listData: okobaSelatRahem),
    SelatRahemModel(name: 'فوائد صلة الأرحام', listData: foauedSelatRahem),
    SelatRahemModel(name: 'أحاديث صلة الرحم', listData: hadethSelatRahem),
    SelatRahemModel(
        name: ' أحاديث تحث على صلة الرحم ', listData: hadethTahthSelatRahem),
    SelatRahemModel(
        name: ' أحاديث عن عاقبة قطيعة الرحم', listData: hadethOkabaSelatRahem),
    SelatRahemModel(
        name: ' آيات قرآنية عن صلة الرحم', listData: quranSelatRahem),
    SelatRahemModel(
        name: 'الفوائد المجتمعية لصلة الرحم', listData: mogtamaaSelatRahem),
    SelatRahemModel(name: 'بعض طرق صلة الرحم', listData: waySelatRahem),
  ];
  static List fadelSelatRahem = [
    'تحقيق الصلة مع الله- تعالى- في الدنيا والآخرة؛ فالرّحم معلّقة بالعرش، بدليل ما روى عن أبي هريرة -رضي الله عنه- عن النبيّ - صلى الله عليه وسلم- قال: «إن الله خلق الخلق، حتى إذا فَرَغ من خلقه قالت الرحم: هذا مقام العائذ بك من القطيعة؛ قال: نعم، أما ترضين أن أصل من وصلك وأقطع من قطعك؟ قالت: بلى يا رب؛ قال: فهو لك؛ قال رسول الله - صلى الله عليه وسلم-: اقرأوا إن شئتم: «فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم»، رواه البخارى.',
    'تحقيق محبة الله تعالى ومحبة الناس.',
    'بسط في الرزق وزيادة البركة في العمر وتعمير البيت.',
    'إكرام الفرد بالميتة الحسنة وإبعاد الميتة السيّئة عنه.',
    'دخول الجنة مع أول الداخلين.',
    'كثرة النعم ودفع النقم عن الإنسان.',
    'تقوّي مشاعر الأخوّة والودّ والمحبّة والتكاتف.',
    'بناء المجتمعات المتكاتفة والمتماسكة.',
  ];
  static List okobaSelatRahem = [
    'عدم قبول الله تعالى عمل الفرد؛ حيث إنّ الله تعالى لا يرفع له عمله.',
    'إغلاق أبواب السماء أمام قاطع الرحم.',
    'عدم نزول الرحمة على قومٍ فيهم قاطعٌ للرحم.',
    'تعجيل العقوبة لقاطع الرحم في الدّنيا قبل الآخرة.',
  ];
  static List foauedSelatRahem = [
    'غفران الذنوب والمعاصي صلة الرحم سبب لمغفرة الذنوب وتهوين الحساب على المسلم، فقد ورد في الحديث: «أنَّ رجلًا أتَى النَّبيَّ صلَّى اللَّهُ علَيهِ وسلَّمَ فقالَ: يا رسولَ اللَّهِ، إنِّي أصَبتُ ذنبًا عظيمًا فَهَل لي مِن تَوبةٍ؟ قالَ هل لَكَ مِن أمٍّ؟ قالَ: لا، قالَ: هل لَكَ من خالةٍ؟ قالَ: نعَم، قالَ: فبِرَّها».',
    'تحصيل البركة صلة الرحم تقترن البركة في عمر الإنسان، وتكون البركة بتوفيق المسلم لعمل الخير في الحياة الدنيا، فتكون حياته مليئة بالإنجازات على الرغم من قصر عمره، ويبقى أثر صلة الأرحام بعد الموت، ويكون بالذكر الطيب، والذرية الصالحة التي تدعوا لواصل رحمه بعد موته، والصدقة الجارية، والعلم النافع، عن النبي- صلى الله عليه وسلم- قال: «مَن سَرَّهُ أنْ يُبْسَطَ له في رِزْقِهِ، أوْ يُنْسَأَ له في أثَرِهِ، فَلْيَصِلْ رَحِمَهُ».',
    'الوقاية من ميتة السوء صلة الرحم تقي الإنسان من ميتة السوء، وتحميه من المكروه، فعن النبي -صلى الله عليه وسلم- قال: «مَن سرَّه أنْ يُمَدَّ له في عُمُرِه، ويُوَسَّعَ له في رِزقِه، ويُدفَعَ عنه مِيتةُ السُّوءِ، فلْيَتَّقِ اللهَ ولْيَصِلْ رَحِمَه».',
    'الفوز برضوان الله تعالى صلة الرحم سبب لرضا الله عن العيد ولدخول الجنة يوم القيامة، فعن أبي أيوب -رضي الله عنه- أن أعرابياً عرض لرسول الله -صلى الله عليه وسلم- وهو في أحد أسفاره، فسأله عن عملٍ يُقربه من الجنة، ويُباعده عن النار، فقال النبي -صلى الله عليه وسلم-: «تعبدُ اللهَ ولا تشركُ به شيئًا، وتقيمُ الصلاةَ، وتُؤتي الزكاةَ، وتَصِلُ الرَّحمَ».',
    'دليل على الإيمان تعتبر صلة الرحم من أهم الدلائل على إيمان الإنسان بالله تعالى واليوم الآخر، فعن النبي -صلى الله عليه وسلم- قال: «مَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيَصِلْ رَحِمَهُ».',
    'جلب صلة الله ومعونته صلة الرحم من الأمور التي تترتّب عليها صلة الله ومعونته لعبده المسلم، فقد رُوي عن النبي -صلى الله عليه وسلم- أنّه قال: «إنَّ اللَّهَ خَلَقَ الخَلْقَ، حتَّى إذا فَرَغَ مِن خَلْقِهِ، قالتِ الرَّحِمُ: هذا مَقامُ العائِذِ بكَ مِنَ القَطِيعَةِ، قالَ: نَعَمْ، أما تَرْضَيْنَ أنْ أصِلَ مَن وصَلَكِ، وأَقْطَعَ مَن قَطَعَكِ؟ قالَتْ: بَلَى يا رَبِّ، قالَ: فَهو لَكِ، قالَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: فاقْرَؤُوا إنْ شِئْتُمْ: «فَهلْ عَسَيْتُمْ إنْ تَوَلَّيْتُمْ أنْ تُفْسِدُوا في الأرْضِ وتُقَطِّعُوا أرْحامَكُمْ».',
    'دليل طاعة الله تُعد صلة الرحم من أنواع الطاعات التي أمر الله -تعالى- بها، وقد أثنى الله تعالى في كتابه العزيز على الواصلين لأرحامهم، قال الله تعالى: «وَالَّذينَ يَصِلونَ ما أَمَرَ اللَّـهُ بِهِ أَن يوصَلَ وَيَخشَونَ رَبَّهُم وَيَخافونَ سوءَ الحِسابِ» ثم قال -تعالى- على ذلك: «أُولـئِكَ لَهُم عُقبَى الدّارِ جَنّاتُ عَدنٍ يَدخُلونَها».',
  ];
  static List hadethSelatRahem = [
    'قال رسول الله صلى الله عليه وسلم: «إنَّ اللَّهَ خَلَقَ الخَلْقَ، حتَّى إذا فَرَغَ مِن خَلْقِهِ، قالتِ الرَّحِمُ: هذا مَقامُ العائِذِ بكَ مِنَ القَطِيعَةِ، قالَ: نَعَمْ، أما تَرْضَيْنَ أنْ أصِلَ مَن وصَلَكِ، وأَقْطَعَ مَن قَطَعَكِ؟ قالَتْ: بَلَى يا رَبِّ، قالَ: فَهو لَكِ قالَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ: فاقْرَؤُوا إنْ شِئْتُمْ: "فَهلْ عَسَيْتُمْ إنْ تَوَلَّيْتُمْ أنْ تُفْسِدُوا في الأرْضِ وتُقَطِّعُوا أرْحامَكُمْ».',
    ' قال رسول الله -صلى الله عليه وسلم-: «قالَ اللَّهُ: أَنا الرَّحمنُ وَهيَ الرَّحمُ، شَقَقتُ لَها اسمًا منَ اسمي، من وصلَها وصلتُهُ، ومن قطعَها بتتُّهُ»',
    ' قال رسول الله -صلى الله عليه وسلم-: «الرَّحِمُ مُعَلَّقَةٌ بالعَرْشِ تَقُولُ مَن وصَلَنِي وصَلَهُ اللَّهُ، ومَن قَطَعَنِي قَطَعَهُ اللَّهُ»، وقال رسول الله -صلى الله عليه وسلم- : «إِنَّ اللَّهَ يوصِيكم بِأُمَّهَاتِكُمْ ثُمَّ يوصِيكم بِأُمَّهَاتِكُمْ ثُمَّ يوصِيكم بِآبَائِكُمْ ثُمَّ يوصِيكم بِالْأَقْرَبِ فَالْأَقْرَبِ».',
    ' قال رسول الله -صلى الله عليه وسلم- :«أرحامكم أرحامكم». قال رسول الله -صلى الله عليه وسلم- : «مَنْ أَحَبَّ أَنْ يَصِلَ أَبَاهُ فِي قَبْرِهِ فَلْيَصِلْ إِخْوَانَ أَبِيهِ بَعْدَهُ».',
  ];
  static List hadethTahthSelatRahem = [
    'قال رسول الله -صلى الله عليه وسلم- : «مَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، ومَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيَصِلْ رَحِمَهُ، ومَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيَقُلْ خَيْرًا أوْ لِيَصْمُتْ».',
    ' قال رسول الله -صلى الله عليه وسلم-: «يا أيُّها النَّاسُ أفشوا السَّلامَ، وأطعِموا الطَّعامَ، وصِلوا الأرحامَ، وصلُّوا باللَّيلِ، والنَّاسُ نيامٌ، تدخلوا الجنَّةَ بسَلامٍ».',
    ' قال رسول الله -صلى الله عليه وسلم- : «مَن سَرَّهُ أنْ يُبْسَطَ له في رِزْقِهِ، وأَنْ يُنْسَأَ له في أثَرِهِ، فَلْيَصِلْ رَحِمَهُ».',
    'قال رسول الله -صلى الله عليه وسلم- : «ليسَ الواصِلُ بالمُكافِئِ، ولَكِنِ الواصِلُ الذي إذا قُطِعَتْ رَحِمُهُ وصَلَها».',
    'قال رسول الله -صلى الله عليه وسلم-: «إنَّ الصَّدقةَ على المسْكينِ صدقةٌ وعلى ذي الرَّحمِ اثنتانِ صدَقةٌ وصِلةٌ»، قال رسول الله- صلى الله عليه وسلم- : «من اتقى ربه ووصل رحمه نُسِىءَ في أجله وَثَرى ماله وأَحَبَّه أهلُهُ»، قال رسول الله- صلى الله عليه وسلم-: «إِنَّ الصَّدَقَةَ وَصِلَةَ الرَّحِمِ يَزِيدُ اللَّهُ بِهِمَا فِي الْعُمْرِ وَيَدْفَعُ بِهِمَا مَيْتَةَ السُّوءِ».',
    'قال رسول الله- صلى الله عليه وسلم-: «أَفْضَلُ الصَّدَقَةِ عَلَى ذِي الرَّحِمِ الْكَاشِحِ»، قال رسول الله- صلى الله عليه وسلم-: «أفضَلُ الْفَضَائِلِ أَنْ تَصِلَ مَنْ قَطَعَكَ، وَتُعْطِيَ مَنْ حَرَمَكَ، وَتَصْفَحَ عَمَّنْ ظَلَمَكَ».',
  ];
  static List hadethOkabaSelatRahem = [
    ' قال رسول الله -صلى الله عليه وسلم-: «إِنَّ أعمالَ بني آدمَ تُعْرَضُ علَى اللهِ تعالى عَشِيَّةَ كُلِّ خميسٍ ليْلَةَ الجمعَةِ، فلا يُقْبَلُ عملُ قاطِعِ رحِمِ»، وقال رسول الله -صلى الله عليه وسلم-: «لَا يَدْخُلُ الجَنَّةَ قَاطِعُ رَحِمٍ».',
    'قال رسول الله -صلى الله عليه وسلم-: «ما مِن ذنبٍ أجدرُ أن يُعجِّلَ اللهُ لصاحبِه العقوبةَ في الدُّنيا مع ما يَدَّخرُ لهُ في الآخرةِ من البَغي وقطيعةِ الرَّحمِ»، قال رسول الله -صلى الله عليه وسلم- : «لَا تنزلُ الرَّحْمَةَ عَلَى قومٍ فِيهِمْ قَاطِعُ رحِم».',
  ];
  static List quranSelatRahem = [
    'قال تعالى: «وَالَّذِينَ يَصِلُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوءَ الْحِسَابِ»، قال تعالى: «وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَىٰ بِبَعْضٍ».',
    'قال تعالى: «إِنَّ اللَّهَ لَا يَسْتَحْيِي أَن يَضْرِبَ مَثَلًا مَّا بَعُوضَةً فَمَا فَوْقَهَا ۚ فَأَمَّا الَّذِينَ آمَنُوا فَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِن رَّبِّهِمْ ۖ وَأَمَّا الَّذِينَ كَفَرُوا فَيَقُولُونَ مَاذَا أَرَادَ اللَّهُ بِهَٰذَا مَثَلًا ۘ يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا ۚ وَمَا يُضِلُّ بِهِ إِلَّا الْفَاسِقِينَ الَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ ۚ أُولَٰئِكَ هُمُ الْخَاسِرُونَ».',
    'قال تعالى: «وَالَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ ۙ أُولَٰئِكَ لَهُمُ اللَّعْنَةُ وَلَهُمْ سُوءُ الدَّارِ»',
    ' قال تعالى: «إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ وَإِيتَاءِ ذِي الْقُرْبَىٰ وَيَنْهَىٰ عَنِ الْفَحْشَاءِ وَالْمُنكَرِ وَالْبَغْيِ ۚ يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ».',
    ' قال -تعالى-: «فَهَلْ عَسَيْتُمْ إِن تَوَلَّيْتُمْ أَن تُفْسِدُوا فِي الْأَرْضِ وَتُقَطِّعُوا أَرْحَامَكُمْ أُولَٰئِكَ الَّذِينَ لَعَنَهُمُ اللَّهُ فَأَصَمَّهُمْ وَأَعْمَىٰ أَبْصَارَهُمْ»',
  ];
  static List mogtamaaSelatRahem = [
    'سببٌ لرفعة المتواصلين وعزّتهم؛ فبتواصلهم يرتفع شأنهم بين الناس، ويعلو قدرهم.',
    'الزيادة في مال الإنسان، واتساع رزقه، وكثرة الخير لديه.',
    'ظهور أثر البركة على عمل الإنسان وسعيه، وحصول نتائجها في ماله.',
    'النهوض بالأسرة المسلمة، وتمكينها من التصدي للأمراض الاجتماعية والسلوكية التي تنتشر في المجتمع، والوقاية منها.',
    ' تكاتف الناس وإعانتهم لبعضهم البعض، والسعي في نصرة المظلوم وأخذ حقه من الظالم.',
    'كثرة الخيرات في أرجاء المجتمع المسلم، وانتشار روح المحبة والألفة بين الناس.',
  ];
  static List waySelatRahem = [
    'تبادل الزيارات.',
    'مشاركة الأفراح والأحزان.',
    'ردّ الأذى والسوء عنهم.',
    'تفقّد أحوالهم.',
    'إصلاح ذات بينهم عند وقوع المشاحنات والخصامات والبغضاء.',
    'احترام الكبير والعطف على الصغير.',
    'مساعدتهم ماديًّا ومعنويًّا.',
    'تبادل الهدايا معهم.',
    'عيادة المرضى منهم.',
    'حضور جنازاتهم والصلاة عليهم.',
  ];
}
