import '../model/sonn.dart';

class DataOfSonn {
  static List<SonnModel> listItem = [
    SonnModel(title: 'صلاة الإستخارة', description: """
    في الصحيحين عن جابر قال: كان النبي صلى الله عليه وسلم يعلمنا الاستخارة في الأمور كلها كما يعلمنا السورة من القرآن، يقول: " إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة، ثم ليقل: اللهم إني أستخيرك بعلمك، واستقدرك بقدرتك، وأسألك من فضلك العظيم، فإنك تقدر ولا أقدر، وتعلم ولا أعلم، وأنت علام الغيوب.

اللهم إن كنت تعلم أن الأمر خير لي في ديني ومعاشي وعاقبة أمري - أو قال: في عاجل أمري وآجله، فاقدره لي، ويسره لي، ثم بارك لي فيه، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري أو قال في عاجل أمري وآجله، فاصرفه عني، واصرفني عنه، واقدر لي الخير حيث كان، ثم رضني به". قال: " ويسمي حاجته ".

معنى الاستخارة:

هي طلب العبد من الله أن يختار له الخير والأصلح من الأمرين، الفعل أو الترك، الإقدام أو الإحجام، متوسلا إلى الله بعلمه وقدرته، مع إظهار ضعف نفسه وعجزه وجهله.

ركن الاستخارة:

يقوم دعاء الاستخارة على أفعال وأقوال، منها الصلاة والدعاء، ولكن له أسسا إيمانية عميقة، وأهمها التفويض التام لله تعالى في تدبير الأمر، وهداية القلب لما فيه صلاح الدين والدنيا، مع ما يصاحبه من تمام التوكل على الله، المتضمن للثقة به، وحسن الظن بتقديره، وتسليم الأمر له، وهذا ظاهر من خلال ما يقوله العبد في دعائه (إن كنت تعلم...) فهو يضع الاحتمالين على حد السواء، داعيا الله أن يختار له، لأنه يعلم الأمور وخفاياها وخباياها، ويعلم ظاهرها وباطنها، ومبدأها ومنتهاها، والعبد لا يعلم ولا يقدر فهو يستخير الله ويستقدره بمعنى يطلب منه أن يقدره على الخير.

أثر الاستخارة

الغاية التي يؤديها دعاء الاستخارة هي حصول الرضا والطمأنينة لأقدار الله، بحيث يصل العبد إلى مرحلة استواء الأمر عنده، سواء الفعل أو الترك، وسواء الحصول بالمرغوب أو فواته وعدم تحصيله، كما قال تعالى (لِكَيْلَا تَأْسَوْا عَلَى مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ) سورة الحديد (23)، وهذا واضح من ختامية الدعاء بالاحتمالين، ففي نهاية كل واحد يقول (ثم أرضني به)، وأنعم بها من ثمرة، ومن رزق الرضا عن الله وأقداره فقد ولج بوابة السعادة العظمى.

أخطاء تتنافى مع مضامين الدعاء:

مما يقع فيه البعض في موضوع الاستخارة التناقض مع مبدأ الاستخارة، فهو يدعو بتيسير الخير، مسبقا الاعتقاد بأن أحد الأمرين هو الخير والمصلحة والمنفعة، فيتعلق قلبه بالظفر به، متناسيا أن مقام الاستخارة يتناقض مع هذا الاعتقاد المسبق، بل يقتضي منه اطراح الرغبات والميول النفسية، وتفويض الأمر لله تعالى.

وبالتالي فإن هذا الداعي والحال كما ذكرت إذا لم يحصل له ما يظنه خيرا تسخط وحصل له الحزن والحسرة والاضطراب، وهذا الخطأ مبني على سابقه، فلو تحقق قلبه من الاستخارة التي تقوم على التسليم والتفويض لما حصل له هذا الاضطراب والحزن، فهذا يدل على خلل في معنى الاستخارة لديه.

ومن الأخطاء انتظار البعض أن تأتيه رؤيا ترشده لنتيجة الاستخارة، وتوجهه لأحد الاحتمالات، وذلك ليس بلازم، بل غاية ما يلزمه أن يستخير الله تعالى، ثم استشارة أهل الخبرة في الأمر الذي تردد فيه، مع ما يصاحب ذلك من جمع المعلومات المتعلقة بذلك الأمر، ثم يترجح الأمر لديه بحسب المعطيات الواقعية، ولا شك أن ما تتيسر أسبابه، ويتهيأ له فعله هو نتيجة الاستخارة، فيكون راضيا بما يسر الله له من الفعل أو الترك، فلا يلزم أن تأتيه رؤيا تقول له افعل أو لا تفعل.
وقد قال الحكماء: الناس ثلاثة: رجل، ونصف رجل، ومن ليس بشيء، فأما الرجل فمن له رأي ويستشير غيره، ونصف الرجل من له رأي ولكنه لا يستشير، وأما الثالث فلا رأي ولا استشارة.

من المضامين التي يرشد إليها دعاء الاستخارة:

أولوية صلاح أمر العبد في دينه قبل كل شيء، فأول معايير الاستخارة (في ديني)، فما كان خيرا للدين فهو خير للدنيا، وما كان شرا على الدين فهو شر على الدنيا والآخرة، وهذا توجيه لاهتمامات العبد، بحيث يكون الدين هو أول ما يخاف عليه من النقص، وأن يكون صلاح دينه هو المنطلق الذي يبدأ منه، ثم يأتي بعد ذلك أمور المعاش والمنافع الدنيوية.

وكذلك التقديم بين يدي الدعاء بالصلاة من غير الفريضة فيه إشارة إلى أن الدعاء الأكمل الذي يسبقه عمل صالح، بحيث يكون وسيلة لقبوله، كما أن الدعاء الأكمل يبدأ بالثناء على الله والصلاة والسلام على النبي صلى الله عليه وسلم، ولذلك ذكر الإمام النووي في كتاب الأذكار أنه يسن التقديم بين يدي دعاء الاستخارة بالثناء على الله والصلاة على النبي كسائر الأدعية.

وفي قوله (إذا هم أحدكم بالأمر) دون تحديد رتبة هذا الأمر فيه إشارة إلى أن مشروعية صلاة الاستخارة في كل أمور العبد، وهذا يجعل الارتباط بين العبد وبين ربه وثيقا وقويا، فكل ما هم بعمل وحصل عنده احتمال بمصالح ومفاسده فزع إلى الصلاة ودعاء الاستخارة،  وهذه الأمور التي يستخير فيها عامة سواء كانت مباحة أو مشروعة، ووجه الاستخارة في الأمور المشروعة في فعله هو، وليس في أصلها وذاتها، فهي خير ولا شك، ولكنه قد يستخير في تقديم بعضها على بعض، أو في توقيتها، أو في وسائلها وأدواتها، كالذي يريد الحج قد يستخير في تقديمه أو تأخيره أو في وسيلة الذهاب إليه، وقد يكون مريضا ويخشى من تطاول مرضه فيستخير في ذلك كله.

ثم هو في كل نجاحاته يعلق الأمر بالله تعالى، ويجعل الفضل له وحده، بخلاف من لا يستخير الله تعالى، فيحصل عنده غرور واستبداد، وربما نسب الفضل لذاته، وقدراته، ومؤهلاته، وهذا من الأبعاد التي شرعت صلاة الاستخارة لتنقية قلب المسلم منها، فالاستخارة تعلم العبد أنه لا يختار ولا يدبر ولا يتصرف إلا بتقدير الله وتدبيره.

وأخيرا فإن أساس هذا الأمر أن يعلم العبد ويوقن أن الله يعلم الغايات التي يطلبها العبد، ويعلم الوسائل الموصلة له إليها، أما العبد فهو يجهل ذلك، فقد يظن سعادته في أمر ما فهو يسعى له سعيا حثيثا، ويعلم الله أن سعادته في غيره، فييسر ما يعلمه موصلا له إلى سعادته قطعا، فقد يكون الفقر موصلا له إلى غاية السعادة، وقد يكون المرض الذي يعجزه عن الفجور هو سعادته، وقد يكون منعه من مرغوباته هو عين سعادته، وهذا علم ببواطن الأمور وعواقبها والعبد لا يحسنه بعلمه المحدود، فإذا كان ذلك كذلك فلا غنى للعبد عن الاستخارة في كل أموره.
    """),
    SonnModel(
        title: 'التّداوي بالدّعاء',
        description:
            """عن أمّ المؤمنين عَائِشَةَ رضي الله عنها قالت: كَانَ رَسُولُ اللهِ صلّى الله عليه وسلّم إِذَا اشْتَكَى مِنَّا إِنْسَانٌ مَسَحَهُ بِيَمِينِهِ، ثُمَّ قَالَ: (أَذْهِبِ الْبَاسَ رَبَّ النَّاسِ، وَاشْفِ أَنْتَ الشَّافِي، لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ، شِفَاءً لاَ يُغَادِرُ سَقَمًا) رواه مسلم بهذا اللفظ، وله ألفاظ أخرى متفق عليها.

ينبغي أن يعتقد المسلم اعتقادًا جازمًا أن الشافي هو الله عز وجل، قال الله تعالى على لسان نبيّنا إبراهيم عليه الصّلاة والسلام في معرِض وصفه لربِّ العالمين: {وَإِذَا مَرِضْتُ فَهُوَ يَشْفِينِ} (الشعراء: 80)، فهي صفة جليلة عظيمة من صفاته عزّ وجلّ، وقد كان رسول الله صلّى الله عليه وسلّم حريصًا على زرع هذا المعنى العظيم في نفوس المؤمنين، فكان من سُنَّته أن يدعو الله تعالى بأدعية مختلفة حال المرض، يطلب بها الشفاء منه سبحانه وتعالى، ولم يكن هذا يعني أنه لا يهتمُّ بالتّداوي أو يحرص عليه، وإنما كان يهدف إلى تصحيح عقيدة المسلم، فالدواء لن يُحَقِّق الشفاء إلا بإذن الله عزّ وجلّ، والدعاء الذي عَلَّمنا إيّاه رسول الله صلى الله عليه وسلم هو وسيلة عمليَّة من وسائل العلاج.

وقد وَرَدَ ما يؤكد هذه السُّنّة العظيمة النّافعة في حديث عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّ رضي الله عنه أَنَّهُ شَكَا إِلَى رَسُولِ اللهِ صلّى الله عليه وسلّم وَجَعًا يَجِدُهُ فِي جَسَدِهِ مُنْذُ أَسْلَمَ، فَقَالَ لَهُ رَسُولُ اللهِ صلّى الله عليه وسلّم: (ضَعْ يَدَكَ عَلَى الَّذِي تَأَلَّمَ مِنْ جَسَدِكَ وَقُلْ: بِاسْمِ اللهِ، ثَلاَثًا، وَقُلْ سَبْعَ مَرَّات: أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ) رواه مسلم.

وعن عائشة رضي الله عنها أيضا: أن النّبي صلّى الله عليه وسلّم كان إذا اشتكى الإنسان الشّيء منه، أو كانت به قرحة، أو جرح، قال النّبي صلّى الله عليه وسلّم بأصبعه هكذا، -ووضع سفيان بن عيينة راوي الحديث سبّابته بالأرض ثم رفعها-، وقال: (باسم الله، تربة أرضنا، بريقة بعضنا، يُشفى سقيمنا، بإذن ربنا) متفق عليه.

فهذه الأحاديث العظيمة غفل عنها كثير من النّاس، لاسيما الأطباء والمشتغلون بمعالجة النّاس، فإنّ المريض قد يعاني أمدًا طويلًا، ويجرِّب صنوف الأدوية وطرق العلاج، ثم قد لا يخرج بكبير طائل، وأمّا هذا العلاج النّبوي بالدّعاء فإنّه مضمون النّتيجة والعاقبة، كما أخبر الّذي لا ينطق الهوى.

فلنحرص على حفظ هذه الأدعية المباركة والتّداوي بها، مع الاعتقاد أن الشّفاء فيها، وحثّ النّاس عليها، حتى ننال ما يترتب عليها من شفاء وعافية وراحة، وحتى ننال أجر إحياء سنّة من سنن المصطفى صلوات ربّي وسلامه عليه."""),
    SonnModel(title: 'تسوية صفوف الصّلاة وإتمامها', description: """
    عن أنس بن مالك رضي الله عنه عن النّبيّ صلّى الله عليه وسلّم قال: (سَوُّوا صُفُوفَكُمْ, فَإِنَّ تَسْوِيَةَ الصُّفُوفِ مِنْ إِقَامَةِ الصَّلاةِ) متّفق عليه.

وعن أبي مسعود عقبة بن عمرو رضي الله عنه قال: كان رسول الله صلّى الله عليه وسلّم يَمْسَحُ مَنَاكِبَنَا فِي الصَّلَاةِ، وَيَقُولُ: (اسْتَوُوا، وَلَا تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ، لِيَلِنِي مِنْكُمْ أُولُو الْأَحْلَامِ وَالنُّهَى ثُمَّ الَّذِينَ يَلُونَهُمْ، ثُمَّ الَّذِينَ يَلُونَهُمْ)، قال أبو مسعود: "فَأَنْتُمُ الْيَوْمَ أَشَدُّ اخْتِلَافًا" رواه مسلم.

وعن بُشَيرِ بن يَسَارٍ الأنصاريِّ عن أنس بن مالك رضي الله عنه أنه قدم المدينة فقيل له: مَا أَنْكَرْتَ مِنَّا مُنْذُ يَوْمِ عَهِدْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ؟ قَالَ: "مَا أَنْكَرْتُ شَيْئًا إِلا أَنَّكُمْ لا تُقِيمُونَ الصُّفُوفَ" رواه البخاري.

يتساهل كثير من المُصلّين في تسوية وانتظام صفوف الصّلاة وإتمامها، رغم أنّها سنّة نبويّة عظيمة تدلُّ على الاستقامة والاعتدال ظاهرًا - كما هو المطلوب باطنًا -، كما تدلُّ على أهمّيّة النّظام في حياة المسلم بشكل عام، وعلى النّظام في العبادة بشكل خاص، حيث دَأَبَ نبيّنا محمّد صلّى الله عليه وسلّم على تسوية صفوف الصّلاة قبل البدء فيها، ووجّه أصحابه رضوان الله عليهم أجمعين إلى العناية بذلك في مناسبات كثيرة، تارة بالتّرغيب، وأخرى بالتّرهيب، فصارت بذلك سنّة متواترة فعليّة قوليّة، موجَّهة للإمام والمأمومين جميعًا.

خطورة ترك تسوية الصّفوف

عن النّعمان بن بشير رضي الله عنهما قال: قال النّبي صلّى الله عليه وسلّم: (لَتُسَوُّنَّ صُفُوفَكُمْ، أَوْ لَيُخَالِفَنَّ الله بَيْنَ وُجُوهِكُمْ) متّفق عليه، ولمسلمٍ: كان رسول الله صلّى الله عليه وسلّم يُسَوِّي صُفُوفَنَا حَتَّى كَأَنَّمَا يُسَوِّي بِهَا الْقِدَاحَ - مبالغةً في تسويتها حتى تصير كأنما يُقوّم بها السّهام لشدّة استوائها واعتدالها -, حَتَّى إذَا رَأَى أَنْ قَدْ عَقَلْنَا عَنْهُ, ثُمَّ خَرَجَ يَوْمًا فَقَامَ حَتَّى كَادَ أَنْ يُكَبِّرَ, فَرَأَى رَجُلاً بَادِياً صَدْرُهُ فَقَالَ: (عِبَادَ الله, لَتُسَوُّنَّ صُفُوفَكُمْ أَوْ لَيُخَالِفَنَّ الله بَيْنَ وُجُوهِكُمْ).

فهذا حثٌّ على رعاية تسوية صفوف الصّلاة وانتظامها، لكونه يؤثّر على حال الأمّة وأُلفتها، وتحذيرٌ من إهمال تسوية الصّفوف في الصّلاة لكونه يؤدِّي إلى اختلاف القلوب وضعفها وسيطرة الشّيطان عليها.

إتمام الصّفوف وتراصّها

وعن جابر بن سَمُرَةَ رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (أَلَا تَصُفُّونَ كَمَا تَصُفُّ الْمَلَائِكَةُ عِنْدَ رَبِّهِا؟)، قلنا: وَكَيْفَ تَصُفُّ الْمَلَائِكَةُ عِنْدَ رَبِّهِا؟ قال: (يُتِمُّونَ الصُّفُوفَ الْأُوَلَ، وَيَتَرَاصُّونَ فِي الصَّفِّ) رواه مسلم.

هذا ترغيبٌ من النّبي صلّى الله عليه وسلّم وحثٌّ على الاهتمام بإتمام صفوف الصّلاة وتسويتها وتراصّها، لأنها دليلٌ على وحدة الأمّة، والتزام جماعتها بدين واحد وإمام واحد، والتراصُّ: هوَ التضامُّ والتّداني والتّلاصُق، ومنه قوله تعالى: {إِنَّ الله يُحِبُّ الَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيَانٌ مَرْصُوصٌ} (الصّف:4)، فينبغي على المأموم السّمع والطّاعة لإمامه عند توجيهه إلى إتمام وتسوية الصّفوف والتّراص فيها، ولا يتضجّر أو يتسخّط من تسوية الصّفوف والعناية بها، بل يكون عوناً لإمامه وللمصلّين على ذلك.

ونختم بما ذكره الإمام النّووي رحمه الله بشأن تسوية الصّفوف وإتمامها في كتاب (إعانة الطالبين)، حيث قال: "ومِن السُّنن المهملة المَغفول عنها: تسوية الصّفوف والتّراصّ فيها، وقد كان عليه الصّلاة والسّلام يتولى فعل ذلك بنفسه، ويُكثر التّحريض عليه والأمر به"، فلنحرص على إحياء هذه السُّنَّة الجليلة، بالالتزام بها وحثّ النّاس عليها، حتى ننال ثوابها، وننال أجر إحياء سنّة من سنن المصطفى صلّى الله عليه وسلّم."""),
    SonnModel(
        title: 'دعاء كفّارة المجلس',
        description:
            """عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (مَنْ جَلَسَ فِي مَجْلِسٍ، فَكَثُرَ فِيهِ لَغَطُهُ، فَقَالَ قَبْلَ أَنْ يَقُومَ مِنْ مَجْلِسِهِ ذَلِكَ: سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ، إِلَّا غُفِرَ لَهُ مَا كَانَ فِي مَجْلِسِهِ ذَلِكَ) رواه أبو داود والترمذي وصححه الألباني، وعند أبي داود من حديث أبي بَرْزَة الأَسْلَمِيِّ رضي الله عنه، قال: كان رسول الله صلى الله عليه وسلم يقول بِأَخَرَةٍ إِذَا أَرَادَ أَنْ يَقُومَ مِنَ المَجْلِسِ: (سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ).

ذِكر الله عزّ وجلّ في كل حين

من أسباب الحسرة يوم القيامة أن يجلس العبد مجلساً ثم يقوم، ولم يذكر الله تعالى فيه، ولو لم يكن فيه شيء من الكلام الحرام، فعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (مَا جَلَسَ قَوْمٌ مَجْلِساً لَمْ يَذْكُرُوا اللَّهَ فِيهِ إِلاَّ كَانَ عَلَيْهِمْ تِرَةً -أي حسرةً ونقصانًا-، وَمَا مَشَى أَحَدٌ مَمْشًى لَمْ يَذْكُرِ اللَّهَ فِيهِ إِلاَّ كَانَ عَلَيْهِ تِرَةً، وَمَا أَوَى أَحَدٌ إِلَى فِرَاشِهِ وَلَمْ يَذْكُرِ اللَّهَ فِيهِ إِلاَّ كَانَ عَلَيْهِ تِرَةً) رواه ابن حبان بإسناد صحيح، وعند أبي داود بلفظ: (مَا مِنْ قَوْمٍ يَقُومُونَ مِنْ مَجْلِسٍ لاَ يَذْكُرُونَ اللَّهَ فِيهِ، إِلاَّ قَامُوا عَنْ مِثْلِ جِيفَةِ حِمَارٍ وَكَانَ لَهُمْ حَسْرَةً).

فكيف إذا كان المجلس فيه خوضٌ في الباطل أو وقوعٌ في الغيبة أو النميمة أو البهتان؟ وقد يكون فيه فحشٌ في القول أو سخرية واستهزاء، أو رجم بالغيب، وقد نكذب ولو مازحين، أو نغضب فنخرج عن شعورنا بما لا يليق من القول أو الفعل، وهكذا!

ولا شك أن أسلم الطرق أن نحترس من جميع آفات اللسان، فلا نتكلم إلا بما يُرْضِي الله عز وجل، ومع ذلك فإن نبينا صلى الله عليه وسلم يعلم أن نفوسنا ضعيفة، وأننا قد نقع في معاصي اللسان مهما اجتهدنا؛ لذلك شرع لنا سُّنَّة نبوية عظيمة، كان يلتزم بها، وحثّنا عليها حتى تُكفّر ذنوبنا أولاً بأول، وهي هذا الدعاء الذي نحن بصدد بيانه وإيضاحه.

يقول النبي الله صلى الله عليه وسلم: (مَنْ جَلَسَ فِي مَجْلِسٍ، فَكَثُرَ فِيهِ لَغَطُهُ): اللَّغط هو الصوت والجلبة، وأراد به الهُراء من القول، وما لا طائل تحته من الكلام، والجلبة الخالية عن الفائدة، فمن جلس مجلساً كان فيه شيء من ذلك، فليحرص على الالتزام بذلك التوجيه النبوي.

ثم وضّح الدعاء الذي ينبغي أن يُقال قبل القيام من المجلس: (سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ): أي أنَّ الدعاء يكون في نهاية المجلس، وفي لفظ أبي برزة الأسلمي: "يقول بِأَخَرَةٍ إِذَا أَرَادَ أَن يَقُومَ مِنَ المَجلِسِ"، وهذا الدعاء مشتملٌ على تنزيه الله تعالى من النقائص والعيوب، وفيه إثبات الألوهية لله وحده لا شريك له، ثم الرجوع إلى الله تعالى معترفاً بالذنب طالباً المغفرة والتوبة.

ثم بيّن فائدة هذا الدعاء فقال: (إِلَّا غُفِرَ لَهُ مَا كَانَ فِي مَجْلِسِهِ ذَلِكَ): أي من الذنوب من غير مظالم العباد، فإنها تحتاج أن يتحلل من صاحبها.

كيف كان النبي صلى الله عليه وسلم يختِم مجلسه؟

كان النبي صلى الله عليه وسلم يحبُّ أن يختم مجلسه بدعاء يَذْكُر فيه اللهَ عز وجل، ويُذَكِّر الحضورَ به سبحانه وتعالى، فعن ابن عمر رضي الله عنهما، قال: قَلَّمَا كَانَ رَسُولُ اللهِ صلى الله عليه وسلم يَقُومُ مِنْ مَجْلِسٍ حَتَّى يَدْعُوَ بِهَؤُلاَءِ الدَّعَوَاتِ لأَصْحَابِهِ: (اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ، وَمِنَ الْيَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا، وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا, وَاجْعَلْهُ الْوَارِثَ مِنَّا، وَاجْعَلْ ثَأرَنَا عَلَى مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَى مَنْ عَادَانَا، وَلاَ تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا, وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا, وَلاَ مَبْلَغَ عِلْمِنَا، وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لاَ يَرْحَمُنَا) رواه الترمذي وصححه الألباني.

فلْنحفظْ هذه الأدعية الذي حثّنا عليها النبي صلى الله عليه وسلم وكان يقولها، ولْنَقُلْها في نهاية كل مجالسنا، ونحث الناس عليها، حتى ننال المغفرة من الله عز وجل، وننال أجر إحياء سنة من سنن المصطفى صلى الله عليه وسلم."""),
    SonnModel(
        title: 'تعجيل الفطر وتأخير السحور',
        description:
            """عن سهل بن سعد الساعدي رضي الله عنه أَن رسول الله صلى الله عليه وسلم قال: (لاَ يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الفِطْرَ) متفق عليه، وعن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (تَسَحَّرُوا فَإِنَّ فِي السُّحُورِ بَرَكَةً) متفق عليه.

وعن سهل بن سعد رضي الله عنه قال: "كُنْتُ أَتَسَحَّرُ فِي أَهْلِي، ثُمَّ يَكُونُ سُرْعَةٌ بِي أَنْ أُدْرِكَ صَلَاةَ الْفَجْرِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّم" رواه البخاري، وعن أنس عن زيد بن ثابت رضي الله عنهما قال: "تَسَحَّرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم، ثُمَّ قَامَ إِلَى الصَّلاَةِ، قُلْتُ: كَمْ كَانَ بَيْنَ الأَذَانِ وَالسَّحُورِ؟ قَالَ: قَدْرُ خَمْسِينَ آيَةً" رواه البخاري.

يرتبط بشعيرة الصيام سنن نبوية كثيرة، منها: "تعجيل الفطر" و"تأخير السحور"، وهما من سنن الرحمة في ديننا الحنيف، لأنهما يتعلقان بالالتزام بما فرضه الله تعالى علينا وشرعه لنا نبينا محمد صلى الله عليه وسلم دون زيادة أو نقصان، فالزيادة غلوّ والنقصان تفريط.

تعجيل الفطر

يتجلّى ذلك في قول النبي صلى الله عليه وسلم: (لاَ يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الفِطْرَ): قال الإمام النووي: "أي لا يزال أمر الأمة منتظما وهم بخير ما داموا محافظين على هذه السُّنّة، وإذا أخروه كان ذلك علامة على فساد يقعون فيه"، فتعجيل الفطر علامة على أنهم ملتزمون بسُّنَّة النبي صلى الله عليه وسلم، كما أنهم رحماء بأنفسهم وأهليهم، فلا يُرهقون أبدانهم بما لا فائدة منه، ويتحقق ذلك التعجُّل بشيء من التمر أو الماء بمجرَّد دخول وقت المغرب، كما في الحديث المتفق عليه عن عمر بن الخطاب رضي الله عنه عن النبي صلى الله عليه وسلم قال: (إذا أقبل الليل من هاهنا، وأدبر النهار من هاهنا، وغربت الشمس؛ فقد أفطر الصائم).

وعند الإمام مسلم عن أبي عطية قال: دخلت أنا ومسروق على عائشة رضي الله عنها فقال لها مسروق: رجلان من أصحاب محمد صلى الله عليه وسلم كلاهما لا يألو عن الخير: أحدهما يعجل المغرب والإفطار، والآخر يؤخر المغرب والإفطار؟ فقالت: "من يعجل المغرب والإفطار؟"، قال: عبد الله يعني ابن مسعود، فقالت: "هكذا كان رسول الله صلى الله عليه وسلم يصنع".

تأخير السحور

وأما تأخير السحور فإنه من السنن الفعلية التي نقلها كثير من الصحابة رضوان الله عليهم عن النبي صلى الله عليه وسلم، كما في حديث زيد بن ثابت رضي الله عنهما قال: "تَسَحَّرْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم، ثُمَّ قَامَ إِلَى الصَّلاَةِ، قلت: كَمْ كَانَ بَيْنَ الأَذَانِ وَالسَّحُورِ؟ قَالَ: قَدْرُ خَمْسِينَ آيَةً" رواه البخاري، وحديث سهل بن سعد رضي الله عنه قال: "كُنْتُ أَتَسَحَّرُ فِي أَهْلِي، ثُمَّ يَكُونُ سُرْعَةٌ بِي أَنْ أُدْرِكَ صَلَاةَ الْفَجْرِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ" رواه البخاري، وهذا يعني أن الفارق بين انتهاء السحور والفجر دقائق قليلة، وهذا التأخير يعطي الصائم قوة على الصيام، وقدرة على تحمُّل مشقَّة الجوع والعطش؛ لكن ينبغي أن يكون الدافع الحقيقي لتأخير السحور هو الاقتداء بالنبي صلى الله عليه وسلم واتباعه، ومخالفة أهل الكتاب، حتى يتحصّل أجر هذه السُّنَّة.

ودليل مخالفة أهل الكتاب ما أخرجه الإمام مسلم وغيره عن أبي قيس مولى عمرو بن العاص قال: كان عمرو بن العاص رضي الله عنه يأمرنا أن نصنع له طعاما ليتسَحَّرَ به, قال: فَلا يُصِيبُ منه كثيرًا, فقلنا: تأْمُرُنا به ولا تُصِيبُ منه كثيرًا, فقال: "إِنِّي لا آمُرُكُمْ أَنِّي أَشْتَهِيهِ, وَلَكِنِّي سَمِعْت ُرَسُولَ الله صلى الله عليه وسلم يقول: (إِنَّ فَصْلَ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ) رواه مسلم.

فلنحرص على تطبيق سنتي: "تعجيل الفطر" و"تأخير السحور" حتى ننال ما يترتب عليهما من فضائل، وننال أجر إحياء هاتين السُّنتين من سنن المصطفى صلوات ربي وسلامه عليه."""),
    SonnModel(
        title: 'كتابة الوصية',
        description:
            """عن عبد الله بن عمر بن الخطاب رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: (مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُوصِي فِيهِ، يَبِيتُ لَيْلَتَيْنِ إِلاَّ وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ) رواه البخاري في صحيحه، قال نافع: سمعت عبد الله بن عمر يقول: "ما مرت علي ليلة منذ سمعت رسول الله صلى الله عليه وسلم يقول ذلك إلا وعندي وصيتي مكتوبة".

إذا تذكَّر الإنسان المسلمُ الموتَ في معظم أوقاته، فإن ذلك سيدفعه دومًا إلى العمل للآخرة والاستعداد لها، فيتوب من ذنوبه، ويُصلح من أعماله، ويُعيد الحقوق إلى أصحابها، ويعتذر عن أخطائه في حقِّ من أخطأ فيهم.. وهكذا؛ ولذا كان نبينا محمد صلى الله عليه وسلم يحرص على تذكير أصحابه بالموت واليوم الآخر والعمل والاستعداد له، فعن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (أَكْثِرُوا ذِكْرَ هَاذِمِ اللَّذَّاتِ) يَعْنِي الْمَوْتَ، رواه الترمذي وصححه الألباني، وهذا توجيه عام لجميع أفراد الأمة، حرصا منه - صلى الله عليه وسلم - على أمته، وشفقة بهم.

ومِن وسائل تذكُّر الموت والاستعداد له أن يكتب المسلم وصيَّته؛ خاصة إذا كانت له أموال، أو له أو عليه ديون، أو كان يشترك مع أشخاص آخرين في أمور مادية، وهذا ما يدل عليه قول النبي صلى الله عليه وسلم: (لَهُ شَيْءٌ يُوصِي فِيهِ) فهذا أحفظ للحقوق، وأرعى للأمانة التي حمّلها الله تعالى لنا، قال الإمام الشافعي رحمه الله تعالى: "معنى الحديث ما الحزم والاحتياط للمسلم إلا أن تكون وصيته مكتوبة عنده".

وأما صيغتها فقد جاء في الموسوعة الفقهية ما نصه: "ذَهَبَ الْفُقَهَاءُ إِلَى أَنَّهُ يُسْتَحَبُّ لِلْمُسْلِمِ إِذَا أَوْصَى أَنْ يَكْتُبَ وَصِيَّتَهُ، لِقَوْلِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: (مَا حَقُّ امْرِئٍ مُسْلِمٍ لَهُ شَيْءٌ يُوصِي فِيهِ، يَبِيتُ ثَلاَثَ لَيَالٍ إِلاَّ وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ ـ وَفِي لَفْظٍ: يَبِيتُ لَيْلَتَيْنِ ـ)، وَيُسْتَحَبُّ لِلْمُوصِي أَنْ يَبْدَأَهَا بِالْبَسْمَلَةِ وَالثَّنَاءِ عَلَى اللَّهِ تَعَالَى بِالْحَمْدِ وَنَحْوِهِ، وَالصَّلاَةِ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ثُمَّ الشَّهَادَتَيْنِ كِتَابَةً أَوْ نُطْقًا، ثُمَّ الإْشْهَادِ عَلَى الْوَصِيَّةِ، لأِجْل صِحَّتِهَا وَنَفَاذِهَا، وَمَنْعًا مِنَ احْتِمَال جُحُودِهَا وَإِنْكَارِهَا".

فليحرص كلٌّ منَّا على هذه السُّنَّة المهمَّة، وليبدأ كلٌّ منَّا في كتابة وصيته اليوم، وحث جميع الناس على فعل ذلك، حتى ننال أجر إحياء سنة من سنن نبينا المصطفى صلى الله عليه وسلم"""),
    SonnModel(
        title: 'الحمد بعد الطعام والشراب',
        description:
            """عن أبي أمامة الباهلي رضي الله عنه قال: كان النبي صلى الله عليه وسلم إذا رُفِعَت مائدته قال: (الحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ، غَيْرَ مَكْفِيٍّ وَلاَ مُوَدَّعٍ، وَلاَ مُسْتَغْنًى عَنْهُ رَبَّنَا) رواه البخاري.

وعن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (إِنَّ اللَّهَ لَيَرْضَى عَنْ الْعَبْدِ أَنْ يَأْكُلَ الْأَكْلَةَ فَيَحْمَدَهُ عَلَيْهَا، أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا) رواه مسلم.

يعتبر كثير من الناس أن طعامهم وشرابهم من الأشياء الاعتيادية التي لا تستحقُّ حمدًا خاصًّا عليها، أو يعدّون الطعام والشراب شيئًا هيّنا بسيطًا لا يستوجب الحمد والشكر، ولكن الحقيقة خلاف ذلك، فنعمة الطعام والشراب من أعظم نعم الله تعالى علينا، والجوعُ عقاب عاجل من الله تعالى لمَنْ لم يُقَدِّر نعمة الشبع، يقول الله جل وعلا في كتابه العزيز محذرا عباده من جحود نعمة الرزق: {وَضَرَبَ اللَّهُ مَثَلاً قَرْيَةً كَانَتْ آمِنَةً مُطْمَئِنَّةً يَأْتِيهَا رِزْقُهَا رَغَدًا مِنْ كُلِّ مَكَانٍ فَكَفَرَتْ بِأَنْعُمِ اللَّهِ فَأَذَاقَهَا اللَّهُ لِبَاسَ الْجُوعِ وَالْخَوْفِ بِمَا كَانُوا يَصْنَعُونَ} (النحل: 112).

لهذا كان من سُنَّة نبينا محمد صلى الله عليه وسلم أن يحمد الله تعالى عقب الانتهاء من الطعام والشراب مباشرة، وكان يُعْلِنُ هذا الحمد حتى يُذَكِّر به أهل بيته والآكلين معه، وحتى يُذَكِّر نفسه كذلك بفضل الله تعالى عليه، ولو لم يكن في الحمد من فائدة ومزيّة إلا أنه مَظِنّة حصول الرضا من الله جل وعلا - كما في حديث أنس بن مالك -، فأنعِمْ بها من فائدة ومزيّة.

وإذا تأملنا في ألفاظ دعائه صلى الله عليه وسلم بعد الطعام: (... غَيْرَ مَكْفِيٍّ وَلاَ مُوَدَّعٍ، وَلاَ مُسْتَغْنًى عَنْهُ رَبَّنَا) سنجد أن فيه تعظيما لله المنعم المتفضل، الذي له الحمد في جميع الأحوال، وهو سبحانه غير محتاج لأحد من خلقه؛ بل هو الذي يكفيهم، (غَيْرَ مَكْفِيٍّ) أي غير مردود ولا مقلوب، والضمير راجع إلى الطعام، وقيل: مكفي من الكفاية، يعني أن الله هو المطعم والكافي، وغير مطعم ولا مكفي فيكون الضمير لله تعالى، (ولا مُوَدَّعٍ) أي غير متروك الطلب إليه والرغبة فيما عنده؛ بمعنى أنني لن أترك حمدك أبدًا.

وهذا خطاب خاشع لله عز وجل يُعَبِّر عن امتنان العبد له سبحانه إذ أنعم عليه بالطعام والشراب، فلْنحرص على قوله بعد كل طعام، ولنتدبَّر في معانيه التعبُّدِيَّة، حتى ننال ما يترتب عليه من فضائل، وننال أجر إحياء سنة من سنن المصطفى صلى الله عليه وسلم."""),
    SonnModel(
        title: 'إحياء ما بين العشاءين',
        description:
            """تتفاضل الأعمال والقربات بتفاوت ما تتصل به من الأزمنة والأمكنة والأحوال، فهي في زمن أفضل منه في غيره، وفي بعض الأمكنة تفضل عليها فيما سواه من الأمكنة، وتفضل في حال على ما سواه من الأحوال، وتلك حكمة الله البالغة، فهو "يخلق ما يشاء ويختار"، وحين نتأمل في أفضلية بعض الأعمال نجدها راجعة إلى معنى أعمق من مجرد الزمن، بل يهدف إلى معنى التنبه حين يغفل الناس، والتذكر في حال اللهو، كالعبادة أوقات الفتن واختلاط الأمور، وقيام الليل إذا رقد الناس، وعظيم الثواب لدعاء السوق إذا اشتغل الناس ببيعهم وشراءهم وهكذا.

ومن هذا المعنى إحياء ما بين العشاءين (المغرب والعشاء)، فقد استحبها أكثر الفقهاء، وسموا تلك الصلاة: صلاة الغفلة ـ وذلك أن هذا الوقت هو وقت غفلة الناس عن الصلاة واشتغالهم بما سواها، وقد وردت أحاديث كثيرة في هذا الباب منها ما هو صحيح، ومنها ما هو ضعيف منكر، فمن الصحيح ثبوتها من فعله صلى الله عليه وسلم، من دون تقييد بعدد معين، ولا بثواب محدد، بل يستفاد منها فضيلة التنفل المطلق في هذا الوقت، ومشروعية إحيائه بالصلاة.

 فعن حذيفة ـ رضي الله عنه ـ قال: «أتيت النبي صلى الله عليه وسلم: فصليت معه المغرب، فصلى إلى العشاء». قال المنذري: رواه النسائي بإسناد جيد، وصححه الألباني.

قال ابن حجر: الركعتان بين المغرب والعشاء سنة، فقد صرح الماوردي والروياني بندب صلاة الأوابين قالا وتسمى: صلاة الغفلة لحديث بذلك، وأكملها عشرون، لخبر: «أنه -صلى الله عليه وسلم- كان يصليها عشرين ويقول: هذه صلاة الأوابين فمن صلاها غفر له» (ضعيف). وكان السلف الصالح يصلونها، قال الروياني والأظهر عندي أنها دون صلاة الضحى في التأكيد. أ.هـ. 

قال الشوكاني في نيل الأوطار: والأحاديث في الباب تدل على مشروعية الاستكثار من الصلاة ما بين المغرب والعشاء، والأحاديث وإن كان أكثرها ضعيفا فهي منتهضة بمجموعها لا سيما في فضائل الأعمال، قال العراقي: وممن كان يصلي ما بين المغرب والعشاء من الصحابة عبد الله بن مسعود، وعبد الله بن عمرو، وسلمان الفارسي، وابن عمر، وأنس بن مالك، في ناس من الأنصار، ومن التابعين الأسود بن يزيد، وأبو عثمان النهدي، وابن أبي مليكة، وسعيد بن جبير، ومحمد بن المنكدر، وأبو حاتم، وعبد الله بن سخبرة، وعلي بن الحسين، وأبو عبد الرحمن الحبلي، وشريح القاضي، وعبد الله بن مغفل، وغيرهم، ومن الأئمة سفيان الثوري. أ.هـ

وهذا الوقت لمن جرب استغلاله، والمداومة على المرابطة فيه، وانتظار الصلاة، فإنه يحصل به من صفاء النفس، ورقة الروح، وذهاب الهم وعناء البدن، بحيث لا يمكنه التفريط فيه بعد ذلك.

يقول المناوي: واحياء مَا بَين العشاءين سنة مُؤَكدَة، وانما رغب فِي هَذِه الاحاديث على الصَّلَاة بَين العشاءين؛ لأنه اذا وَاصل بَينهمَا بِالصَّلَاةِ ينغسل عَن بَاطِنه آثَار الكدورة الْحَاصِلَة فِي أَوْقَات النَّهَار من رُؤْيَة الْخلق ومخالطتهم، وَسَمَاع كَلَامهم، فان لذَلِك كُله أثرا وخدشا فِي الْقلب، حَتَّى النّظر اليهم يعقب كدرا فِي الْقلب، يُدْرِكهُ من صفا قلبه، ورق حجابه، وبالمواصلة بَين العشاءين بِالْعبَادَة يُرْجَى ذهَاب ذَلِك الأثر.

وعن أنس ـ رضي الله عنه ـ في قوله تعالى: ((تتجافى جنوبهم عن المضاجع)) ـ نزلت في انتظار الصلاة التي تدعى العتمة. رواه الترمذي وقال: حديث حسن صحيح غريب، وأبو داود. إلا أنه قال: كانوا يتنفلون ما بين المغرب والعشاء يصلون، وكان الحسن يقول: قيام الليل. وفي هذا آثار عن السلف.

ومن خلال فعل النبي صلى الله عليه وسلم، والآثار الواردة عن الصحابة والتابعين، وأصحاب المذاهب الأربعة، ثبت لدينا أن إحياء ما بين المغرب والعشاء من السنن الثابتة، والأعمال المرغب فيها، وأنهم كانوا يتحينونه؛ لما فيه من الذكر وقت الغفلة، وهو من السنن المهجورة وخاصة في بعض البلدان، وإن كان الحال في بعض البلاد الإسلامية أنهم يرابطون في المساجد يحيونه بقراءة القرآن، وأوراد الذكر، وحلق العلم، علاوة على فضيلة انتظار الصلاة الثانية، ومع ذلك ففي بعض البلدان يغفلون عن هذا الوقت وفضله، فأصبحت سنة مهجورة."""),
    SonnModel(
        title: 'استحباب البدء بالمسجد للقادم من سفر',
        description:
            """جرت عادة الناس إذا رجعوا من السفر أن تكون وجهتهم مكان إقامتهم وسكناهم، غير أن هدي النبي صلى الله عليه وسلم كان على خلاف ذلك، وهو أنه يبدأ بالمسجد فيصلي فيه ركعتين ثم يجلس إلى الناس أو يدخل بيته.

فعن كعب بن مالك رضي الله عنه قال: (كان عليه الصلاة والسلام إذا قدم من سفر بدأ بالمسجد فركع فيه ركعتين ثم جلس للناس) رواه البخاري ومسلم
وفي رواية عبد الله بن عمر رضي الله عنهما ( أن رسول الله صلى الله عليه وسلم حين أقبل من حجته دخل المدينة فأناخ على باب مسجده ثم دخل فركع فيه فركعتين ثم انصرف إلى بيته)  قال نافع: فكان ابن عمر كذلك يصنع

وفي هذه الأحاديث استحباب للمسافر إذا قدم من سفر أو حج ودخل البلد أن يبدأ ببيت الله تعالى إكرامًا له، قال ابن القيم رحمه الله: " والسنة للقادم من السفر أن يدخل البلد على وضوء وأن يبدأ ببيت الله قبل بيته فيصلي فيه ركعتين ثم يجلس للمُسَلِّمين عليه ثم ينصرف إلى أهله" .

وهذا الفعل ليس خاصا بالنبي صلى الله عليه وسلم، لأنه قد أمر جابراً رضي الله عنه حين قدم المدينة أن يفعل ذلك كما عند الطيالسي في مسنده أنه قال: ( كنا في سفر مع رسول الله صلى الله عليه وسلم ، فلما قدمنا المدينة قال لي : ائت المسجد فصل فيه ركعتين )، قال المهلب : الصلاة عند القدوم سنة وفضيلة فيها معنى الحمد لله على السلامة والتبرك بالصلاة أول ما يبدأ به في حضره ، ونعم المفتاح هي إلى كل خير ، وفيها يناجى العبد ربه تعالى وذلك هدي رسول الله وسنته ، ولنا فيه أكرم الأسوة .

ومن علِم بهذه السنة استحِب له أن يعمل بها إحياء لها واقتداء بالنبي صلى الله عليه وسلم ."""),
    SonnModel(
        title: 'كثرة الدعاء في السجود',
        description:
            """من أعظم العبادات التي يتقرب بها العبد إلى ربه، عبادة الدعاء، ففي الحديث ( الدعاء هو العبادة) رواه الترمذي وأبو داود، والدعاء هو سؤال الله تعالى خيري الدنيا والآخرة، ففيه معنى الحاجة والافتقار، والخضوع والتذلل، ومن لم يفعل فقد جلب لنفسه غضب الله تعالى كما في الحديث : عن أبي هريرة عن النبي صلى الله عليه و سلم قال : ( من لم يسأل الله غضب الله عليه ) رواه الترمذي، وهذا بخلاف البشر فإنك إن سألتهم غضبوا وضجروا، وها هو أكرم الأكرمين وأرحم الراحمين يدعو عباده إلى أن يدعوه ويسألوه فيقول: ( وقال ربكم ادعوني أستجب لكم إن الذين يستكبرون من عبادتي سيدخلون جهنم داخرين ) (غافر: 60).

الله يغضب إن تركت سؤاله             وبني آدم حين يسأل يغضب.

وللدعاء مواطن وأوقات يستجاب فيها الدعاء، يغفل عنها كثير من الناس جهلا بها، أو نسيانا، ومن هذه المواطن السجود، وهوأقرب ما يكون العبد من ربه، فترى الناس إذا سجدوا يستعجلون الرفع منه، فيفوتون على أنفسهم فضل هذا الموضع، وفرصة الاستجابة، ففي الحديث: ( ألا وإني نهيت أن أقرأ القرآن راكعا أو ساجدا فأما الركوع فعظموا فيه الرب عز وجل وأما السجود فاجتهدوا في الدعاء فقمن أن يستجاب لكم) رواه مسلم.     قمن: أي حقيق وجدير
وفي رواية : ( أقرب ما يكون العبد من ربه وهو ساجد، فأكثروا الدعاء ) رواه مسلم ، ففي هذين الحديثين: استحباب تعظيم الله في الركوع ، وكثرة الدعاء في السجود، واستحباب كثرة الدعاء في السجود ، ولأنه من مواطن الإجابة.

والأمر بإكثار الدعاء في السجود يشمل الحث على تكثير الطلب لكل حاجة كما جاء في حديث أنس ( ليسأل أحدكم ربه حاجته كلها حتى شسع نعله ) رواه الترمذي، ويشمل التكرار للسؤال الواحد.

والاستجابة تشمل استجابة الداعي بإعطاء سؤله، واستجابة المثني بتعظيم ثوابه. - كما قال الحافظ ابن حجر في فتح الباري-.

وإذا كان السجود بهذا المقام وهذه الخصوصية فحري بالمسلم أن يطيل السجود ولا ينقره نقر الديك، فيجمع بين التسبيح والثناء على الله، وبين الدعاء، فيكثر منه ويسأل ربه الكريم المنان، الذي لا يرد من سأله."""),
    SonnModel(
        title: 'خيركم أحسنكم قضاء',
        description:
            """حث الإسلام الإنسان أن يعين غيره ممن يتعرضون لمشكلات وأزمات في حياتهم فيما يُعرف بالتكافل، فليس من الطبيعي أن يستطيع شخص تقديم المساعدة للآخرين ثم يتأخرعنها، مما يشي بانعدام الإحساس بآلام الناس.

وهذا التكافل يتجلى في أبلغ صوره في قول النبي صلى الله عليه وسلم : ( مثل المؤمنين في توادهم وتراحُمِهم وتعاطفهم، مَثل الجسد، إذا اشتكى منه عضو، تداعى له سائر الجسد بالسهر والحمى) رواه مسلم.

ومن هذا التكافل القرض الحسن، وهو أمر مشروع داخل في مضمون التعاون على البِرِّ، بل مندوب إليه ومرغّب فيه، وفي الجانب الآخر حث الإسلام المدين على أداء الدين وترغيبه في أن ينوي الوفاء: قال عليه الصلاة والسلام: ( من أخذ أموال الناس يريد أداءها أدى الله عنه، ومن أخذ يريد إتلافها أتلفه الله ) رواه البخاري، وأما المدين الذي لا يبالي بعاقبة أمره ولا يهتم بطريقة الخلاص من دينه، فقال النبي صلى الله عليه وسلم: ( أيما رجل يدين دينا وهو مجمع أن لا يوفيه إياه لقي الله سارقا) رواه ابن ماجه وحسنه الالباني.
 
وفي حسن القضاء واحتمال الكلام الخشن من صاحب الدين، سنَّ لنا النبي صلى الله عليه وسلم أن نحسن إليه في القضاء بأن نوفيه أكثر من دينه، فعن أبي هريرة رضي الله عنه: ( أنَّ رجلاً أتى النَّبيَّ صلَّى الله عليه وسلَّم يتقاضاه؛ فأغلظ له، فهمَّ به أصحابه؛ فقال رسول الله صلَّى الله عليه وسلَّم: دعوه، فإنَّ لصاحب الحقِّ مقالاً، ثمَّ قال: أعطوه سناً مثل سنِّه، قالوا: يا رسول الله! لا نجد إلا أمثل من سنِّه، قال: أعطوه، فإنَّ خيركم أحسنكم قضاءً) متفق عليه.
 
يتقاضاه: يطلب منه قضاء الدين.
أغلظ: شدد في المطالبة. 
سنا مثل سنه: أي بعيرا له سن مثل سن بعيره.
لا نجد إلا أمثل: أي إلا أحسن في المثلية.
 
المعنى العام :
جاء أعرابي إلى رسول الله صلى الله عليه وسلم يطالبه برد ما استقرضه منه. طالب فأغلظ في المطالبة. وتكلم فعنف في الكلام، فغضب الصحابة من هذا التهجم خصوصا أنه ليس له ما يبرره، إذ لم يسبق لهذا الأعرابي أن طالب، ولم يبد من الرسول صلى الله عليه وسلم فور المطالبة ممانعة أو مماطلة، فهموا بإيذائه وأرادوا أن يتناولوه بالسوء، ولكن الرسول صلى الله عليه وسلم أمرهم أن يتركوه، لأنه صاحب حق - حتى وإن أساء-، ثم أمرهم أن يعطوه بعيرا مثل بعيره الذي اقترضه منه، فلم يجد الصحابة عندهم في إبل الصدقة بعيرا في سن بعيره، فقالوا: لم نجد يا رسول الله إلا أحسن من بعيره سنا، قال لهم: أعطوه، فإن خيركم في المعاملة أحسنكم في القضاء، فلما أخذ الرجل البعير، نظر إلى الرسول صلى الله عليه وسلم نظرة سرور وإعجاب وشكر، وقال: أوفيتني أوفى الله بك كما في بعض الفاظ الحديث.
 
حسن القضاء ليس من الربا :
الواجب على المقترِض ردُّ القرض بدون زيادة عليه، وذلك لأنَّ اشتراط الزيادة في السلف ربا بالإجماع، قلت الزياة أم كثرت، ويجوز أن يرد أفضل ممّا يستلف إذا لم يشترط ذلك عليه، كما فعل النبي صلى الله عليه وسلم وكما قال، وهو من مكارم الأخلاق، قال الامام النووي رحمه الله: ويستحب لمن عليه دين من قرض وغيره أن يرد أجود من الذي عليه وهذا من السنة ومكارم الأخلاق وليس هو من قرض جر منفعة فإنه منهي عنه لأن المنهي عنه ما كان مشروطا في عقد القرض ومذهبنا أنه يستحب الزيادة في الأداء عما عليه ويجوز للمقرض أخذها سواء زاد في الصفة أو في العدد بأن أقرضه عشرة فأعطاه أحد عشر.
 
ومن فوائد هذا الحديث: 
ـ جواز المطالبة بالدين إذا حل أجله.
حسن خلق النبي صلى الله عليه وسلم وعظم حلمه وتواضعه وإنصافه. 
ـ القرض يكون من النقود ومن الأطعمة وكل ما له مثل، كما يكون من الحيوانات، على رأي الجمهور، فقد استقرض رسول الله صلّى الله عليه وسلم جملاً، وأعطى صاحبه أحسن منه، كما رواه مسلم. 
ـوجواز الوفاء بما هو أفضل من المثل المقترض، إذا لم يكن ذلك مشروطا في العقد، وهذا الخلق من السنن المهجورة عند غالب الناس عندما يقترضون من غيرهم ومن يردون دينهم."""),
    SonnModel(
        title: 'إخبار المرء أخاه بأنه يحبه في الله',
        description:
            """حث النبي صلَّى الله عليه وسلم المسلمين على التآخي والتوادد والتحابب بينهم، مما يجعلهم كالجسد الواحد، إذا اشتكى منه عضو تداعى له سائر الجسد بالحمَّى والسهر، وأرشدهم إلى ما يقوي هذه المحبة والمودة ويديمها، ومنها أنه من أحب أخا له في الله أن يخبره بذلك، وهي من السنن التي تكاد تكون مهجورة بين المسلمين، وفي ذلك يقول النبي صلى الله عليه وسلم كما في حديث المقدامِ بن معد يكرب رضي الله عنه عن النَّبي صلى الله عليه وسلم قال : ( إذا أحب الرجل أخاه فليخْبره أَنه يحِبه )رواه أبو داود، وفي رواية عند الترمذي ( فليُعْلِمْه).

وجاء ما يفيد على تأكيد هذا الأمر، أي أن المرء إذا أحب أخا له في الله أن يخبره بذلك، ولو كلفه ذلك أن يأتيه إلى بيته، فعن أنس بن مالك رضي الله عنه قال : (كنت جالسا عند رسول الله صلى الله عليه وسلم، إذ مر رجل فقال رجل من القوم: يا رسول الله! إني لأحب هذا الرجل، قال: هل أعلمته ذلك، قال: لا، فقال: قم فاعلمه، قال: فقام إليه، فقال: يا هذا والله إني لأحبك في الله، قال: أحبك الذي أحببتني له) رواه أحمد وابن حبان.

 
والسر في أن إعلام المسلم أخاه بأنه يحبه في الله هو أنه سبب في الألفة والمحبة، لما روى علي بن الحسين مرفوعا إلى النبي صلى الله عليه وسلم أنه قال: ( إذا أحب أحدكم أخاه في الله فليبين له، فإنه خير في الألفة و أبقى في المودة ) رواه وكيع في الزهد وحسنه الالباني.
 ويستحب لمن قيل له ذلك أن يرد عليه بقوله: أحبك الذي أحببتني فيه.
 
ومن فوائد هذا الاعلام والاخبار، أنه أبقى للألفة وأثبت للمودة، وبه يتزايد الحب ويتضاعف، وتجتمع الكلمة وينتظم الشمل بين المسلمين، وتزول المفاسد والضغائن، وهذا من محاسن الشريعة."""),
    SonnModel(
        title: 'دعاء صلاة الاستخارة',
        description:
            """إذا كان الله متصفا بالعلم الشامل والقدرة التامة والعبد متصف بالجهل والعجز فهذا يجعل العبد دائم الحاجة لربه ليرشده ويلهمه الصواب في أموره كلها، وهذا ما يرشد إليه دعاء الاستخارة، فهو يقوم على هذين الأساسين الاعتراف بالجهل والعجز، والتوسل إلى الله بتمام العلم ونفاذ القدرة.

في الصحيحين عن جابر قال: كان النبي صلى الله عليه وسلم يعلمنا الاستخارة في الأمور كلها كما يعلمنا السورة من القرآن، يقول: " إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة، ثم ليقل: اللهم إني أستخيرك بعلمك، واستقدرك بقدرتك، وأسألك من فضلك العظيم، فإنك تقدر ولا أقدر، وتعلم ولا أعلم، وأنت علام الغيوب.

اللهم إن كنت تعلم أن الأمر خير لي في ديني ومعاشي وعاقبة أمري - أو قال: في عاجل أمري وآجله، فاقدره لي، ويسره لي، ثم بارك لي فيه، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري أو قال في عاجل أمري وآجله، فاصرفه عني، واصرفني عنه، واقدر لي الخير حيث كان، ثم رضني به". قال: " ويسمي حاجته ".

معنى الاستخارة:

هي طلب العبد من الله أن يختار له الخير والأصلح من الأمرين، الفعل أو الترك، الإقدام أو الإحجام، متوسلا إلى الله بعلمه وقدرته، مع إظهار ضعف نفسه وعجزه وجهله.

ركن الاستخارة:

يقوم دعاء الاستخارة على أفعال وأقوال، منها الصلاة والدعاء، ولكن له أسسا إيمانية عميقة، وأهمها التفويض التام لله تعالى في تدبير الأمر، وهداية القلب لما فيه صلاح الدين والدنيا، مع ما يصاحبه من تمام التوكل على الله، المتضمن للثقة به، وحسن الظن بتقديره، وتسليم الأمر له، وهذا ظاهر من خلال ما يقوله العبد في دعائه (إن كنت تعلم...) فهو يضع الاحتمالين على حد السواء، داعيا الله أن يختار له، لأنه يعلم الأمور وخفاياها وخباياها، ويعلم ظاهرها وباطنها، ومبدأها ومنتهاها، والعبد لا يعلم ولا يقدر فهو يستخير الله ويستقدره بمعنى يطلب منه أن يقدره على الخير.

أثر الاستخارة

الغاية التي يؤديها دعاء الاستخارة هي حصول الرضا والطمأنينة لأقدار الله، بحيث يصل العبد إلى مرحلة استواء الأمر عنده، سواء الفعل أو الترك، وسواء الحصول بالمرغوب أو فواته وعدم تحصيله، كما قال تعالى (لِكَيْلَا تَأْسَوْا عَلَى مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ) سورة الحديد (23)، وهذا واضح من ختامية الدعاء بالاحتمالين، ففي نهاية كل واحد يقول (ثم أرضني به)، وأنعم بها من ثمرة، ومن رزق الرضا عن الله وأقداره فقد ولج بوابة السعادة العظمى.

أخطاء تتنافى مع مضامين الدعاء:

مما يقع فيه البعض في موضوع الاستخارة التناقض مع مبدأ الاستخارة، فهو يدعو بتيسير الخير، مسبقا الاعتقاد بأن أحد الأمرين هو الخير والمصلحة والمنفعة، فيتعلق قلبه بالظفر به، متناسيا أن مقام الاستخارة يتناقض مع هذا الاعتقاد المسبق، بل يقتضي منه اطراح الرغبات والميول النفسية، وتفويض الأمر لله تعالى.

وبالتالي فإن هذا الداعي والحال كما ذكرت إذا لم يحصل له ما يظنه خيرا تسخط وحصل له الحزن والحسرة والاضطراب، وهذا الخطأ مبني على سابقه، فلو تحقق قلبه من الاستخارة التي تقوم على التسليم والتفويض لما حصل له هذا الاضطراب والحزن، فهذا يدل على خلل في معنى الاستخارة لديه.

ومن الأخطاء انتظار البعض أن تأتيه رؤيا ترشده لنتيجة الاستخارة، وتوجهه لأحد الاحتمالات، وذلك ليس بلازم، بل غاية ما يلزمه أن يستخير الله تعالى، ثم استشارة أهل الخبرة في الأمر الذي تردد فيه، مع ما يصاحب ذلك من جمع المعلومات المتعلقة بذلك الأمر، ثم يترجح الأمر لديه بحسب المعطيات الواقعية، ولا شك أن ما تتيسر أسبابه، ويتهيأ له فعله هو نتيجة الاستخارة، فيكون راضيا بما يسر الله له من الفعل أو الترك، فلا يلزم أن تأتيه رؤيا تقول له افعل أو لا تفعل.
وقد قال الحكماء: الناس ثلاثة: رجل، ونصف رجل، ومن ليس بشيء، فأما الرجل فمن له رأي ويستشير غيره، ونصف الرجل من له رأي ولكنه لا يستشير، وأما الثالث فلا رأي ولا استشارة.

من المضامين التي يرشد إليها دعاء الاستخارة:

أولوية صلاح أمر العبد في دينه قبل كل شيء، فأول معايير الاستخارة (في ديني)، فما كان خيرا للدين فهو خير للدنيا، وما كان شرا على الدين فهو شر على الدنيا والآخرة، وهذا توجيه لاهتمامات العبد، بحيث يكون الدين هو أول ما يخاف عليه من النقص، وأن يكون صلاح دينه هو المنطلق الذي يبدأ منه، ثم يأتي بعد ذلك أمور المعاش والمنافع الدنيوية.

وكذلك التقديم بين يدي الدعاء بالصلاة من غير الفريضة فيه إشارة إلى أن الدعاء الأكمل الذي يسبقه عمل صالح، بحيث يكون وسيلة لقبوله، كما أن الدعاء الأكمل يبدأ بالثناء على الله والصلاة والسلام على النبي صلى الله عليه وسلم، ولذلك ذكر الإمام النووي في كتاب الأذكار أنه يسن التقديم بين يدي دعاء الاستخارة بالثناء على الله والصلاة على النبي كسائر الأدعية.

وفي قوله (إذا هم أحدكم بالأمر) دون تحديد رتبة هذا الأمر فيه إشارة إلى أن مشروعية صلاة الاستخارة في كل أمور العبد، وهذا يجعل الارتباط بين العبد وبين ربه وثيقا وقويا، فكل ما هم بعمل وحصل عنده احتمال بمصالح ومفاسده فزع إلى الصلاة ودعاء الاستخارة،  وهذه الأمور التي يستخير فيها عامة سواء كانت مباحة أو مشروعة، ووجه الاستخارة في الأمور المشروعة في فعله هو، وليس في أصلها وذاتها، فهي خير ولا شك، ولكنه قد يستخير في تقديم بعضها على بعض، أو في توقيتها، أو في وسائلها وأدواتها، كالذي يريد الحج قد يستخير في تقديمه أو تأخيره أو في وسيلة الذهاب إليه، وقد يكون مريضا ويخشى من تطاول مرضه فيستخير في ذلك كله.

ثم هو في كل نجاحاته يعلق الأمر بالله تعالى، ويجعل الفضل له وحده، بخلاف من لا يستخير الله تعالى، فيحصل عنده غرور واستبداد، وربما نسب الفضل لذاته، وقدراته، ومؤهلاته، وهذا من الأبعاد التي شرعت صلاة الاستخارة لتنقية قلب المسلم منها، فالاستخارة تعلم العبد أنه لا يختار ولا يدبر ولا يتصرف إلا بتقدير الله وتدبيره.

وأخيرا فإن أساس هذا الأمر أن يعلم العبد ويوقن أن الله يعلم الغايات التي يطلبها العبد، ويعلم الوسائل الموصلة له إليها، أما العبد فهو يجهل ذلك، فقد يظن سعادته في أمر ما فهو يسعى له سعيا حثيثا، ويعلم الله أن سعادته في غيره، فييسر ما يعلمه موصلا له إلى سعادته قطعا، فقد يكون الفقر موصلا له إلى غاية السعادة، وقد يكون المرض الذي يعجزه عن الفجور هو سعادته، وقد يكون منعه من مرغوباته هو عين سعادته، وهذا علم ببواطن الأمور وعواقبها والعبد لا يحسنه بعلمه المحدود، فإذا كان ذلك كذلك فلا غنى للعبد عن الاستخارة في كل أموره."""),
    SonnModel(
        title: 'الذكر والتكبير في عشر ذي الحجة',
        description:
            """لا شك أن جميع الأعمال الصالحة مطلوبةٌ ومرغّبٌ فيها في الأيام العشر الأولى من ذي الحجة؛ إلا أن الذكر له أهمية خاصة، فعن عبد الله بن عباس رضي الله عنهما قال: "وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْلُومَاتٍ: أَيَّامُ العَشْرِ، وَالأَيَّامُ المَعْدُودَاتُ: أَيَّامُ التَّشْرِيقِ" رواه البخاري في صحيحه، ثم ذكر رواية معلقة: "كان ابن عمر وأبو هريرة رضي الله عنهما يخرجان إلى السُّوقِ في أَيام العشْر يُكَبِّرَانِ، وَيُكَبِّرُ الناس بِتَكْبِيرِهِمَا، وكَبَّر محمد بن علي خَلْفَ النَّافِلَةِ".

وقد ورد ذكر الأيام المعلومات في قول الله تعالى في سورة الحج: {وَيَذْكُرُوا اسْمَ اللَّهِ فِي أَيَّامٍ مَعْلُومَاتٍ} (الحج: 28)، وفسّرها عبد الله بن عباس رضي الله عنهما بأنها الأيام العشر الأولى من شهر ذي الحجة، وفسَّر الأيام المعدودات الواردة في قول الله تعالى في سورة البقرة: {وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ مَعْدُودَاتٍ} (البقرة: 203) بأنها أيام التشريق - الحادي عشر والثاني عشر والثالث عشر من شهر ذي الحجة -، وكان العمل الأساسي الذي طلبه الله عز وجل من عباده في هذه الأيام - المعلومات والمعدودات - هو الذِّكْر.

وفي تطبيق عملي لهذا التفسير يذكر الإمام البخاري بصيغة معلقة: أن الصحابيين الجليلين عبد الله بن عمر وأبا هريرة رضي الله عنهما كانا يخرجان إلى السوق فيُكَبِّران، وَيُكَبِّرُ النَّاسُ بِتَكْبِيرِهِمَا، فاختارا التكبير تحديدًا ليَحُثَّا الناس عليه في هذه الأيام الفاضلة، ولم يفعلا ذلك إلا لعلمهما أن الرسول صلى الله عليه وسلم كان يفعل ذلك.

فصار التكبير سُنَّة نبوية مهمَّة في العشر الأولى من ذي الحجة، وإن كان ذِكْر الله بشكل عامٍّ أمرًا مطلوبًا في هذا التوقيت لعموم الآيات التي ذكرناها، وقد وردت رواية صحيحة تُوَسِّع دائرة أنواع الذكر في الأيام العشر؛ فعن عبد الله بن عمر رضي الله عنهما عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: (مَا مِنْ أَيَّامٍ أَعْظَمُ عِنْدَ اللهِ وَلاَ أَحَبُّ إِلَيْهِ الْعَمَلُ فِيهِنَّ مِنْ هَذِهِ الأَيَّامِ الْعَشْرِ، فَأَكْثِرُوا فِيهِنَّ مِنَ التَّهْلِيلِ وَالتَّكْبِيرِ وَالتَّحْمِيدِ) رواه أحمد بإسناد صحيح.

وأما صيغ التكبير فلم يثبت عن النبي صلى الله عليه وسلم صيغة معينة فيها، وإنما ثبت عن صحابته رضوان الله عليهم عدة صيغ منها:

الأولى: قول: (اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ كَبيراً)، وهذه الصيغة ثابتة عن سلمان الفارسي رضي الله عنه، أخرجها البيهقي في السنن الكبرى وصحح الحافظ ابن حجر سندها.

الثانية: قول: (اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، لاَ إِلَهَ إِلاَّ اللَّهُ، واللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، وللَّهِ الحمدُ)، وهذه الصيغة ثابتة عن ابن مسعود رضي الله عنه، أخرجها ابن أبي شيبة في مصنفه.

الثالثة: قول: (اللَّهُ أَكْبَرُ كَبيراً، اللَّهُ أَكْبَرُ كَبيراً، اللَّهُ أَكْبَرُ وأجَلُ، اللَّهُ أَكْبَرُ، وللَّهِ الحمدُ)، وهذه الصيغة ثابتة عن ابن عباس رضي الله عنهما، أخرجها ابن أبي شيبة في مصنفه.

فلنحرص على إحياء هذه السُّنَّة المباركة، بتطبيقها وحث الناس عليها، حتى ننال أجر الذكر والتكبير، وأجر إحياء سنة من سنن المصطفى صلى الله عليه وسلم."""),
    SonnModel(
        title: 'إحياء السنن المهجورة',
        description:
            """يُقصد بإحياء السنن: تذكير الناس بما كان يفعله النبي صلى الله عليه وسلم، وما شرعه لأمته، في زمن ترك الناس العمل بأغلب ما ورد عنه صلى الله عليه وسلم.

ويدخل في نطاق الإحياء أيضا: العمل بالسنن، والعلم بها، وتعليمها للناس ونشرها بينهم قولا وفعلا، والحث على التمسك بها، والتحذير من مخالفتها، جاء في فيض القدير: "من أحيا سنة: أي علمها، وعمل بها ونشرها بين الناس، وحث على متابعتها وحذر من مخالفتها".

وقد ورد في السنة النبوية ما يدل على حصول الأجر العظيم لمن أحيا السنن ونشرها، ومن ذلك ما رواه الإمام الترمذي وحسنه أن النبي صلى الله عليه وسلم قال لبلال بن الحارث رضي الله عنه: (من أحيا سنة من سنتي قد أميتت بعدي، فإن له من الأجر مثل من عمل بها، من غير أن ينقص من أجورهم شيئا، ومن ابتدع بدعة ضلالة لا ترضي الله ورسوله، كان عليه مثل آثام من عمل بها، لا ينقص ذلك من أوزار الناس شيئا).

وعند الإمام ابن ماجه بإسناد صحيح أن رسول الله صلى الله عليه وسلم قال: (من أحيا سنة من سنتي فعمل بها الناس كان له مثل أجر من عمل بها لا ينقص من أجورهم شيئا، ومن ابتدع بدعة فعمل بها كان عليه أوزار من عمل بها لا ينقص من أوزار من عمل بها شيئا).

قال الإمام ابن عبد البر في التمهيد: "حديث هذا الباب أبلغ شيء في فضائل تعليم العلم اليوم، والدعاء إليه وإلى جميع سبل البر والخير؛ لأن الميت منها كثير جدا، ومثل هذا الحديث في المعنى قوله صلى الله عليه وسلم: (ينقطع عمل المرء بعده إلا من ثلاث: علم علمه فعُمِلَ به بعده، وصدقة موقوفة يجري عليه أجرها وولد صالح يدعو له)".

ويشهد لذلك أيضا ما أخرجه الإمام مسلم في صحيحه من حديث أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من دعا إلى هدى كان له من الأجر مثل أجور من اتبعه، لا ينقص ذلك من أجورهم شيئا، ومن دعا إلى ضلالة فعليه من الإثم مثل آثام من اتبعه، لا ينقص ذلك من آثامهم شيئا).

ولذا فإننا نقصد من خلال هذا المحور: نشر جملة من السنن والفضائل والآداب التي هجرها عامة الناس، وصارت غير معروفة ومألوفة بينهم، حتى ننال أجر إحياء سنن النبي المصطفى صلى الله عليه وسلم، وندخل في عِداد الداعين إلى الهدى والخير، واللهَ نسأل أن يوفقنا لصالح القول والعمل."""),
    SonnModel(
        title: 'دعاء رؤية الهلال',
        description:
            """عن طلحة بن عبيد الله رضي الله عنه قال: كان النبي صلى الله عليه وسلم إِذا رأى الهِلالَ قال: (اللَّهُمَّ أهلّهُ عَلَيْنَا بِاليُمْنِ وَالإِيمَانِ، وَالسَّلاَمَةِ وَالإِسْلاَمِ، رَبِّي وَرَبُّكَ اللَّهُ) رواه الترمذي وحسنه، وعند الدارمي بلفظ: (اللَّهُ أكْبَرُ، اللَّهُمَّ أهِلَّهُ عَلَيْنَا بِالأَمْنِ والإيمَانِ، والسَّلامَةِ والإسْلاَمِ، والتَّوْفِيقِ لِمَا يُحبُّ ربُّنا ويَرْضَى، رَبُّنَا وَرَبُّكَ اللَّهُ).

وَإِنْ مِنْ شَيْءٍ إِلاَّ يُسَبِّحُ بِحَمْدِهِ

ذكر الله عز وجل في كتابه الكريم أن كل المخلوقات تعبده، وتُسَبِّح بحمده؛ قال تعالى: {وَإِنْ مِنْ شَيْءٍ إِلاَّ يُسَبِّحُ بِحَمْدِهِ وَلَكِنْ لاَ تَفْقَهُونَ تَسْبِيحَهُمْ} (الإسراء: 44)؛ ولذا كان رسول الله صلى الله عليه وسلم يستشعر ذلك جيدًا؛ ومن ثَمَّ نجده في بعض الأحاديث يُخاطب هذه المخلوقات غير العاقلة، ويخبرها أنه - صلى الله عليه وسلم - والمؤمنون يعبدون الله عز وجل معها، وكان من هذه المخاطبة ما يفعله مع الهلال في أول كل شهر هجري (قمري)، كما في الحديث الذي معنا.

قوله: (أهلَّه) أي: أطلعه علينا، وأرنا إياه؛ والمعنى: اجعل رؤيتنا له مقترناً بالأمن والإيمان.

قوله: (بالأمن) أي: مقترناً بالأمن من الآفات والمصائب.

قوله: (والإيمان) أي: بثبات الإيمان فيه.

قوله: (والسلامة) أي: السلامة عن آفات الدنيا والدين.

قوله: (ربي وربك الله) خطاب للهلال الذي استهل، وهذه إشارة إلى تنزيه الخالق أن يشاركه شيء فيما خلق.

فكان صلى الله عليه وسلم يُردِّد هذا الدعاء اثنتي عشرة مرَّة في السنة، وكأنه يستفتح كل شهر بطلب البركة فيه، والثبات على الدين، وهو في الوقت نفسه يحثُّ المسلم على رصد الهلال وملاحظته؛ لأن هناك عبادات مرتبطة بمعرفة أول الشهر؛ كصيام الأيام البيض أو صيام عاشوراء أو غير ذلك.

الوعي ببداية الأشهر الهجرية

ينبغي للمسلم أن يكون واعيًا ببداية الأشهر، حتى يفوز بأجر هذا الدعاء العظيم، وأجر اتباع السُّنَّة، بالإضافة إلى تحقُّق البركة والسلامة، والثبات على الإسلام والإيمان، فما أروعها من سُنَّة!

فلنحرص على إحياء هذه السُّنَّة المباركة، بتطبيقها وحث الناس عليها، حتى ننال أجر إحياء سنة من سنن المصطفى صلى الله عليه وسلم."""),
    SonnModel(
        title: 'التسبيح والحمد كل يوم',
        description:
            """عن سعد بن أبي وقاص رضي الله عنه قال: كنا عند رسول الله صلى الله عليه وسلم فقال: (أيعجزُ أحدكم أن يكسب كل يوم ألف حسنة؟ فسأله سائل من جلسائه: كيف يكسب أحدنا ألف حسنة؟ قال: يسبح مائة تسبيحة، فيكتب له ألف حسنة، أو يُحط عنه ألف خطيئة) رواه مسلم في صحيحه.

وعن أبي هريرة عبد الرحمن بن صخر الدوسي رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (مَنْ قَالَ: حِينَ يُصْبِحُ وَحِينَ يُمْسِي: سُبْحَانَ اللهِ وَبِحَمْدِهِ. مِائَةَ مَرَّةٍ، لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ، إِلاَّ أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ) رواه مسلم في صحيحه.

كم نستغرق وقتا لكسب ألف ريال مثلا؟ قطعا سيزيد ذلك عن ثلاث دقائق، ولكن كسب ألف حسنة قد يكلفنا ثلاث دقائق فقط.

عندما تنظر إلى رقم (مائة مرة) قد تشعر أنه رقم كبير، وأنَّ ذِكْر الله تعالى بنوع معين من الأذكار مائة مرَّة في اليوم سيستغرق زمنًا طويلاً؛ ومن ثَمَّ قد تكسل عن مثل هذه العبادات التي تحتاج إحصاءً لعددٍ كبير من الأذكار؛ ولكنَّ الواقع العملي ليس كذلك؛ فقول: (سُبْحَانَ اللهِ وَبِحَمْدِهِ) أو (سُبْحَانَ اللهِ) في كل يوم مائة مرَّة لن يستغرق في المعتاد أكثر من ثلاث دقائق فقط، في زمن نقضي فيه أوقاتا طويلة في الانتظار، بخلاف ما يتم إهداره من الأوقات في غير فائدة.

ولعلَّ الذي يُشَجِّعنا على المداومة على ذلك أن نعرف أجر هذا العمل اليسير، فقد روى البخاري عن أبي هريرة رضي الله عنه أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ: (مَنْ قَالَ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ. فِي يَوْمٍ مِائَةَ مَرَّةٍ، حُطَّتْ خَطَايَاهُ، وَإِنْ كَانَتْ مِثْلَ زَبَدِ البَحْرِ)، فهذه مغفرة شاملة لذنوب هائلة.

وإذا أردتَ الخير الأكبر فلتقُلْ هذا الذِّكْر مائة مرَّة في الصباح ومثلها في المساء؛ لتُحَقق النجاح الذي يفوق نجاح كل البشر، وهو أنه لن يأتي أحد يوم القيامة بأفضل مما جئت به إلا أَحَدٌ قال مثل ذلك أو زاد عليه؛ لأن العملة يوم القيامة والحساب هي: الحسنات والسيئات، وليست الدراهم والدنانير.

فلنحرص على إحياء هذه السُّنَّة المباركة، بتطبيقها وحث الناس عليها، حتى ننال ما يترتب عليها من فضائل عظيمة، وحتى ننال أجر إحياء سنة من سنن المصطفى صلوات ربي وسلامه عليه."""),
    SonnModel(
        title: 'دعاء الخروج من المنزل',
        description:
            """عن أمِّ سلمة رضي الله عنها قالت: ما خرج النبي صلى الله عليه وسلم من بيتي قطُّ إلا رفع طَرْفَهُ إلى السماء فقال: (اللَّهُمَّ أَعُوذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ)، وفي حديث أنس بن مالك رضي الله عنه أن النبي صلى الله عليه وسلم قال: (إِذَا خَرَجَ الرَّجُلُ مِنْ بَيْتِهِ فَقَالَ: بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، ولاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ. قَالَ: يُقَالُ حِينَئِذٍ: هُدِيتَ، وَكُفِيتَ، وَوُقِيتَ، فَتَتَنَحَّى لَهُ الشَّيَاطِينُ، فَيَقُولُ لَهُ شَيْطَانٌ آخَرُ: كَيْفَ لَكَ بِرَجُلٍ قَدْ هُدِيَ وَكُفِيَ وَوُقِيَ؟) رواهما أبو داود في سننه، وصححهما الألباني.

يخرج المسلم كلَّ يوم من بيته للقيام بما يتعلق به من أعمال ومسئوليات؛ تتعلق بعضها بالمعاش والكسب وحاجات البيت ومتطلَّباته، وأخرى بواجباته تجاه رحمه وجيرانه وأصدقائه، وثالثة بالمجتمع الذي يعيش فيه، وفي كلِّ خروجٍ له من المنزل يكون مُعَرَّضًا للتعامل مع طوائف مختلفة من الناس؛ لهذا كان من سُنَّة رسول الله صلى الله عليه وسلم أن يقف مع نفسه وقفة قبل أن يخرج من بيته، يسأل اللهَ فيها أن يُيَسِّر له هذه التعاملات، فلا يَضرُّ أحدًا، ولا يتعرَّض للضرر من أحدٍ، ولا يظلم أحدًا، ولا يتعرَّض للظلم من أحدٍ، وهكذا.

إنها وقفة جميلة تشرح الصدر قبل أن يُقدِم المسلم على تعاملاته مع الناس، وهي سُنَّة كريمة من سنن نبينا صلى الله عليه وسلم، نقلتها لنا أم المؤمنين أم سلمة رضي الله عنها وأرضاها، حيث قالت: "ما خرج النبي صلى الله عليه وسلم من بيتي قطُّ إلا رفع طَرْفَهُ إلى السماء فقال:.."، فقد كان رسول الله صلى الله عليه وسلم يحافظ على قول هذا الدعاء ولم يتركه قطُّ، وفي هذا دليل على أهميته وفضله.

فإذا أُضِيف إلى ذلك فائدة ومزِيّة أخرى وهي: "الوقاية من الشيطان" - كما في رواية أنس بن مالك رضي الله عنه -، فقد تحققت المحاسن والفضائل كلها، ولهذا فإن الأخذ بالروايتين معا يجمع الخير والتوفيق للعبد في جميع أعماله خلال يومه وليلته، بفضل الله تعالى ومنّه وكرمه.

فحافظ على أن تقول كلما خرجت من بيتك: (بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، ولاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ .. اللَّهُمَّ أَعُوذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ).

هكذا عرفنا هديه صلى الله عليه وسلم عند خروجه من منزله، وهكذا ينبغي لنا أن نفعل، فنحفظ أنفسَنا من شرور الإنس والجن، ونحفظ غيرَنا من شرورنا.

فلنحرص على إحياء هذه السُّنَّة المباركة، بتطبيقها وحث الناس عليها، حتى ننال ما يترتب عليها من فضائل، وننال أجر إحياء سنة من سنن المصطفى صلى الله عليه وسلم."""),
    SonnModel(
        title: 'معاونة الأهل في المنزل',
        description:
            """عن الأسود بن يزيد رضي الله عنه - وكان من كبار التابعين - قال: سألت عائشة رضي الله عنها: "مَا كَانَ النَّبِيُّ صلى الله عليه وسلم يَصْنَعُ فِي بَيْتِهِ؟ قالت: كَانَ يَكُونُ فِي مِهْنَةِ أَهْلِهِ - تعني خدمة أهله - فَإِذَا حَضَرَتِ الصَّلاَةُ خَرَجَ إِلَى الصَّلاَةِ"، وفي رواية: "فإذا سمع الأذان خرج" رواه البخاري في صحيحه.

عندما تقرأ هذا الأثر يتبادر إلى الذهن سؤال وجيه: وهل كانت أمُّنا عائشة رضي الله عنها تشكو كثرة العمل ومشقته حتى يعينها النبي صلى الله عليه وسلم ويخدمها؟

أما كانت حجرتها متقاربة الجدر، صغيرة المساحة، بحيث لم يتجاوز طولها عشرة أذرع، وعرضها سبعة أذرع (خمسة أمتار* ثلاثة أمتار ونصف)، وأمّا العمل فقد كانت تقضي الشهران بتمامها ولا يوقد في بيتها نار لطعام يُصنع -كما ذكرَت ذلك-، فهل ثمّة عمل كبير يحتاج إلى جهد؟ فضلا عن أن يحتاج إلى معونة بحيث يكون النبي صلى الله عليه وسلم في بيته مشغولاً بمهنة أهله؟

إن الجواب عن هذا التساؤل يتلخص في أن نبيك صلى الله عليه وسلم ما كان يصنع ما يصنع لكثرة الشغل وجهد العمل، ولكن هناك معنىً أعمق، وهو المواساة والإشعار بالمشاركة التامة في الحياة الزوجية، وتحقيق أحد معاني السكن إلى الزوجة {لِتَسْكُنُوا إِلَيْهَا} (الروم: 21)، ولم يقل: لتسكنوا معها.

إن الأعمال اليسيرة في المنزل كترتيب الفِراش أو التخلُّص من القمامة أو مسح بعض الأتربة أو رعاية الأطفال، تصل إلى قلب الزوجة مشفوعة بمذكرة تفسيرية تضج بمعاني الحب والمودة والرحمة، وتشعر الزوجة بالدنو القريب إلى زوجها، والامتزاج الروحي والعاطفي، كون الرجل في مهنة أهله، وأي عمل وعلى أي صفة يكون رسالة حياة تقول لها: "هويتنا جميعا كما هي حياتنا جميعا"، وإن معاني الالتحام الزوجي تنسجها هذه اللمسات المعبرة، فيكبر في عين زوجته بقدر تواضعه، ويعظم في نفسها بقدر بساطته.

فما أجمل أن تشعر الزوجة أن زوجها لا يكتفي فقط بتقدير جهدها؛ إنما يُساعدها في أداء بعض أعمال المنزل، وما أجمل أن تشعر في كل ذلك بأنك تتَّبع رسول الله صلى الله عليه وسلم في سُنَّته وطريقته، وأنك تأخذ أجرًا كبيرًا من الله جل وعلا على هذه المساعدة."""),
    SonnModel(
        title: 'الوضوء قبل النوم',
        description:
            """عن البراء بن عازب رضي الله عنه قال: قال النبي صلى الله عليه وسلم: (إِذَا أَتَيْتَ مَضْجَعَكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ، ثُمَّ اضْطَجِعْ عَلَى شِقِّكَ الْأَيْمَنِ، ثُمَّ قُلْ: اللَّهُمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ، فَإِنْ مُتَّ مِنْ لَيْلَتِكَ فَأَنْتَ عَلَى الْفِطْرَةِ، وَاجْعَلْهُنَّ آخِرَ مَا تَتَكَلَّمُ بِهِ)، قال: فَرَددْتُهَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَلَمَّا بَلَغْتُ: اللَّهُمَّ آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، قُلْتُ: وَرَسُولِكَ، قَالَ: (لَا، وَنَبِيِّكَ الَّذِي أَرْسَلْتَ) متفق عليه.

يُعدُّ النوم موتة صغرى، ولا يدري المرء منا متى يحين أجله، يقول الله تعالى: {الله يَتَوَفَّى الْأَنْفُسَ حِينَ مَوْتِهَا وَالَّتِي لَمْ تَمُتْ فِي مَنَامِهَا فَيُمْسِكُ الَّتِي قَضَى عَلَيْهَا الْمَوْتَ وَيُرْسِلُ الْأُخْرَى إِلَى أَجَلٍ مُسَمًّى} (الزمر: 42)؛ قال الإمام القرطبي في المفهم: "النوم والموت يجمعهما انقطاع تعلق الروح بالبدن، وذلك قد يكون ظاهراً وهو النوم -ولذا قيل: النوم أخو الموت-، وباطنا وهو الموت، فإطلاق الموت على النوم يكون مجازاً، لاشتراكهما في انقطاع تعلق الروح بالبدن"؛ ولذا ينبغي أن نستعد لذلك بالوضوء قبل النوم.

وقد بوّب الإمام البخاري في صحيحه فقال: "بَاب فَضْلِ مَنْ بَاتَ عَلَى الْوُضُوءِ"، ثم ذكر حديث البراء الذي معنا، وقال الحافظ ابن حجر في فتح الباري: "النكتة في ختم البخاري كتاب الوضوء بهذا الحديث من جهة أنه آخر وضوء أُمِرَ به المُكَلَّفُ في اليقظة، ولقوله - صلى الله عليه وسلم - في نفس الحديث: (وَاجْعَلْهُنَّ آخَر مَا تَقُولُ)، فأشعر ذلك بختم الكتاب، والله الهادي للصَّوَاب"، وذَكر الحافظ فوائد الوضوء قبل النوم في موضع آخر فقال: "الأولى: أن يبيت على طهارة، لئلا يبغته الموت فيكون على هيئة كاملة، والثانية: أن ذلك أصدق لرؤياه، وأبعد من تلاعب الشيطان به".

ومن فضائل الوضوء قبل النوم أيضا: أن من بات طاهرًا بات معه ملك يستغفر له، روى الإمام ابن حبان وغيره مرفوعا: (من بات طاهرًا، بات في شعاره ملك، فلا يستيقظ إلا قال الملك: اللهم اغفر لعبدك فلان، فإنه بات طاهرًا) قال الشيخ الألباني في صحيح الترغيب والترهيب: حسن لغيره.

فلنحرص على إحياء هذه السُّنَّة المباركة، بتطبيقها وحث الناس عليها، حتى ننال أجرها وفضلها، وأجر إحياء سنة من سنن المصطفى صلى الله عليه وسلم."""),
    SonnModel(
        title: 'دعاء ركوب الدابة حضرًا وسفرًا',
        description:
            """عن علي بن ربيعة رضي الله عنه قال: شَهِدتُ عَلِيًّا رضي الله عنه أُتِيَ بِدَابَّةٍ لِيَرْكَبَهَا، فلما وضع رجله في الرِّكَاب قال: "بِسْمِ اللَّهِ" ثَلاَثًا، فَلَمَّا اسْتَوَى عَلَى ظَهْرِهَا، قَالَ: "الحَمْدُ لِلَّهِ". ثُمَّ قَالَ: "{سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ} (الزخرف:13-14)"، ثُمَّ قَالَ: "الحَمْدُ لِلَّهِ" ثَلاَثًا، "اللَّهُ أَكْبَرُ" ثَلاَثًا، "سُبْحَانَكَ إِنِّي قَدْ ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ"، ثُمَّ ضَحِكَ، فَقُلْتُ: مِنْ أَيِّ شَيْءٍ ضَحِكْتَ يَا أَمِيرَ المُؤْمِنِينَ؟ قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم صَنَعَ كَمَا صَنَعْتُ، ثُمَّ ضَحِكَ، فَقُلْتُ: مِنْ أَيِّ شَيْءٍ ضَحِكْتَ يَا رَسُولَ اللَّهِ؟ قَالَ: (إِنَّ رَبَّكَ لَيَعْجَـبُ مِنْ عَبْـدِهِ إِذَا قَالَ: رَبِّ اغْفِـرْ لِي ذُنُوبِي، إِنَّهُ لاَ يَغْفِـرُ الذُّنُوبَ غَيْرُكَ) رواه الترمذي وقال: حديث حسن صحيح، وصححه الألباني.

وعن عبد الله ابن عُمَرَ رضي الله عنهما أَنّ رَسُولَ اللّهِ صلى الله عليه وسلم كَانَ إِذَا اسْتَوَىَ عَلَىَ بَعِيرِهِ خَارِجاً إِلَىَ سَفَرٍ، كَبّرَ ثَلاَثاً، ثُمّ قَالَ: (سُبْحَـانَ الّذِي سَخّرَ لَنَا هَذَا وَمَا كُنّا لَهُ مُقْرِنِينَ * وَإِنّا إِلَىَ رَبّنَـا لَمُنْقَلِبُونَ، اللّهُمّ إِنّا نَسْأَلُكَ فِي سَفَرِنَـا هَذَا الْبِرّ وَالتّقْوَىَ، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللّهُمّ هَوّنْ عَلَيْنَا سَفَرَنَا هَذَا، وَاطْوِ عَنّـا بُعْدَهُ، اللّهُمّ أَنْتَ الصّاحِبُ فِي السّفَرِ، وَالْخَلِيفَةُ فِي الأَهْلِ، اللّهُمّ إِنّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُـوءِ الْمُنْقَلَبِ، فِي الْمَالِ وَالأَهْلِ)، وَإِذَا رَجَعَ قَالَهُنّ، وَزَادَ فِيهِنّ: (آيِبُـونَ، تَائِبُونَ، عَابِدُونَ، لِرَبّنَا حَـامِدُونَ) رواه مسلم في صحيحه.

يُعَلِّمنا رسول الله صلى الله عليه وسلم أن نذكر اللهَ تعالى في كل أحوالنا؛ ومن ذلك أنه كان يذكره عند ركوبه للدابَّة، سواء في ذلك الحَضَرُ والسفر، فحديث علي بن أبي طالب فيه ذكر دعاء ركوب الدابة في الحَضَر، وحديث عبد الله بن عمر فيه ذكر دعاء ركوب الدابة في السفر، وكلاهما يشتركان فيما ورد في الآية القرآنية في قوله تعالى: {سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ} (الزخرف:13-14)، مع اختصاص دعاء السفر بطلب التخفيف والتهوين مما يرافق السفر عادة من عناء ومشقة، واختصاص دعاء الحَضَر بطلب المغفرة من الله جل وعلا.

فما أسهل هذه السُّنَّة وأعظمها، وما أجمل أن نحافظ عليها عند ركوبنا للسيارات أو الحافلات، أو القطارات أو الطائرات، أو حتى المصاعد الكهربائية، أو غير ذلك من وسائل الانتقال.

فلنحرص على إحياء هذه السُّنَّة المباركة، بتطبيقها وتعليمها لأبنائنا، وحث الناس عليها، حتى يحفظنا الله تعالى في حِلِّنا وارتحالنا، وحتى ننال أجر إحياء سنة من سنن نبينا المصطفى صلى الله عليه وسلم."""),
    SonnModel(
        title: 'الاجتماع على الطعام',
        description:
            """عن وحشِيِّ بن حرب رضي الله عنه أن أصحَابَ النبي صلى الله عليه وسلم قالوا: يا رسول اللهِ، إِنَّا نَأْكُلُ وَلا نَشْبَعُ. قَالَ: (فَلَعَلَّكُمْ تَفْتَرِقُونَ؟) قَالُوا: نَعَمْ. قَالَ: (فَاجْتَمِعُوا عَلَى طَعَامِكُمْ، وَاذْكُرُوا اسْمَ اللهِ عَلَيْهِ، يُبَارَكْ لَكُمْ فِيهِ) رواه أبو داود وابن ماجه، وحسنه الألباني.

وعند الطبراني بلفظ: (كلوا جميعا ولا تفرقوا، فإن طعام الواحد يكفي الاثنين). قال ابن بطال في شرحه للحديث: "الاجتماع على الطعام من أسباب البركة".

كان رسول الله صلى الله عليه وسلم يحضُّ أصحابه على الاجتماع وعدم الفرقة بوسائل كثيرة، ويستغلُّ مناسبات مختلفة لتحقيق الوحدة بين المسلمين والترابط فيما بينهم؛ ومن تلك الوسائل التي حث عليها وأمر بها: الاجتماع على الطعام، كما في الحديث الذي معنا.

فالاجتماع على الطعام وتسمية الله قبل البدء فيه يحققان البركة - كما ذكر النبي صلى الله عليه وسلم -، وليست البركة في الطعام وأثره في الجسد فقط؛ وإنما البركة كذلك في تحسُّن العلاقات الاجتماعية، سواء كانت علاقات أُسرية أو أخوية ونحوهما، نتيجة تقابل الجميع على الطعام، وما يترتب عليه من تبسّط أثناء الأكل وإكرام للضيف ونحو ذلك.

يقول الدكتور محمد الدويش في تأثير الاجتماع العائلي على مائدة الطعام: إن التبسط والابتعاد عن الجو الرسمي الذي ساد الكثير من جلسات الآباء مع أبنائهم، يتجلى ويظهر في الاجتماع العائلي على مائدة الطعام، فعندما يعيش الابن مع والديه في جلسة ويتحدث وهو متبسط على سجيته وطبيعته، يكتشف الوالدان الكثير من جوانب شخصية أبنائهم، وبالمثل يكتشف الابن جوانب من شخصية والديه، فالطعام فرصة لحديث الأولاد والبنات مع والديهم، الذين يعتبرونهم قدوة ومثلا لهم، كما أن الاجتماع يزيل الكثير من الأنانية التي يمكن أن يتربى عليها الأطفال، فعندما تكون هناك فاكهة - مثلا - قد يعمد الابن إلى أن يتركها لوالده، أي أن هناك قيمًا جماعية يمكن أن يتعلمها من خلال الجو الجماعي الذي يعيشه على مائدة الطعام.

فلنحرص على إحياء هذه السُّنَّة المباركة، بتطبيقها وحث الجميع عليها، حتى ننال البركة المترتبة على الاجتماع على الطعام، وننال أجر إحياء سنة من سنن نبينا المصطفى صلى الله عليه وسلم."""),
    SonnModel(
        title: 'صلاة الوتر',
        description:
            """عن عبد الله بن عمر بن الخطاب رضي الله عنهما، عن النبي صلى الله عليه وسلم قال: (اجْعَلُوا آخِرَ صَلاَتِكُمْ بِاللَّيْلِ وِتْرًا) متفق عليه.

حظيت صلاة الوتر بأهمية خاصة عند رسول الله صلى الله عليه وسلم، حيث كـان يُوصي أصحابه - رضوان الله عليهم أجمعين - بها على وجه الـخصوص؛ فقد أوصى بها أبا هريرة رضي الله عنه مع بعض العبادات الأخرى؛ وذلك كما في رواية البخاري عن أبي هريرة رضي الله عنه قال: أَوْصَانِي خَلِيلِي صلى الله عليه وسلم بِثَلاَثٍ: (صِيَامِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ، وَرَكْعَتَيِ الضُّحَى، وَأَنْ أُوتِرَ قَبْلَ أَنْ أَنَامَ)، وأوصى أبا الدرداء رضي الله عنه الوصيـة نفسهـا؛ فقد روى مسلم عن أبي الدرداء رضي الله عنه قال: أَوْصَانِي حَبِيبِي صلى الله عليه وسلم بِثَلاَثٍ لَنْ أَدَعَهُنَّ مَا عِشْتُ: (بِصِيَامِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ، وَصَلاَةِ الضُّحَى، وَبِأَنْ لاَ أَنَامَ حَتَّى أُوتِرَ).

وصلاة الوتر تكون بعد صلاة قيام الليل؛ وذلك لما ورد عن عبد الله بن عمر رضي الله عنهما قال: إِنَّ رَجُلاً قَالَ: يَا رَسُولَ اللَّهِ، كَيْفَ صَلاَةُ اللَّيْلِ؟ قَالَ: (مَثْنَى مَثْنَى، فَإِذَا خِفْتَ الصُّبْحَ، فَأَوْتِرْ بِوَاحِدَةٍ) متفق عليه.

وصلاة الوتر يمكن أن تكون قبل النوم، ويمكن أن تكون بعد الاستيقاظ من النوم، فعن أبي قتادة الأنصاري رضي الله عنه أن النبي صلى الله عليه وسلم قال لأبي بكر: (مَتَى تُوتِرُ؟)، قَالَ: أُوتِرُ قَبْلَ أَنْ أَنَامَ. وَقَالَ لِعُمَرَ: (مَتَى تُوتِرُ؟)، قَالَ: أَنَامُ ثُمَّ أُوتِرُ، فَقَالَ لأَبِي بَكْرٍ: (أَخَذْتَ بِالْحَزْمِ أَوْ بِالْوَثِيقَةِ)، وَقَالَ لِعُمَرَ: (أَخَذْتَ بِالْقُوَّةِ) أخرجه الحاكم في المستدرك وصححه، ووافقه الذهبي.

ويُشْتَرط أن يكون الوتر قبل صلاة الصبح، فإذا أذن الفجر ذهب وقتها، لما أخبر به أبو سعيد الخدري رضي الله عنه أَنَّهُمْ سَأَلُوا النَّبِيَّ صلى الله عليه وسلم عَنِ الْوِتْرِ، فَقَالَ: (أَوْتِرُوا قَبْلَ الصُّبْحِ) رواه مسلم.

وقد بلغ من حرص الصحابة على صلاة الوتر أن خاف عليُّ بن أبي طالب رضي الله عنه أن يظن الناس أن الوتر فريضة، فقال: "الوِتْرُ لَيْسَ بِحَتْمٍ كَصَلاَتِكُمُ المَكْتُوبَةِ، وَلَكِنْ سَنَّ رَسُولُ اللهِ صلى الله عليه وسلم"، وقال: "إِنَّ اللَّهَ وِتْرٌ يُحِبُّ الوِتْرَ، فَأَوْتِرُوا يَا أَهْلَ القُرْآنِ" رواه الترمذي وحسنه، وصححه الألباني.

فلنحرص على إحياء هذه السُّنَّة العظيمة، بتطبيقها وحث الناس عليها، حتى ننال ثوابها، وحتى ننال أجر إحياء سنة من سنن المصطفى صلى الله عليه وسلم."""),
    SonnModel(
        title: 'التبكير إلى صلاة الجمعة',
        description:
            """عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (مَنِ اغْتَسَلَ يَوْمَ الجُمُعَةِ غُسْلَ الجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ، وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً، فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ المَلاَئِكَةُ يَسْتَمِعُونَ الذِّكْرَ) متفق عليه.

وعنه أن رسول الله صلى الله عليه وسلم قال: (إذا كان يوم الجمعة كان على كل باب من أبواب المسجد ملائكة يكتبون الأول فالأول، فإذا جلس الإمام طووا الصحف وجاءوا يستمعون الذكر) رواه البخاري.

ليس في مقدور غالب المسلمين أن يتصدقوا كل أسبوع بناقة أو بقرة أو كبش ونحو ذلك، ولكن الله عز وجل الكريم الجواد منحنا فرصة أسبوعية للفوز بأجر يعدل التصدق بمثل ذلك، لمن جاء مبكرًا إلى صلاة الجمعة، التي تعد محفلا أسبوعيا يجتمع فيه المسلمون للتعبد والتعارف والتعلم والتآلف، فمن راح إلى الجمعة في الساعة الأولى (فَكَأَنَّمَا قَرَّبَ بَدَنَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ، وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً...).

قال الإمام ابن الأثير في المقصود من الرّوَاح إلى الجمعة: "أي مشى إليها وذهب إلى الصلاة، ولم يرد رواح آخر النهار، يقال راح القوم تروحوا إذا ساروا أي وقت كان، وقيل أصل الرّوَاح أن يكون بعد الزوال، فلا تكون الساعات التي عددها في الحديث إلا في ساعة واحدة من يوم الجمعة، وهي بعد الزوال، كقولك: قعدت عندك ساعة، وإنما تريد جزءًا من الزمان، وإن لم تكن ساعة حقيقية التي هي جزء من أربعة وعشرين جزءًا مجموع الليل والنهار" ا.هـ.

ورغم أن العلماء اختلفوا في تحديد معنى الساعات المذكورة في الحديث؛ إلا أن هدف التبكير واضح، وسيتحقَّق لك إن شاء الله بذهابك قبل الصلاة بساعة أو أكثر أو أقل، لكن المهم أن لا تتأخَّر حتى يصعد الإمام إلى المنبر، وإلا راح الأجر كله، لقول النبي صلى الله عليه وسلم: (فإذا جلس الإمام طووا الصحف وجاءوا يستمعون الذكر).

فلنحرص على إحياء هذه السُّنَّة العظيمة، بتطبيقها وحث الناس عليها، حتى ننال ثوابها العظيم، وحتى ننال أجر إحياء سنة من سنن المصطفى صلى الله عليه وسلم."""),
    SonnModel(
        title: 'السعي في قضاء حوائج الناس',
        description:
            """عن عبد الله بن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال: (المُسْلِمُ أَخُو المُسْلِمِ لاَ يَظْلِمُهُ وَلاَ يُسْلِمُهُ، وَمَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ الله فِي حَاجَتِهِ، وَمَنْ فرَّجَ عَنْ مُسْلِمٍ كُرْبَةً، فرَّجَ الله عَنْهُ كُرْبَةً مِنْ كُرُبَاتِ يَوْمِ القِيَامَةِ، وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَوْمَ القِيَامَةِ) رواه البخاري ومسلم، وعند الطبراني بإسناد صحيح أن رسول الله صلى الله عليه وسلم قال: (.. وَلأَنْ أَمْشِيَ مَعَ أَخٍ لِي فِي حَاجَةٍ أَحَبُّ إِلَيَّ مِنْ أَنْ أَعْتَكِفَ فِي هَذَا الْمَسْجِدِ - يَعْنِي مَسْجِدَ الْمَدِينَةِ - شَهْرًا)، وفي رواية أخرى عند الطبراني أيضاً: (.. وَمَنْ مَشَى مَعَ أَخِيهِ فِي حَاجَةٍ حَتَّى أَثْبَتَهَا لَهُ، أَثْبَتَ الله عَزَّ وَجَلَّ قَدَمَهُ عَلَى الصِّرَاطِ يَوْمَ تَزِلُّ فِيهِ الأَقْدَامُ).

كثيرة هي الأعمال التي يحتاج كل إنسان أن يقوم بها في حياته؛ خاصة إذا كان مسئولاً عن عائلة وأسرة؛ فهناك أعمال اقتصادية، وأخرى اجتماعية، وثالثة إدارية، ورابعة صحية، وغير ذلك من واجبات يحملها أي إنسان كل صباح ومساء، وقد يعجز المرء عن القيام بجميع هذه الواجبات، فيقع الضرر عليه أو على مَنْ يحبُّ، وهنا يبرز دور هذه السُّنَّة النبوية الجميلة التي بين أيدينا، وهي سُنَّة السعي لقضاء حوائج الناس.

وقد يظنُّ البعض أن مساعدة الناس لا تكون إلا بالمال، أو يظن أن اكتفاءه بإعطاء المال يُغنيه عن السعي والتحرك مع إخوانه لقضاء حوائجهم؛ ولكن الواقع أن "السعي" لقضاء الحاجات من أَجَلِّ الأعمال، وأعظمها عند الله جل وعلا؛ إذ أن ذلك يفوق أجر المعتكف المنقطع لعبادة الله تعالى.

فالواضح أن المقصود هو "السعي" لإتمام الحاجة، والحاجة قد تكون في إنهاء بعض الإجراءات القانونية التي تتطلب وجاهة، أو في شراء أشياء ومتطلبات، أو في المصاحبة في سفر أو زيارة، أو في صناعة شيء أو إصلاحه أو إعداده، أو غير ذلك من الأشياء التي تحتاج إلى جهد.

كما أن أهل المروءة والنجدة لا يمكنهم أن يروا مضطراً إلا أجابوه، ولا محتاجاً إلا أعانوه، ولا ملهوفاً إلا أغاثوه، فإن هذا من أصول المروءة كما قال ميمون بن مهران: "أول المروءة طلاقة الوجه، والثاني التودد، والثالث قضاء الحوائج"، وقال سفيان الثوري: "المروءة: الإنصاف من النفس، والتفضل".

ولأن المسلم يقوم بقضاء هذه الحاجات ابتغاء مرضاة الله تعالى، فإن الله عز وجل يُكافئه بالمساعدة في حاجته يوم احتياجه؛ سواء في الدنيا بتيسير من يكون له عوناً في قضاء حوائجه وتسهيل أعماله، أو في الآخرة بتثبيت الأقدام على الصراط، فواقع الأمر بهذه الصورة أن المستفيد الأكبر من قضاء الحاجات هو قاضي الحاجة نفسه وصاحب الوجاهة الذي سعي مع غيره لمساعدته وقضاء مصلحته، وهذا هو المقصد الرئيس من هذه السُّنَّة النبوية."""),
    SonnModel(
        title: 'البشاشة والتبسم',
        description:
            """عن أبي ذر الغفاري رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (تَبَسُّمُكَ فِي وَجْهِ أَخِيكَ لَكَ صَدَقَةٌ) رواه الترمذي، وصححه الألباني.

قال الإمام المناوي: "(تبسُّمك في وجه أخيك لك صدقة) يعني: إظهارك له البَشَاشَة والبِشْر إذا لقيته، تؤجر عليه كما تؤجر على الصَّدقة".

وقال الإمام ابن بطَّال: "فيه أنَّ لقاء النَّاس بالتَّبسُّم، وطلاقة الوجه، من أخلاق النُّبوة، وهو مناف للتكبُّر، وجالب للمودَّة".

ما أجمل أن تنتشر البسمة في المجتمع المسلم، حتى تُخَفِّف كثيرًا من الآلام التي يعيشها الناس في حياتهم اليومية، وليس بالضرورة أن يكون المرء خاليًا من الأزمات والمشاكل حتى يبتسم؛ إذ كان رسولنا صلى الله عليه وسلم يبتسم دومًا، رغم الأحزان التي كانت تلاحقه من آنٍ لآخر، وكانت البسمة إحدى صفاته التي تحلّى بها، حتى صارت عنواناً له وعلامةً عليه، وكان لا يُفَرِّق في حُسْن لقائه وبشاشته بين الغنيّ والفقير، والأسود والأبيض، حتى الأطفال كان يبتسم في وجوههم ويُحسِن لقاءهم، يعرف ذلك كل من صاحبه وخالطه، فعن عبد الله بن الحارث رضي الله عنه قال: "مَا رَأَيْتُ أَحَدًا أَكْثَرَ تَبَسُّمًا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم" رواه الترمذي، وصححه الألباني، وعن جرير بن عبد الله البجلي رضي الله عنه قال: "ما حجبني رسول الله صلى الله عليه وسلم منذُ أسلمتُ، ولا رآني إلا تبسمَ في وجهي" رواه مسلم.

وقد بوَّب الإمام البخاري في "صحيحه": (باب: التبسم والضحك) وجمع أحاديث كثيرة عن النبي صلى الله عليه وسلم في ذلك، وكذلك جمع الإمام مسلم في "صحيحه" أحاديث في التبسم، بوَّب لها الإمام النووي في كتاب الفضائل: (باب: تبسمه وحسن عشرته صلى الله عليه وسلم)، وكل ذلك يدل على البشاشة والابتسامة التي كانت تلازم النبي صلى الله عليه وسلم.

فلنحرص على إشاعة الابتسامة في المجتمع؛ لأنها تغرس الألفة والمحبة بين الناس، بالإضافة إلى كونها سنة نبوية، ووسيلة دعوية، ومفتاحاً للقلوب، وكنزاً عظيماً تنفق منه على أهلك وإخوانك وجيرانك، وكل من تقابله وتدعوه، وصدقة لا تكلفك ديناراً ولا درهماً، وهي قبل كل ذلك لك صدقة، تدخرها عند الله سبحانه."""),
    SonnModel(
        title: 'إهداء الطعام بين الجيران',
        description:
            """عن أبي ذر الغفاري رضي الله عنه قال: إن خليلي صلى الله عليه وسلم أوصاني: (إِذَا طَبَخْتَ مَرَقًا فَأَكْثِرْ مَاءَهُ، ثُمَّ انْظُرْ أَهْلَ بَيْتٍ مِنْ جِيرَانِكَ، فَأَصِبْهُمْ مِنْهَا بِمَعْرُوفٍ) رواه مسلم.

وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: (يَا نِسَاءَ المُسْلِمَاتِ، لاَ تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا، وَلَوْ فِرْسِنَ شَاةٍ) رواه البخاري.

فِرْسِن الشاة: هو ما دون الرسغ من يدها، وقيل: هو عظم قليل اللحم، والمقصود المبالغة في الحثِّ على الإهداء.

يحث ديننا الحنيف أتباعه على التلاحم والترابط والشعور بالآخرين؛ لذلك كان رسولنا صلى الله عليه وسلم يُوصي بالجيران دائماً، فهم أقرب الناس إلينا، وأكثرهم ملاصقة لنا، ولو فقدنا الاهتمام بهم فسيكون ذلك مُقَدِّمة لفقد الاهتمام بكلِّ المسلمين.

وإذا تأملنا الحديثين فسنجد الأول منهما مُوَجَّها من رسول الله صلى الله عليه وسلم إلى الرجل، والثاني هو نصيحة خاصَّة للمرأة المسلمة، حتى يقوم كل منهما -الرجل والمرأة- بتلك السُّنة، ويبادر إليها، ويحرص على تطبيقها.

وقد أكثر جبريل عليه السلام من التأكيد على رسول الله صلى الله عليه وسلم في حق الجار، وما ذاك إلا لعِظَم حقه، فعن عبد الله بن عمر رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم: (مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ، حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ) رواه البخاري.

ولذا فإن إهداء الطعام للجار نوعٌ من تطبيق الوصية بالإحسان إليه، وإدخال للسرور إلى قلبه، وإزكاء لروح المحبة والمودة، وتقوية لأواصر الروابط الاجتماعية.

وليس المقصود من هذه السُّنَّة صناعة طعامٍ خاصٍّ للجيران، حتى لا يتكلف المرء ما لا يطيق، ولكن المراد إهداؤهم من الطعام الذي تأكله الأسرة، ويكون ذلك بزيادة كمية الطعام قليلاً حتى يمكن إهداء الجيران منه.

ومما يتعلق بذلك أيضاً: صناعة الطعام للجيران إذا حصلت عندهم وفاة، فعن عبد الله بن جعفر رضي الله عنه قال: قال النبي صلى الله عليه وسلم حين قُتِل جعفر: (اصنعوا لآل جعفر طعاماً، فإنه قد أتاهم أمر شغلهم) رواه أبو داود بإسناد صحيح، قال الإمام الشافعي: "وأحب لجيران الميت أو ذي القرابة أن يعملوا لأهل الميت في يوم يموت وليلته طعاماً يشبعهم، فإن ذلك سُنَّة، وذِكْرٌ كريم، وهو من فعل أهل الخير قبلنا وبعدنا".

فلنحرص على هذه السُّنَّة الجليلة التي تنشر المحبَّة والودَّ في أركان المجتمع، مع رعاية عدم التكلُّف في الطعام بإرسال كمية كبيرة، قد يعجز الجار عن المبادلة بمثلها، أو يكون ذلك مانعاً لنا من المحافظة على هذه السُّنة الاجتماعية التي تؤلف بين قلوب المسلمين، وتزرع المودة والتعاطف بينهم."""),
    SonnModel(
        title: 'فضيلة الإصلاح بين النّاس',
        description:
            """عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (أَلَا أُخْبِرُكُمْ بِأَفْضَلَ مِنْ دَرَجَةِ الصِّيَامِ وَالصَّلَاةِ وَالصَّدَقَةِ) قالوا: بلى يا رسول الله، قال: (صَلَاحُ ذَاتِ البَيْنِ، فَإِنَّ فَسَادَ ذَاتِ البَيْنِ هِيَ الحَالِقَةُ) رواه الترمذي وقال: هذا حديث صحيح، وفي رواية عنده أيضا: أن النّبيّ صلى الله عليه وسلم قال: (.. هِيَ الْحَالِقَةُ، لَا أَقُولُ تَحْلِقُ الشَّعَرَ، وَلَكِنْ تَحْلِقُ الدِّينَ).

(الإصلاح) بين الناس سُنّة جليلة حثّنا عليها النّبيُّ صلّى الله عليه وسلّم، وعبادة عظيمة يحبها الله سبحانه وتعالى، فالمُصلح هو ذلك الذي يبذل جهده وماله وجاهه ليصلح بين المتخاصمين، ولا يخفى أنّ الخلاف أمر طبيعيٌّ بين البشر، لا يسلم منه أحد، فخيار البشر حصل بينهم الخلاف، فكيف بغيرهم!!

كم بيتٍ كاد أن يتهدّم بسبب خلاف سهل بين الزّوج وزوجه، وكاد الطّلاق أن يحدث، فإذا بهذا المُصلح بكلمة طيبة، ونصيحة غالية، ومال مبذول، يعيد المياه إلى مجاريها، ويصلح بينهما ليستمر البيت قائمًا.

وكم من شقاق أو قطيعة كادت أن تكون بين أخوين، أو صديقين، أو قريبين بسبب زلّة أو هفوة، وإذا بهذا المصلح يرقّع خرق الفتنة ويصلح بينهما.

كم عصم الله بالمصلحين من دماء وأموال، وفتن شيطانية كادت أن تشتعل، لولا فضل الله عزّ وجلّ ثم سعي المُصلحين.

ومهما قلنا من كلمات لإبراز قيمة هذا العمل في ميزان الله عز وجل فإنّنا لن نقدر، فقد رفعه رسول الله صلى الله عليه وسلم فوق درجة صيام النّافلة، وصلاة النّافلة، وصدقة النّافلة.

وتتحقَّق هذه السُّنَّة بالإصلاح بين رجلٍ وزوجته، أو بين أبٍ وابنه، أو بين أخ وأخيه، أو بين صديق في العمل وزميله، أو بين جارٍ وجاره؛ بل تتحقَّق بإصلاحٍ لمشادَّة في الطّريق بين اثنين لا تعرفهما.

وفي المقابل .. إذا أتانا المُصلح الذي يريد الإصلاح مع من نتخاصم معه أو مع من نزغ الشّيطان بيننا وبينه، فعلينا أن نفتح له أبوابنا وقلوبنا، وأن ندعو له ونشكره على سعيه في الإصلاح ورأب الصّدع، وإذا طلب منا طلباً أو طلب منا أن نتنازل عن شيء، فعلينا أن نُقبل إلى ذلك، ونقرّب المسافات، حتى تسهل مهمته، ليرضى ربّنا عنّا.

إنّ (الإصلاح) فيما بين النّاس هو الحافظ لديننا، كما أن الإفساد هو الذاهب بالدين، فعلينا أن نجتهد في (الإصلاح) ما استطعنا إلى ذلك سبيلاً، وما أكثر الخصام بين الناس! وما أكثر المتخاصمين فيما بينهم! وهل ترك الشيطان أحداً من شره؟"""),
    SonnModel(
        title: 'كظم الغيظ',
        description:
            """عن معاذ بن أنس الجهنيِّ رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (مَنْ كَظَمَ غَيْظـًا وَهُوَ قَـادِرٌ عَلَى أَنْ يُنْفِذَهُ، دَعَـاهُ اللَّهُ عَزَّ وَجَلَّ عَلَى رُءُوسِ الْخَلاَئِقِ يَوْمَ الْقِيَامَةِ حَتَّى يُخَيِّرَهُ اللَّهُ مِنَ الْحُورِ الْعِينِ مَـا شَـاءَ) رواه أبو داود والترمذي، وحسنه الألباني.

وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (لَيْسَ الشَّدِيدُ بِالصُّرَعَةِ، إِنَّمَا الشَّدِيدُ الَّذِي يَمْلِكُ نَفْسَهُ عِنْدَ الغَضَبِ) رواه البخاري في "صحيحه".

(كَظَم غَيْظَا) أي سكت عليه، ولم يُظْهِره بقولٍ أو فعلٍ، مع قُدْرته على إيقاعه بعدوِّه، قال الإمام ابن عطيَّة: "كَظم الغَيْظ: ردُّه في الجَوْف إذا كاد أن يخرج مِن كَثْرَته، فضبطه ومَنَعَه"، وقال أيضاً: "الغَيْظ: أصل الغَضَب، وكثيراً ما يتلازمان، ولذلك فسَّر بعض النَّاس الغَيْظ بالغَضَب، وليس تحرير الأمر كذلك، بل الغَيْظ: فعل النَّفس، لا يظهر على الجوارح. والغَضَبُ: حالٌ لها معه ظهورٌ في الجوارح، وفعلٌ ما ولا بدَّ، ولهذا جاز إسناد الغَضَب إلى الله تعالى، إذ هو عبارة عن أفعاله في المغضوب عليهم، ولا يُسْند إليه تعالى غيظٌ".

يحرص الشيطان دائماً عند المنازعات والخصومات على أن يثير غيظ بني آدم وغضبه؛ لأن ذلك يُسَهِّل سيطرته عليهم، ويدفعهم بذلك إلى شرورٍ غير متوقعة. وكان إبليس يعرف ذلك عن آدم عليه السلام وذريته منذ بداية الخليقة، فعن أنس بن مالك رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (لَمَّا صَوَّرَ اللهُ آدَمَ فِي الْجَنَّةِ تَرَكَهُ مَا شَاءَ اللهُ أَنْ يَتْرُكَهُ، فَجَعَلَ إِبْلِيسُ يُطِيفُ بِهِ، يَنْظُرُ مَا هُوَ، فَلَمَّا رَآهُ أَجْوَفَ، عَرَفَ أَنَّهُ خُلِقَ خَلْقًا لاَ يَتَمَالَكُ) رواه مسلم.

ومعنى (لا يتمالك) أي: ليس لديه القدرة على أن يملك نفسه عند الغيظ والغضب، أو لا يملك نفسه، ويحبِسها عن الشهوات، أو لا يملك دفع الوسواس عنه -كما ذكر ذلك الإمام النووي-، ومن هنا كان من سُنَّة الرسول صلى الله عليه وسلم أن يمنع كيد الشيطان بكظم الغيظ وعدم إنفاذه، والترغيب في ذلك بالمنزلة العالية يوم القيامة.

وقد عظَّم الله جل وعلا أجر الكاظمين الغيظ والعافين عن الناس؛ فقال تعالى: {وَسَارِعُوا إِلَى مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمَاوَاتُ وَالأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ * الَّذِينَ يُنْفِقُونَ فِي السَّرَّاءِ وَالضَّرَّاءِ وَالْكَاظِمِينَ الْغَيْظَ وَالْعَافِينَ عَنِ النَّاسِ وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ} (آل عمران:133-134).

ومما يروى في هذا الصدد، أنه كان للمأمون -الخليفة العباسي ابن هارون الرشيد خادم، وهو صاحب وضوئه، فبينما هو يصب الماء على يديه إذ سقط الإناء من يده، فاغتاظ المأمون عليه، فقال: يا أمير المؤمنين! إن الله يقول: {وَالْكاظِمِينَ الْغَيْظَ} فقال المأمون: قد كظمت غيظي عنك، قال: {وَالْعافِينَ عَنِ النَّاسِ} قال: قد عفوت عنك، قال: {وَاللَّهُ يُحِبُّ الْمُحْسِنِينَ} قال: اذهب، فأنت حر.

فما أعظمها مِنْ سُنَّة، تنفعنا في الدنيا بهدوء الحال، وتنفعنا في الآخرة بطيب المآل."""),
    SonnModel(
        title: 'الدعاء بظهر الغيب',
        description:
            """عن أبي الدرداء رضي الله عنه قال: قال رسول اللهِ صلى الله عليه وسلم: (مَا مِنْ عَبْدٍ مُسْلِمٍ يَدْعُو لأَخِيهِ بِظَهْرِ الْغَيْبِ، إِلاَّ قَالَ الْمَلَكُ: وَلَكَ بِمِثْلٍ) رواه مسلم، وفي رواية له عن أبي الدرداء مرفوعاً: (مَنْ دَعَا لأَخِيهِ بِظَهْرِ الْغَيْبِ، قَالَ الْمَلَكُ الْمُوَكَّلُ بِهِ: آمِينَ، وَلَكَ بِمِثْلٍ).

يتميز سلوك المسلم عن غيره بأنه يحب الخير لإخوانه المسلمين كما يحبه لنفسه، مصداقاً لقول النبي صلى الله عليه وسلم: (لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه)، وقد عززت شريعتنا الغراء هذا المسلك بفضيلة: (الدعاء بظهر الغيب)، أي الدعاء للغير وهو غائب غير حاضر.

هذه الصورة الرائعة التي يُشَجِّعنا بها رسول الله صلى الله عليه وسلم على الدعاء للمسلمين، تتضمن وعداً بأن الخير الذي ستدعو به لن يصل إلى المدعو له فقط، وإنما سيناله الداعي كذلك؛ لأن الله الذي أرسل الملَكَ ليقول: "آمِينَ"، أرسله وهو يُريد الإجابة، كما أن الملَكَ يقول بيقين: "وَلَكَ بِمِثْلٍ"، وهذا أمر لا يمكن أن يقطع به الملَكَ بمفرده، إنما أخبره الله سبحانه وتعالى بتحقُّق الإجابة، فصار أداء هذه السُّنَّة الجميلة نافعًا للطرفين: الداعي والمدعو له.

بل أكَّدت الصحابية الجليلة أم الدرداء رضي الله عنها لزوج ابنتها الدرداء -وهو عبد الله بن صفوان- أن هذه الدعوة مستجابة، فعن عبد الله بن صفوان رضي الله عنه قال: قَدِمْتُ الشَّامَ، فَأَتَيْتُ أَبَا الدَّرْدَاءِ رضي الله عنه فِي مَنْزِلِهِ، فَلَمْ أَجِدْهُ وَوَجَدْتُ أُمَّ الدَّرْدَاءِ رضي الله عنها، فَقَالَتْ: أَتُرِيدُ الْحَجَّ هذا الْعَامَ؟ فَقُلْتُ: نَعَمْ. قَالَتْ: فَادْعُ اللهَ لَنَا بِخَيْرٍ، فَإِنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقُولُ: (دَعْوَةُ الْمَرْءِ الْمُسْلِمِ لأَخِيهِ بِظَهْرِ الْغَيْبِ مُسْتَجَابَةٌ، عِنْدَ رَأْسِهِ مَلَكٌ مُوَكَّلٌ كُلَّمَا دَعَا لأَخِيهِ بِخَيْرٍ، قَالَ الْمَلَكُ الْمُوَكَّلُ بِهِ: آمِينَ وَلَكَ بِمِثْلٍ) رواه مسلم.

قال الإمام النووي: "وَكَانَ بَعْض السَّلَف إِذَا أَرَادَ أَنْ يَدْعُو لِنَفْسِهِ يَدْعُو لِأَخِيهِ الْمُسْلِم بِتِلْكَ الدَّعْوَة؛ لِأَنَّهَا تُسْتَجَاب، وَيَحْصُل لَهُ مِثْلهَا".

وعن أم المؤمنين عائشة رضي الله عنها قالت: لما رأيت من رسول الله صلى الله عليه وسلم طيبَ نفسٍ، قلت: يا رسول الله، ادع الله لي، قال: (اللهم اغفر لعائشة ما تقدم من ذنبها وما تأخر، وما أسرت وما أعلنت)، فضحكت عائشة حتى سقط رأسها في حِجْر رسول الله صلى الله عليه وسلم من الضحك، فقال لها رسول الله صلى الله عليه وسلم: (أيسرك دعائي؟)، فقلت: وما لي لا يسرني دعاؤك، فقال صلى الله عليه وسلم: (إنه لدعائي لأمتي في كل صلاة) رواه ابن حبان في "صحيحه" وحسنه الألباني.

فلنطَبِّق هذه السُّنَّة الرائعة، ونراجع سجلَّ إخواننا وأصدقائنا، ولنَدْعُ لكلِّ واحد منهم بما نتوقَّع أنه يحتاجه، وسيستجيب الله عز وجل لدعائنا؛ فيخرج إخواننا من أزماتهم، ويتحقَّق لنا من الخير مثل الذي دعونا به لهم."""),
  ];
}
